import type { Translations } from './translations';

const text: Translations = {
  Main: {
    director: {
      alt: 'डा. बी. वी. रमणा रेड्डी',
      title: 'निर्देशक का कोना',
      name: 'डा. बी. वी. रमणा रेड्डी',
      quote: [
        `भारत, साधकों की भूमि, ११०० वर्षों की पराधीनता, युद्ध, विलय और अपमान के बाद फिर से विश्व गुरु बन्ने
      के शिखर पर है। हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण ७५ वर्षों से यह फिर से एक स्वतंत्र
      देश है और इसने अपनी समृद्ध विविधता, संस्कृतियों, भाषाओं के साथ राष्ट्र के निर्माण की कई चुनौतियों के बीच
      खड़े होने की कला सीख ली है। देश को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता ही हमारा मंत्र है।`,
        'मैं इस संस्था की वेबसाइट पर आने वाले सभी लोगों का हृदय से स्वागत करता हूं।',
      ],
      more: 'और पढ़ें',
    },
  },

  Clubs: { title: 'संघठनें' },
  Committee: {
    building: 'निर्माण एवं कार्य समिति',
    financial: 'वित्तीय समिति',
    governor: 'राज्यपाल मंडल',
    members: {
      title: 'सदस्य',
      serial: 'क्रम संख्या',
      nomination: 'नामांकन',
      name: 'नाम',
      servingAs: 'के रूप में सेवारत',
    },
    meetings: {
      title: 'बैठकें',
      serial: 'बैठक संख्या',
      date: 'दिनांक',
      place: 'स्थान',
      agenda: 'कार्यसूची',
      minutes: 'विवरण',
    },
  },
  Curricula: {
    pageTitle: 'पाठ्यक्रम',
    code: 'कोड',
    title: 'शीर्षक',
    major: 'क्रमादेश',
    credits: 'एल-टी-पी',
    totalCredits: 'क्रेडिट्स',
    syllabus: 'पाठ्यक्रम',
  },
  Departments: { title: 'विभाग' },
  Department: {
    headings: {
      about: 'परिचय',
      vision: 'दृष्टि',
      and: 'और',
      mission: 'उद्देश्य',
      hod: {
        title: 'विभागाध्यक्ष का संदेश',
        session: (from: string) => `शैक्षणिक सत्र ${from} - वर्तमान`,
      },
      programmes: {
        title: 'कार्यक्रम',
        undergrad: 'पूर्वस्नातक',
        postgrad: 'स्नातकोत्तर',
        doctorate: 'डॉक्टरेट',
      },
      gallery: 'चित्र',
    },
    facultyAndStaff: 'संकाय और कर्मचारी',
    laboratories: 'प्रयोगशालाएँ',
    achievements: 'छात्र उपलब्धियाँ',
  },
  FacultyAndStaff: {
    placeholder: 'नाम या ईमेल से खोजें',
    departmentHead: 'विभागाध्यक्ष',
  },
  FAQ: { title: 'अक्सर पूछे जाने वाले प्रश्न' },
  Footer: {
    logo: 'प्रतीक चिन्ह',
    nit: 'राष्ट्रीय प्रौद्योगिकी संस्थान, कुरूक्षेत्र',
    location: 'थानेसर, हरियाणा, भारत १३६११९',
    design: 'कलाकृति',
    headings: ['त्वरित संदर्भ', 'त्वरित संदर्भ', 'त्वरित संदर्भ'],
    lorem: 'लोरेम इप्सम',
    copyright:
      '© २०२४ राष्ट्रीय प्रौद्योगिकी संस्थान कुरूक्षेत्र। सर्वाधिकार आरक्षित।',
  },
  Forms: { title: 'फॉर्म्स' },
  Header: {
    institute: 'संस्थान',
    academics: 'शैक्षिक',
    faculty: 'संकाय और कर्मचारी',
    placement: 'प्रशिक्षण एवं नियुक्ति',
    activities: 'छात्र गतिविधियाँ',
    alumni: 'भूतपूर्व छात्र',
    logo: 'प्रतीक चिन्ह',
    search: 'त्वरित खोज...',
    login: 'प्रवेश',
    profile: { alt: 'मेरी छवि', view: 'विवरण देखें' },
  },
  Login: {
    title: 'प्रवेश करें',
    enterEmail: 'अपना ईमेल दर्ज करें',
    continueButton: 'अगले चरण पर बढ़ें (तैयार नहीं)',
    signInWithGoogle: 'गूगल द्वारा प्रवेश करें',
  },
  Notifications: {
    title: 'सूचनाएँ',
    categories: {
      academic: 'शैक्षणिक',
      tender: 'निविदाएँ',
      workshop: 'कार्यशालाएं',
      recruitment: 'नियुक्ति',
    },
    viewAll: 'सारा देखें',
  },
  NotFound: {
    title: 'नहीं मिला',
    description: 'अनुरोधित संसाधन नहीं मिल सका',
    backHome: 'घर लौटें',
  },
  Profile: {
    tabs: {
      personal: {
        title: 'व्यक्तिगत विवरण',
        basic: {
          title: 'मूलभूत',
          name: 'नाम',
          rollNumber: 'रोल संख्या',
          sex: 'लिंग',
          dateOfBirth: 'जन्मदिन',
        },
        contact: {
          title: 'संपर्क',
          email: 'संस्थान ईमेल',
          personalEmail: 'व्यक्तिगत ईमेल',
          telephone: 'टेलीफ़ोन',
          alternateTelephone: 'वैकल्पिक टेलीफ़ोन',
        },
        institute: {
          title: 'संस्था',
          degree: 'उपाधि',
          major: 'क्रमादेश',
          currentSemester: 'मौजूदा छमाही',
          section: 'अनुभाग',
        },
        admission: {
          title: 'प्रवेश',
          applicationNumber: 'प्रवेश संख्या',
          candidateCategory: 'उम्मीदवार श्रेणी',
          admissionCategory: 'प्रवेश श्रेणी',
          admissionSubcategory: 'प्रवेश उपश्रेणी',
          dateOfAdmission: 'प्रवेश की तिथि',
        },
        guardians: {
          title: 'अभिभावक',
          father: 'पिता',
          mother: 'माता',
          local: 'स्थानीय संरक्षक',
          name: 'नाम',
          telephone: 'टेलीफ़ोन',
          email: 'ईमेल',
        },
        address: {
          title: 'पता',
          permanent: 'स्थायी पता',
          pinCode: 'पिन कोड',
        },
      },
      notifications: { title: 'सूचनाएँ' },
      courses: { title: 'पाठ्यक्रम' },
      clubs: { title: 'संघठन' },
      results: { title: 'परिणाम और विस्तृत अंक प्रमाण पत्र' },
      bookmarks: { title: 'बुकमार्क्स' },
      quickSend: { title: 'त्वरित प्रेषण' },
    },
    logout: 'प्रस्थान करें',
  },
  Search: {
    placeholder: 'त्वरित खोज...',
    categories: {
      all: 'सभी परिणाम',
      clubs: 'क्लब',
      committees: 'समितियां',
      courses: 'पाठ्यक्रम',
      departments: 'विभाग',
      faculty: 'लोग',
      sections: 'खंड',
      staff: 'कर्मचारी',
    },
    viewAll: 'सारा देखें',
    default: {
      recents: 'ताज़ा खोजें',
      clearRecents: 'हाल की खोजें साफ़ करें',
      mostSearched: 'एनआईटी की सर्वाधिक खोजें',
      studentLinks: {
        title: 'छात्र संबंधित त्वरित लिंक',
        clubs: 'संघठनें',
        courses: 'पाठ्यक्रम',
        departments: 'विभाग',
        notifications: 'सूचनाएँ',
        results: 'परिणाम',
      },
      facultyLinks: {
        title: 'संकाय संबंधित त्वरित लिंक',
        notifications: 'सूचनाएँ',
        profile: 'मेरा विवरण',
      },
    },
  },
  Section: {
    about: 'परिचय',
    gallery: 'चित्र',

    Account: {},
    CentralLibrary: {},
    CentralWorkshop: {},
    CentreOfComputingAndNetworking: {},
    ElectricalMaintenance: {},
    Estate: {},
    GeneralAdministration: {},
    HealthCentre: {},
    Security: {},
    Sports: {},
    Store: {},
  },
  Status: {
    NoResult: {
      title: 'कोई परिणाम नहीं मिला',
      description: 'आपके दिए गए प्रश्न से कोई परिणाम मेल नहीं खाता।',
    },
    Unauthorised: {
      title: 'अनधिकृत',
      description: 'आप इस पृष्ठ को देखने के लिए अधिकृत नहीं हैं।',
    },
    WorkInProgress: {
      title: 'कार्य प्रगति पर है',
      description: 'इस पेज पर अभी काम चल रहा है। कृपया दूसरी बार आएं',
    },
  },
  StudentActivities: {
    title: 'छात्र गतिविधियाँ',
    headings: {
      clubs: 'संघठनें',
      council: 'छात्र परिषद',
      events: 'आयोजनाएँ',
      thoughtLab: 'विचार प्रयोगशाला',
      nss: 'एनएसएस',
      ncc: 'एनसीसी',
    },
    sections: { clubs: { title: 'संघठनें', more: 'सभी संघठनो को तलाशें' } },
  },
  TrainingAndPlacement: {
    title: 'प्रशिक्षण और स्थाननीयता',
    headings: {
      ourrecruiters: 'हमारे भर्तीकर्ता',
      stats: 'स्थाननीयता सांख्यिकी',
      guidelines: 'मार्गदर्शिका',
      about: 'हमारे बारे में',
      forrecruiters: 'भर्तीकर्ताओं के लिए',
      faq: 'सामान्य प्रश्न',
    },
    about: {
      content: [
        `NIT कुरुक्षेत्र देश में प्रमुख तकनीकी संस्थानों में से एक है। 1963 में क्षेत्रीय इंजीनियरिंग कॉलेज कुरुक्षेत्र के रूप में स्थापित हुआ, संस्थान को 26 जून 2002 को राष्ट्रीय प्रौद्योगिकी संस्थान कुरुक्षेत्र के नाम से पुनः नामांकित किया गया। संस्थान सात इंजीनियरिंग श्रेणियों में 4 वर्षीय बी. टेक डिग्री पाठ्यक्रम, 22 विज्ञान और प्रौद्योगिकी के क्षेत्रों में 2 वर्षीय एम. टेक डिग्री पाठ्यक्रम और एमबीए और एमसीए के डिग्री प्राप्ति के लिए स्नातकोत्तर पाठ्यक्रम प्रदान करता है। संरचना उच्च गुणवत्ता के तकनीकी कार्मिकों को उत्पन्न करने के लिए अनुकूलित है।`,
        `स्थाननीयता और प्लेसमेंट (टी एंड पी) सेल संस्थान के साथ फलदायी संबंध स्थापित करने के लिए आवश्यक संपर्क बिंदु है। सेल को प्रोफेसर इन-चार्ज के द्वारा नेतृत्व किया जाता है, और फैकल्टी इन-चार्ज, प्लेसमेंट कोआर्डिनेशन कमेटी ऑफ स्टूडेंट्स (पीसीसी) और सचिवालय का समर्थन किया गया है।`,
      ],
      tnpbrochure: `टी एंड पी ब्रोशर (2023-24)`,
      tnpteam: `टी एंड पी टीम (2023-24)`,
      facilities: {
        heading: `NIT कुरुक्षेत्र भर्ती कंपनियों को सर्वोत्तम समर्थन और सुविधाएं देता है।`,
        content: [
          'प्री-स्थाननीयता वार्ता (पीपीटी), कार्यशालाओं आदि के लिए नवीनतम मल्टीमीडिया और वाई-फाई से पूरी तरह से लैस सभागार और व्याख्यान हॉल।',

          'टेली कॉन्फ्रेंसिंग, वीडियो कॉन्फ्रेंसिंग और ऑनलाइन साक्षात्कार की सुविधा।',

          'समूह चर्चाओं और व्यक्तिगत साक्षात्कारों के लिए सेमिनार और कॉन्फ्रेंस रूम।',

          'भर्ती पैनल के लिए गेस्ट हाउस में मध्यम सुविधाओं के साथ कैंपस आवास।',

          'स्थाननीयता प्रक्रिया के हर स्तर पर छात्र समन्वयकों द्वारा पूरी सहायता।',
          'प्रक्रिया को समन्वित करने के लिए उत्साही और अनुभवी कर्मचारी।',

          'निकटतम हवाई अड्डे और कुरुक्षेत्र रेलवे स्टेशन से पिकअप सेवाएं। यह सेवाएँ दिल्ली से भी ली जा सकती हैं।',
        ],
      },
    },
    stats: {
      content: [
        `शैक्षिक सत्र 2022-23 `,
        `शैक्षिक सत्र 2021-22`,
        `शैक्षिक सत्र 2020-21 FN`,
        `शैक्षिक सत्र 2019-20 FN `,
        `शैक्षिक सत्र 2018-19 FN`,
        `शैक्षिक सत्र 2018_19`,
        `शैक्षिक सत्र 2017_18`,
        `शैक्षिक सत्र 2017-18 FN `,
        `शैक्षिक सत्र 2016_17`,
      ],
    },
    ourrecruiters: {
      about: `NIT कुरुक्षेत्र का प्रशिक्षण और स्थाननीयता सेल, संस्थान की सभी भर्ती संबंधित गतिविधियों का आयोजन करता है। सेल निरंतर उन्नत अवसरों को छात्रों के पास लाने और भ्रमण करने वाली कंपनियों और संस्थान के बीच सभी अंतराक्रियाएँ प्रबंधित करती है। NIT कुरुक्षेत्र भर्ती कंपनियों को सर्वोत्तम सुविधाएं और समर्थन सुनिश्चित करता है।`,
    },
    forrecruiters: {
      build: `संबंध बनाएं`,
      invitaion: `आमंत्रण`,
      reach: `हमसे संपर्क करें`,
    },
    guidelines: {
      protocol: `स्थाननीयता प्रोटोकॉल`,
      tnpguidelines: `टी एंड पी सेल मार्गदर्शिका`,
      internguidlines: `यूजी इंटर्नशिप / औद्योगिक मार्गदर्शिका`,
    },
  },
};

export default text;
