import type { Translations } from './translations';

const text: Translations = {
  Main: {
    director: {
      alt: 'डा. बी. वी. रमणा रेड्डी',
      title: 'निर्देशक का कोना',
      name: 'डा. बी. वी. रमणा रेड्डी',
      quote: [
        `भारत, साधकों की भूमि, ११०० वर्षों की पराधीनता, युद्ध, विलय और अपमान के बाद फिर से विश्व गुरु बन्ने
      के शिखर पर है। हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण ७५ वर्षों से यह फिर से एक स्वतंत्र
      देश है और इसने अपनी समृद्ध विविधता, संस्कृतियों, भाषाओं के साथ राष्ट्र के निर्माण की कई चुनौतियों के बीच
      खड़े होने की कला सीख ली है। देश को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता ही हमारा मंत्र है।`,
        'मैं इस संस्था की वेबसाइट पर आने वाले सभी लोगों का हृदय से स्वागत करता हूं।',
      ],
      more: 'और पढ़ें',
    },
  },

  Clubs: { title: 'संघठनें' },
  Committee: {
    building: 'निर्माण एवं कार्य समिति',
    financial: 'वित्तीय समिति',
    governor: 'राज्यपाल मंडल',
    members: {
      title: 'सदस्य',
      serial: 'क्रम संख्या',
      nomination: 'नामांकन',
      name: 'नाम',
      servingAs: 'के रूप में सेवारत',
    },
    meetings: {
      title: 'बैठकें',
      serial: 'बैठक संख्या',
      date: 'दिनांक',
      place: 'स्थान',
      agenda: 'कार्यसूची',
      minutes: 'विवरण',
    },
  },
  Curricula: {
    pageTitle: 'पाठ्यक्रम',
    code: 'कोड',
    title: 'शीर्षक',
    major: 'क्रमादेश',
    credits: 'एल-टी-पी',
    totalCredits: 'क्रेडिट्स',
    syllabus: 'पाठ्यक्रम',
  },
  Departments: { title: 'विभाग' },
  Department: {
    headings: {
      about: 'परिचय',
      vision: 'दृष्टि',
      and: 'और',
      mission: 'उद्देश्य',
      hod: {
        title: 'विभागाध्यक्ष का संदेश',
        session: (from: string) => `शैक्षणिक सत्र ${from} - वर्तमान`,
      },
      programmes: {
        title: 'कार्यक्रम',
        undergrad: 'पूर्वस्नातक',
        postgrad: 'स्नातकोत्तर',
        doctorate: 'डॉक्टरेट',
      },
      gallery: 'चित्र',
    },
    facultyAndStaff: 'संकाय और कर्मचारी',
    laboratories: 'प्रयोगशालाएँ',
    achievements: 'छात्र उपलब्धियाँ',
  },
  FacultyAndStaff: {
    placeholder: 'नाम या ईमेल से खोजें',
    departmentHead: 'विभागाध्यक्ष',
  },
  FAQ: { title: 'अक्सर पूछे जाने वाले प्रश्न' },
  Footer: {
    logo: 'प्रतीक चिन्ह',
    nit: 'राष्ट्रीय प्रौद्योगिकी संस्थान, कुरूक्षेत्र',
    location: 'थानेसर, हरियाणा, भारत १३६११९',
    design: 'कलाकृति',
    headings: ['त्वरित संदर्भ', 'त्वरित संदर्भ', 'त्वरित संदर्भ'],
    lorem: 'लोरेम इप्सम',
    copyright:
      '© २०२४ राष्ट्रीय प्रौद्योगिकी संस्थान कुरूक्षेत्र। सर्वाधिकार आरक्षित।',
  },
  Forms: { title: 'फॉर्म्स' },
  Header: {
    institute: 'संस्थान',
    academics: 'शैक्षिक',
    faculty: 'संकाय और कर्मचारी',
    placement: 'प्रशिक्षण एवं नियुक्ति',
    activities: 'छात्र गतिविधियाँ',
    alumni: 'भूतपूर्व छात्र',
    logo: 'प्रतीक चिन्ह',
    search: 'त्वरित खोज...',
    login: 'प्रवेश',
    profile: { alt: 'मेरी छवि', view: 'विवरण देखें' },
  },
  Login: {
    title: 'प्रवेश करें',
    enterEmail: 'अपना ईमेल दर्ज करें',
    continueButton: 'अगले चरण पर बढ़ें (तैयार नहीं)',
    signInWithGoogle: 'गूगल द्वारा प्रवेश करें',
  },
  Notifications: {
    title: 'सूचनाएँ',
    categories: {
      academic: 'शैक्षणिक',
      tender: 'निविदाएँ',
      workshop: 'कार्यशालाएं',
      recruitment: 'नियुक्ति',
    },
    viewAll: 'सारा देखें',
  },
  NotFound: {
    title: 'नहीं मिला',
    description: 'अनुरोधित संसाधन नहीं मिल सका',
    backHome: 'घर लौटें',
  },
  Profile: {
    tabs: {
      personal: {
        title: 'व्यक्तिगत विवरण',
        basic: {
          title: 'मूलभूत',
          name: 'नाम',
          rollNumber: 'रोल संख्या',
          sex: 'लिंग',
          dateOfBirth: 'जन्मदिन',
        },
        contact: {
          title: 'संपर्क',
          email: 'संस्थान ईमेल',
          personalEmail: 'व्यक्तिगत ईमेल',
          telephone: 'टेलीफ़ोन',
          alternateTelephone: 'वैकल्पिक टेलीफ़ोन',
        },
        institute: {
          title: 'संस्था',
          degree: 'उपाधि',
          major: 'क्रमादेश',
          currentSemester: 'मौजूदा छमाही',
          section: 'अनुभाग',
        },
        admission: {
          title: 'प्रवेश',
          applicationNumber: 'प्रवेश संख्या',
          candidateCategory: 'उम्मीदवार श्रेणी',
          admissionCategory: 'प्रवेश श्रेणी',
          admissionSubcategory: 'प्रवेश उपश्रेणी',
          dateOfAdmission: 'प्रवेश की तिथि',
        },
        guardians: {
          title: 'अभिभावक',
          father: 'पिता',
          mother: 'माता',
          local: 'स्थानीय संरक्षक',
          name: 'नाम',
          telephone: 'टेलीफ़ोन',
          email: 'ईमेल',
        },
        address: {
          title: 'पता',
          permanent: 'स्थायी पता',
          pinCode: 'पिन कोड',
        },
      },
      notifications: { title: 'सूचनाएँ' },
      courses: { title: 'पाठ्यक्रम' },
      clubs: { title: 'संघठन' },
      results: { title: 'परिणाम और विस्तृत अंक प्रमाण पत्र' },
      bookmarks: { title: 'बुकमार्क्स' },
      quickSend: { title: 'त्वरित प्रेषण' },
    },
    logout: 'प्रस्थान करें',
  },
  Search: {
    placeholder: 'त्वरित खोज...',
    categories: {
      allResults: 'सभी परिणाम',
      webPages: 'वेब पृष्ठ',
      people: 'लोग',
      documents: 'दस्तावेज़',
      events: 'आयोजन',
      news: 'समाचार',
      courses: 'पाठ्यक्रम',
      clubs: 'क्लब',
      positions: 'पद',
    },
    viewAll: 'सारा देखें',
    default: {
      recents: 'ताज़ा खोजें',
      clearRecents: 'हाल की खोजें साफ़ करें',
      mostSearched: 'एनआईटी की सर्वाधिक खोजें',
      studentLinks: {
        title: 'छात्र संबंधित त्वरित लिंक',
        clubs: 'संघठनें',
        courses: 'पाठ्यक्रम',
        departments: 'विभाग',
        notifications: 'सूचनाएँ',
        results: 'परिणाम',
      },
      facultyLinks: {
        title: 'संकाय संबंधित त्वरित लिंक',
        notifications: 'सूचनाएँ',
        profile: 'मेरा विवरण',
      },
    },
  },
  Section: {
    about: 'परिचय',
    gallery: 'चित्र',

    Account: {},
    CentralLibrary: {},
    CentralWorkshop: {},
    CentreOfComputingAndNetworking: {},
    ElectricalMaintenance: {},
    Estate: {},
    GeneralAdministration: {},
    HealthCentre: {},
    Security: {
      name: 'सुरक्षा',
      about1:
        'सुरक्षा विभाग प्रत्यायोजन उपकरण और संस्थान में सुरक्षा के उपायों का सख्ती से पालन करने के लिए प्रभावी सुरक्षा कवर प्रदान करने के लिए जिम्मेदार है।',
      about2:
        'NIT, कुरुक्षेत्र सुरक्षा विभाग सुरक्षा, अपराध जागरूकता और वृहत अपराधी बनने की संभावनाओं को कम करने के लिए सुरक्षा, अपराध जागरूकता और निवारक उपायों पर उपयोगी जानकारी प्रदान करता है।',
      about3:
        'NIT, कुरुक्षेत्र सुरक्षा, अजीत सिंह यादव, सुरक्षा अधिकारी, 01 सुरक्षा गार्ड NIT, कुरुक्षेत्र के स्थायी कर्मचारी और 04 सुरक्षा पर्यवेक्षक, 11 हथियार वाले सुरक्षा गार्ड, 123 सुरक्षा गार्ड और 01 सीसीटीवी नियंत्रण कक्ष ऑपरेटर आउटसोर्सिंग आधार पर हायरिंग फ्रोम डायमंड सुरक्षा पर्सनल।',
      about4:
        'कैंपस सुरक्षा स्टाफ के सदस्य हाईली ट्रेन्ड पेशेवर और बल की पृष्ठभूमि वाले हैं। वे कैंपस पर अनुशासन जो दिन प्रतिदिन की कार्यक्षमता, सांस्कृतिक विविधता, यौन उत्पीड़न, रैगिंग विरोधी, विभिन्न घटनाओं और दुर्घटनाओं के साथ निपटने की प्रक्रियाएँ, पहला उपचार, आग निवारण, अग्नि युद्ध, घटनाओं की सुरक्षा, समुदाय पुलिस, और अपराध निवारण।',
      about5:
        'सुरक्षा कर्मियों को जिप्सी और बाइसिकल जैसे समर्पित वाहन प्रदान किए जाते हैं ताकि कैंपस के ऊपर और बाहर पैट्रोलिंग कर सकें। कर्मचारी परिधि, गेट्स, स्थिर पोस्ट्स, और कैंपस की पैट्रोलिंग का ध्यान रखती है।',
      about6:
        'मोबाइल सुरक्षा नियंत्रण कक्ष, जो एक सेवा के लिए कॉल के प्रतिक्रिया समय को कम करने और कैंपस सुरक्षा कर्मियों की प्रभावीता बढ़ाने के लिए 24 घंटे काम करता है, कई प्रौद्योगिकियों का उपयोग करता है। ये प्रौद्योगिकियाँ शामिल हैं:',
      about7:
        'NIT, कुरुक्षेत्र में 67 सीसीटीवी कैमरे स्टूडेंट्स, कर्मचारियों और संस्थान की संपत्ति की सुरक्षा सुनिश्चित करने के लिए स्थापित किए गए हैं।',
      about8:
        'संस्थान के कैंपस को सीमाओं की दीवारों और सीसीटवी कैमरों से घेरा हुआ है। कैंपस के प्रत्येक प्रवेश द्वार पर सुरक्षा गार्ड हैं, जो कैंपस में प्रवेश करने वाली सभी वाहनों की जाँच करते हैं। कैंपस के भीतर, कई सुरक्षा बूथों का कड़ा निगरानी रखा जाता है।',
      about9: 'सुरक्षा नियंत्रण कक्ष संख्या 90346-51015',
      about10: 'वायरलेस संचार',
      about11:
        'कैंपस में सुरक्षा अधिकारियों की दिन-रात की उपलब्धता और निगरानी के लिए नियंत्रण कक्षों में गुणस्तर की उपलब्धता।',
      about12:
        'सुरक्षा विभाग स्थानीय आपात सेवाओं जैसे पुलिस, अग्निशमन और अस्पतालों के साथ क़रीबी संबंध बनाए रखता है।',
      about13:
        'एक समुदाय आधारित दर्शन को अपनाते हुए, सुरक्षा विभाग अपराध को रोकने, पीड़ित (ओं) को सहायता प्रदान करने, और अन्य कैंपस प्राधिकरणों और शहर, राज्य, और केंद्रीय कानून प्रवर्तन एजेंसियों के साथ मिलकर सूचित घटनाओं का जांच करता है। यह अन्य सेवा उन्मुख विभागों के साथ मिलकर काम करता है, जैसे कामस और एनआईटी हेल्थ सेंटर, ताकि छात्र, शिक्षक, और कर्मचारी सत्यापन और सामाजिक अनुभव का आनंद ले सकें। इस उद्देश्य के लिए, सुरक्षा विभाग छात्रों, शिक्षकों, कर्मचारियों और समुदाय के साथ साझेदारी में काम करता है। सुरक्षा विभाग और छात्र, परामर्श सेवाएं, छात्र प्रतिनिधियों और एनआईटी समुदाय के बीच एक निकट कामकाज संबंध है, जिसके माध्यम से, एनआईटी कर्मचारी संघ, अधिकारी संघ और विधायक मंडल।',
      about14:
        'सुरक्षा विभाग प्रत्येक वर्ष NIT, कुरुक्षेत्र में शामिल होने वाले ताज़ा छात्रों को ओरिएंटेशन सत्र के माध्यम से सुरक्षा और सुरक्षा जागरूकता प्रशिक्षण प्रदान करता है।',
      about15:
        'सुरक्षा विभाग के सभी सदस्य आपका स्वागत करते हैं और आपके NIT, कुरुक्षेत्र कैंपस में आपके रहने के दौरान आपको सर्वश्रेष्ठ की शुभकामनाएं देते हैं। हम यहाँ आपकी सुरक्षित और प्रिय संभावना का आनंद लेने के लिए हैं।',
      about16:
        'जब भी आपको अपनी सुरक्षा और सुरक्षा के लिए किसी चिंता हो, हमसे सहायता के लिए हस्तक्षेप करने में संकोच न करें। याद रखें कि अपराध को रोकना एनआईटी सुरक्षा विभाग और उस समुदाय की साझी जिम्मेदारी है जिसे यह सेवा प्रदान करता है।',
      about17: 'अजीत सिंह यादव',
      about18: ' सुरक्षा अधिकारी, सुरक्षा विभाग',
      about19: 'राष्ट्रीय प्रौद्योगिकी संस्थान, कुरुक्षेत्र',
      about20: 'कुरुक्षेत्र, हरियाणा – 136119, भारत',
      about21: 'टेल: +91-01744-233296 (ओ)',
      about22: 'मोब: 89506-50020',
      about23: 'ईमेल आईडी: securenitkkr@gmail.com',
    },
    Sports: {},
    Store: {},
  },
  StudentActivities: {
    title: 'छात्र गतिविधियाँ',
    headings: {
      clubs: 'संघठनें',
      council: 'छात्र परिषद',
      events: 'आयोजनाएँ',
      thoughtLab: 'विचार प्रयोगशाला',
      nss: 'एनएसएस',
      ncc: 'एनसीसी',
    },
    sections: { clubs: { title: 'संघठनें', more: 'सभी संघठनो को तलाशें' } },
  },
  Unauthorised: {
    title: 'अनधिकृत',
    description: 'आप इस पृष्ठ को देखने के लिए अधिकृत नहीं हैं।',
  },
  WorkInProgress: {
    title: 'कार्य प्रगति पर है',
    description: 'इस पेज पर अभी काम चल रहा है. कृपया दूसरी बार आएं',
  },
};

export default text;
