import type { Translations } from './translations';

const text: Translations = {
  Main: {
    director: {
      alt: 'डा. बी. वी. रमणा रेड्डी',
      title: 'निर्देशक का कोना',
      name: 'डा. बी. वी. रमणा रेड्डी',
      quote: [
        `भारत, साधकों की भूमि, ११०० वर्षों की पराधीनता, युद्ध, विलय और अपमान के बाद फिर से विश्व गुरु बन्ने
      के शिखर पर है। हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण ७५ वर्षों से यह फिर से एक स्वतंत्र
      देश है और इसने अपनी समृद्ध विविधता, संस्कृतियों, भाषाओं के साथ राष्ट्र के निर्माण की कई चुनौतियों के बीच
      खड़े होने की कला सीख ली है। देश को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता ही हमारा मंत्र है।`,
        'मैं इस संस्था की वेबसाइट पर आने वाले सभी लोगों का हृदय से स्वागत करता हूं।',
      ],
      more: 'और पढ़ें',
    },
  },

  Clubs: { title: 'संघठनें' },
  Committee: {
    building: 'निर्माण एवं कार्य समिति',
    financial: 'वित्तीय समिति',
    governor: 'राज्यपाल मंडल',
    members: {
      title: 'सदस्य',
      serial: 'क्रम संख्या',
      nomination: 'नामांकन',
      name: 'नाम',
      servingAs: 'के रूप में सेवारत',
    },
    meetings: {
      title: 'बैठकें',
      serial: 'बैठक संख्या',
      date: 'दिनांक',
      place: 'स्थान',
      agenda: 'कार्यसूची',
      minutes: 'विवरण',
    },
  },
  Curricula: {
    pageTitle: 'पाठ्यक्रम',
    code: 'कोड',
    title: 'शीर्षक',
    major: 'क्रमादेश',
    credits: 'एल-टी-पी',
    totalCredits: 'क्रेडिट्स',
    syllabus: 'पाठ्यक्रम',
  },
  Departments: { title: 'विभाग' },
  Department: {
    headings: {
      about: 'परिचय',
      vision: 'दृष्टि',
      and: 'और',
      mission: 'उद्देश्य',
      hod: {
        title: 'विभागाध्यक्ष का संदेश',
        session: (from: string) => `शैक्षणिक सत्र ${from} - वर्तमान`,
      },
      programmes: {
        title: 'कार्यक्रम',
        undergrad: 'पूर्वस्नातक',
        postgrad: 'स्नातकोत्तर',
        doctorate: 'डॉक्टरेट',
      },
      gallery: 'चित्र',
    },
    facultyAndStaff: 'संकाय और कर्मचारी',
    laboratories: 'प्रयोगशालाएँ',
    achievements: 'छात्र उपलब्धियाँ',
  },
  FacultyAndStaff: {
    placeholder: 'नाम या ईमेल से खोजें',
    departmentHead: 'विभागाध्यक्ष',
  },
  FAQ: { title: 'अक्सर पूछे जाने वाले प्रश्न' },
  Footer: {
    logo: 'प्रतीक चिन्ह',
    nit: 'राष्ट्रीय प्रौद्योगिकी संस्थान, कुरूक्षेत्र',
    location: 'थानेसर, हरियाणा, भारत १३६११९',
    design: 'कलाकृति',
    headings: ['त्वरित संदर्भ', 'त्वरित संदर्भ', 'त्वरित संदर्भ'],
    lorem: 'लोरेम इप्सम',
    copyright:
      '© २०२४ राष्ट्रीय प्रौद्योगिकी संस्थान कुरूक्षेत्र। सर्वाधिकार आरक्षित।',
  },
  Forms: { title: 'फॉर्म्स' },
  Header: {
    institute: 'संस्थान',
    academics: 'शैक्षिक',
    faculty: 'संकाय और कर्मचारी',
    placement: 'प्रशिक्षण एवं नियुक्ति',
    activities: 'छात्र गतिविधियाँ',
    alumni: 'भूतपूर्व छात्र',
    logo: 'प्रतीक चिन्ह',
    search: 'त्वरित खोज...',
    login: 'प्रवेश',
    profile: { alt: 'मेरी छवि', view: 'विवरण देखें' },
  },
  Login: {
    title: 'प्रवेश करें',
    enterEmail: 'अपना ईमेल दर्ज करें',
    continueButton: 'अगले चरण पर बढ़ें (तैयार नहीं)',
    signInWithGoogle: 'गूगल द्वारा प्रवेश करें',
  },
  Notifications: {
    title: 'सूचनाएँ',
    categories: {
      academic: 'शैक्षणिक',
      tender: 'निविदाएँ',
      workshop: 'कार्यशालाएं',
      recruitment: 'नियुक्ति',
    },
    viewAll: 'सारा देखें',
  },
  NotFound: {
    title: 'नहीं मिला',
    description: 'अनुरोधित संसाधन नहीं मिल सका',
    backHome: 'घर लौटें',
  },
  Profile: {
    tabs: {
      personal: {
        title: 'व्यक्तिगत विवरण',
        basic: {
          title: 'मूलभूत',
          name: 'नाम',
          rollNumber: 'रोल संख्या',
          sex: 'लिंग',
          dateOfBirth: 'जन्मदिन',
        },
        contact: {
          title: 'संपर्क',
          email: 'संस्थान ईमेल',
          personalEmail: 'व्यक्तिगत ईमेल',
          telephone: 'टेलीफ़ोन',
          alternateTelephone: 'वैकल्पिक टेलीफ़ोन',
        },
        institute: {
          title: 'संस्था',
          degree: 'उपाधि',
          major: 'क्रमादेश',
          currentSemester: 'मौजूदा छमाही',
          section: 'अनुभाग',
        },
        admission: {
          title: 'प्रवेश',
          applicationNumber: 'प्रवेश संख्या',
          candidateCategory: 'उम्मीदवार श्रेणी',
          admissionCategory: 'प्रवेश श्रेणी',
          admissionSubcategory: 'प्रवेश उपश्रेणी',
          dateOfAdmission: 'प्रवेश की तिथि',
        },
        guardians: {
          title: 'अभिभावक',
          father: 'पिता',
          mother: 'माता',
          local: 'स्थानीय संरक्षक',
          name: 'नाम',
          telephone: 'टेलीफ़ोन',
          email: 'ईमेल',
        },
        address: {
          title: 'पता',
          permanent: 'स्थायी पता',
          pinCode: 'पिन कोड',
        },
      },
      notifications: { title: 'सूचनाएँ' },
      courses: { title: 'पाठ्यक्रम' },
      clubs: { title: 'संघठन' },
      results: { title: 'परिणाम और विस्तृत अंक प्रमाण पत्र' },
      bookmarks: { title: 'बुकमार्क्स' },
      quickSend: { title: 'त्वरित प्रेषण' },
    },
    logout: 'प्रस्थान करें',
  },
  Search: {
    placeholder: 'त्वरित खोज...',
    categories: {
      all: 'सभी परिणाम',
      clubs: 'क्लब',
      committees: 'समितियां',
      courses: 'पाठ्यक्रम',
      departments: 'विभाग',
      faculty: 'लोग',
      sections: 'खंड',
      staff: 'कर्मचारी',
    },
    viewAll: 'सारा देखें',
    default: {
      recents: 'ताज़ा खोजें',
      clearRecents: 'हाल की खोजें साफ़ करें',
      mostSearched: 'एनआईटी की सर्वाधिक खोजें',
      studentLinks: {
        title: 'छात्र संबंधित त्वरित लिंक',
        clubs: 'संघठनें',
        courses: 'पाठ्यक्रम',
        departments: 'विभाग',
        notifications: 'सूचनाएँ',
        results: 'परिणाम',
      },
      facultyLinks: {
        title: 'संकाय संबंधित त्वरित लिंक',
        notifications: 'सूचनाएँ',
        profile: 'मेरा विवरण',
      },
    },
  },
  Section: {
    about: 'परिचय',
    gallery: 'चित्र',

    Account: {},
    CentralLibrary: {},
    CentralWorkshop: {},
    CentreOfComputingAndNetworking: {},
    ElectricalMaintenance: {},
    Estate: {
      name: `संपदा`,
      links: {
        h14: 'आवास आवंटन नियम 2014',
        h17: 'आवास आवंटन नियम 2017',
        rate: 'दर सूची',
        complaint: 'ऑनलाइन शिकायत',
      },
      headings: {
        about: `के बारे में`,
        bwc: 'भवन और कार्य समिति',
        ces: 'संपदा अनुभाग की समितियाँ',
        details: 'परिसर और उपलब्ध अवसंरचना का विवरण',
        projects: 'परियोजनाएँ',
        orgchart: 'संपदा अनुभाग का संगठन चार्ट',
        allotment: 'हाउस आवंटन नियम 2014 और 2017',
        rate: 'दर सूची',
        seniority: 'वरिष्ठता सूची',
        subheadings: {
          eac: 'भूमि प्रबंधन समिति (EAC)',
          sac: 'अंतरिक्ष आवंटन समिति (SAC)',
          prc: 'प्रगति समीक्षा समिति (PRC)',
          lc: 'लाइसेंसिंग समिति (LC)',
          hact: 'गृह आवंटन समिति (HAC) – शिक्षण स्थल',
          hacnt: 'गृह आवंटन समिति (HAC) – गैर-शिक्षण स्थल कर्मचारी',
          geninfra: 'सामान्य बुनियादी संरचना के विवरण',
          acad: 'शैक्षिक क्षेत्र',
          hostel: 'हॉस्टल क्षेत्र',
          hostelb: 'लड़कों के हॉस्टल (UG + PG)',
          hostelg: 'लड़कियों के हॉस्टल',
          res: 'निवासीय क्षेत्र',
          support: 'सहायक सुविधाएँ',
          comp: 'पिछले तीन वर्षों में पूर्ण हुए परियोजनाएं',
          ongoing: 'चल रही परियोजनाएँ',
          future: 'भविष्य की परियोजनाएँ',
        },
      },
      about: {
        line1: `एस्टेट धारा नए भवनों और अन्य बुनियादी सुविधाओं के सिविल & रखरखाव के निर्माण में शामिल किया जाता है ; बिजली के काम करता है , बागवानी & बागवानी के काम करता है , साफ-सफाई & साफ-सफाई काम करता है और कुशल, semiskilled , अकुशल विभिन्न वर्गों / संस्थान के विभागों में आवश्यक श्रमिकों की आउटसोर्सिंग । और यह भी कि घरों , फर्नीचर और भूमि, दुकानों & के पट्टे के आवंटन के बारे में रिकॉर्ड बनाए रखने ; कैंटीन और माल के सभी प्रकार बनाए रखें। प्रो आई / सी ( स्वच्छता & साफ-सफाई ), प्रो आई / सी ( विद्युत रखरखाव) और प्रो ; खंड डीन ( एस्टेट ), जो प्रो आई / सी ( निर्माण एस्टेट और एएमपी) द्वारा सहायता प्रदान की है के नेतृत्व में है आई / सी (बागवानी & बागवानी )।`,
        line2: `कार्यालय का काम है जो वरिष्ठ लेखाकार , सहायक एसजी मैं & द्वारा सहायता प्रदान की है अधीक्षक एसजी – द्वितीय की देखरेख के द्वारा किया जाता है; परिचर। तकनीकी काम सहायक अभियंता ( सिविल) & के नेतृत्व में है ; सहायक अभियंता ( इलेक्ट्रोनिक ।)। सहायक अभियंता ( सिविल) सह एस्टेट ऑफिसर दो जूनियर इंजीनियर (सिविल) & द्वारा समर्थित है; एक जूनियर इंजीनियर (मैकेनिकल) और सहायक अभियंता ( इलेक्ट्रोनिक ।) एक जूनियर इंजीनियर के द्वारा समर्थित है ( इलेक्ट्रोनिक ।)।   विभिन्न रखरखाव कार्यों के लिए बजट आवश्यकताओं गैर योजना अनुदान के माध्यम से मिले हैं। नए कार्यों के बजटीय आवश्यकता इस वर्ष की योजना के अनुदान से मुलाकात की है। एस्टेट धारा के अगले 25 साल के लिए रोड मैप संस्थान के भविष्य के विस्तार को देखते हुए केन्द्रीय लोक निर्माण विभाग द्वारा तैयार की जा रही है।`,
      },
      project: {
        completed: {
          line1:
            '1. 96 बियरर्स को आसक्ति करने के लिए 2 ब्लॉकों से मिलकर बने 3 मंजिले बियरर बैरेक का निर्माण।',
          line2: '2. दो संस्थान मुख्य गेट्स की प्रावधानी।',
          line3:
            '3. लगभग 800 मीटर लंबी क्षेत्र में सीमा दीवार (बचे हुए टुकड़ों में) और गेट (UHBVN कार्यालय के पास) का निर्माण।',
          line4:
            '4. हॉस्टल नंबर 1 से 9 तक के लड़कों के हॉस्टल, गर्ल्स हॉस्टल नंबर 1 और 2 में सोलर वॉटर हीटिंग प्रणाली में ठंडे पानी टैंक आपूर्ति पाइप लाइन का स्थापना।',
          line5:
            '5. निवास, हॉस्टल और शैक्षिक भवन में सी.आई./ए.सी. जल आपूर्ति लाइनों की केंट्रीफ़्यूगली कास्ट (स्पन) आयरन पाइप्स क्लास एल.ए. में बदलाव।',
          line6:
            '6. निवासीय कैम्पस और संस्थागत क्षेत्र में मौजूदा सड़कों के पुनर्नवीकरण और विस्तार की प्रावधान।',
          line7: '7. स्विमिंग पूल का निर्माण।',
          line8:
            '8. 600 सीटर गर्ल्स हॉस्टल का निर्माण (मल्टी-स्टोरीड फ्रेम्ड स्ट्रक्चर, ग्राउंड फ्लोर + 5)।',
          line9: '9. सीवेज ट्रीटमेंट प्लांट (एसटीपी) का निर्माण।',
          line10:
            '10. सुरक्षा के उद्देश्य से संस्थान की सीमा पर कॉन्सर्टीना कोइल का प्रदान।',
          line11:
            '11. NIT, कुरुक्षेत्र में संस्थान के विभिन्न स्थानों पर स्थायी / अस्थायी हट्स की प्रावधान।',
          line12:
            '12. स्पोर्ट्स ग्राउंड और विभिन्न अन्य स्थानों पर 16/20 मीटर उच्च मास्ट लाइट्स का प्रदान और स्थापना।',
          line13:
            '13. संस्थान में शिक्षण संबंधी भवनों और संबंधित सुविधाओं के विभिन्न स्थानों पर डीजी पावर बैकअप की प्रावधान।',
          line14: '14. बॉय्ज और गर्ल्स हॉस्टल में डीजी पावर बैकअप की प्रावधान।',
          line15: '15. संस्थान में मौजूदा एलटी पैनल्स की एमसीबी के साथ बदलाव।',
          line16:
            '16. NIT, कुरुक्षेत्र में मेगा बॉय्ज हॉस्टल (1000 क्षमता) में एविएशन लाइट और लाइटनिंग कंडक्टर की प्रावधान।',
          line17:
            '17. गैर-निवासीय क्षेत्र में इलेक्ट्रिकल सब-स्टेशन एचटी/एलटी वितरण का प्रदान और सड़क लाइटिंग और फीडर पिलर आदि की स्थापना।',
        },
        ongoing: {
          line1: '1. NITK के संस्थान मास्टर प्लान की तैयारी।',
          line2:
            '2. विदेशी छात्रों, अनुसंधान विद्यार्थियों और विवाहित पीजी छात्रों के लिए 300 सीटर मल्टीपर्पज़ बॉय्स हॉस्टल का निर्माण (मल्टी-स्टोरीड फ्रेम्ड स्ट्रक्चर, ग्राउंड फ्लोर + 5)।',
          line3:
            '3. NIT, कुरुक्षेत्र में शैक्षिक भवन में मौजूदा इलेक्ट्रिकल वायरिंग की बदलाव।',
          line4:
            '4. आवासीय क्षेत्र में इलेक्ट्रिकल सब-स्टेशन एचटी/एलटी वितरण और फीडर पिलरों का प्रदान और स्थापना।',
          line5:
            'हॉस्टल (मल्टी-स्टोरीड) आरसीसी फ्रेम्ड स्ट्रक्चर (ग्राउंड + 5) में किचन उपकरण प्रदान करना।',
        },
        future: {
          line1:
            '1. संस्थान में विकलांग व्यक्तिओं (PwD) के लिए लिफ्ट्स की प्रावधान।',
          line2:
            '2. बोर्ड रूम, गोल्डन जुबली प्रशासनिक भवन में ऑडियो सिस्टम प्रदान करना, जिसमें जुबली हॉल और सीनेट हॉल शामिल हैं।',
          line3:
            '3. पुराने बॉयज हॉस्टल नंबर 1 से 6 और गर्ल्स हॉस्टल नंबर 1 में सामान्य कक्ष, डाइनिंग हॉल, वार्डन कार्यालय और एमएमसीए कार्यालय में फ्लोर फर्निशिंग टाइल्स से सजावट करना।',
          line4:
            '4. नॉन-टीचिंग स्टाफ क्लब में स्थित एफ-टाइप क्वार्टर्स के लिए वेरंडा का निर्माण प्रावधान।',
          line5: '5. स्पोर्ट्स कॉम्प्लेक्स में इंडोर बैडमिंटन हॉल का निर्माण।',
          line6:
            '6. स्पोर्ट्स कॉम्प्लेक्स सीढ़ियों को आवरण करने के लिए शेड का निर्माण।',
          line7:
            '7. पश्चिम की ओर अंतरिक्ष सीमा दीवार के पास गोल्डन जुबली प्रशासनिक भवन तक पहुँच प्रदान करके सोने की जुबली प्रशासनिक भवन को एक्सेस प्रदान करना।',
          line8:
            '8. NIT मार्केट के पास मौजूदा पार्किंग में केवल चार पहिया वाहनों के लिए शेड का निर्माण प्रावधान।',
          line9:
            '9. NIT, कुरुक्षेत्र के बॉय्ज और गर्ल्स हॉस्टल के डाइनिंग हॉल में एयर कंडीशनिंग प्रदान करना।',
          line10:
            '10. कंप्यूटर एप्लीकेशन विभाग के मौजूदा भवन पर अतिरिक्त मंजिल का निर्माण।',
          line11: '11. लैब्स कॉम्प्लेक्स का निर्माण (जी+5)।',
          line12:
            '12. कंप्यूटर इंजीनियरिंग विभाग के मौजूदा भवन पर अतिरिक्त मंजिल का निर्माण।',
          line13:
            '13. ईसीई विभाग के मौजूदा भवन के 2 नंबर फ्लोर पर अतिरिक्त 3 नंबर लेक्चर हॉल और इलेक्ट्रॉनिक्स एंड कम्युनिकेशन इंजीनियरिंग विभाग के मौजूदा भवन पर अतिरिक्त मंजिल का निर्माण।',
          line14:
            '14. मौजूदा 12 नंबर लेक्चर हॉल कंप्लेक्स पर अतिरिक्त 6 नंबर लेक्चर हॉल का निर्माण।',
          line15: '15. मौजूदा एबी ब्लॉक पर अतिरिक्त मंजिल का निर्माण।',
          line16: '16. परीक्षा हॉल के मौजूदा भवन पर अतिरिक्त मंजिल का निर्माण।',
          line17:
            '17. मौजूदा पुराने एमबीए ब्लॉक (नया वर्कशॉप बिल्डिंग) पर अतिरिक्त मंजिल का निर्माण।',
          line18:
            '18. पुराने एमबीए ब्लॉक से 12 नंबर लेक्चर हॉल कंप्लेक्स और एमबीए/एमसीए भवन के बीच निर्माण विस्तारित कोरिडोर का निर्माण।',
          line19: '19. जिमनेशियम हॉल का निर्माण।',
          line20: '20. समुदाय केंद्र/सम्मेलन/SAC का निर्माण।',
          line21:
            '21. सुरक्षा और रखरखाव के उद्देश्य से संस्थान की बाह्य सीमा दीवार के साथ पेरिफरल रोड प्रदान करना',
          line22:
            '22. शिक्षक/अधिकारी के लिए मल्टी-स्टोरीड बिल्डिंग का निर्माण, जिसमें 40 अपार्टमेंट्स होंगे',
          line23:
            '23. गैर-शिक्षण स्टाफ के लिए मल्टी-स्टोरीड 20 नंबर टाइप-II और 20 नंबर टाइप-III क्वार्टर्स का निर्माण',
          line24:
            '24. NIT, कुरुक्षेत्र में 33/11KV सब-स्टेशन का निर्माण, स्थापना और कमीशनिंग',
          line25:
            '25. सभी पुराने बॉयज, गर्ल्स हॉस्टल और आवासीय क्षेत्र में रिवायरिंग की जगह पर नई तार की बदलाव',
          line26: '26. कला केंद्र का निर्माण',
          line27:
            '27. अतिरिक्त लेक्चर हॉल कॉम्प्लेक्स का निर्माण (18 नंबर लेक्चर हॉल)',
        },
      },
      seniority: {
        line1:
          '09.04.2024 आवास के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3353/161 दिनांक 12.03.2024 के खिलाफ',
        line2:
          '23.01.2024 वरिष्ठता सूची (एनटी) नोटिफिकेशन दिनांक 02.01.2024 के खिलाफ आवेदनकर्ताओं की',
        line3:
          '18.12.2023 आवेदनकर्ताओं (टी) की वरिष्ठता सूची नोटिफिकेशन दिनांक 02.11.2023 के खिलाफ',
        line4:
          '12-09-2023 वरिष्ठता सूची (एनटी) नोटिफिकेशन संख्या EO/3353/552 दिनांक 28.07.2023 के खिलाफ आवेदनकर्ताओं की',
        line5:
          '18-07-2023 आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/547 दिनांक 24.07.2023 के खिलाफ',
        line6:
          '17-05-2023 आवेदनकर्ताओं (टी) की वरिष्ठता सूची नोटिफिकेशन दिनांक 18.04.2023 के खिलाफ',
        line7:
          '16-02-2023 आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/51 दिनांक 18.01.2023 के खिलाफ',
        line8:
          '13-12-2022 आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/690 दिनांक 03.11.2022 के खिलाफ',
        line9:
          '16-08-2022 आवेदनकर्ताओं (टी) की वरिष्ठता सूची आवासों के लिए नोटिफिकेशन दिनांक 23.06.2022 16082022 के खिलाफ',
        line10:
          '15-06-2022 आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO3353299 दिनांक 17.05.2022 के खिलाफ',
        line11: '05-04-2022 आवेदनकर्ताओं (टी) की वरिष्ठता सूची अप्रैल 2022',
        line12: '10-03-2022 आवेदनकर्ताओं की वरिष्ठता सूची (एफ)',
        line13: '05-08-2021 आवेदनकर्ताओं (टी) की वरिष्ठता सूची',
        line14: '05-08-2021 आवेदनकर्ताओं (एनटी) की वरिष्ठता सूची',
        line15:
          '05-01-2020 वरिष्ठता सूची आवेदनकर्ताओं (एनटी) एफ-प्रकार के आवासों के आवंटन के लिए',
        line16: '03-11-2020 आवेदनकर्ताओं की वरिष्ठता सूची शिक्षण',
        line17: '06-08-2020 शिक्षण आवेदनकर्ताओं की वरिष्ठता सूची अगस्त 2020',
        line18:
          '18-02-2020 वरिष्ठता सूची आवेदनकर्ताओं (एनटी) जिनके खिलाफ 23.01.2020 को नोटिफाई किया गया था',
        line19: 'शिक्षण के लिए आवेदनकर्ताओं की वरिष्ठता सूची',
        line20:
          'एफ-प्रकार के आवासों के लिए आवेदनकर्ताओं (एनटी) की वरिष्ठता सूची',
        line21: 'शिक्षण आवेदनकर्ताओं की वरिष्ठता सूची 03-10-2019',
        line22: 'एनटी आवेदनकर्ताओं की वरिष्ठता सूची 19-09-2019',
        line23:
          'आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/298 दिनांक 16/5/2019 के खिलाफ',
        line24: 'ई-एफ-प्रकार के आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची',
        line25:
          'नोटिफाइड ई-प्रकार के आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची',
        line26: 'आवेदनकर्ताओं की वरिष्ठता सूची (एनटी)',
        line27:
          'आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/468 दिनांक 24.07.2018 के खिलाफ',
        line28:
          'आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/246 दिनांक 16.04.2018 के खिलाफ',
        line29:
          'आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3353/735 और 736 दिनांक 23.11.2017 के खिलाफ',
        line30: 'अप्रशिक्षित आवेदनकर्ताओं की वरिष्ठता सूची',
        line31: 'आवेदनकर्ताओं की वरिष्ठता सूची',
      },
    },
    GeneralAdministration: {},
    HealthCentre: {},
    Security: {},
    Sports: {},
    Store: {},
  },
  Status: {
    NoResult: {
      title: 'कोई परिणाम नहीं मिला',
      description: 'आपके दिए गए प्रश्न से कोई परिणाम मेल नहीं खाता।',
    },
    Unauthorised: {
      title: 'अनधिकृत',
      description: 'आप इस पृष्ठ को देखने के लिए अधिकृत नहीं हैं।',
    },
    WorkInProgress: {
      title: 'कार्य प्रगति पर है',
      description: 'इस पेज पर अभी काम चल रहा है। कृपया दूसरी बार आएं',
    },
  },
  StudentActivities: {
    title: 'छात्र गतिविधियाँ',
    headings: {
      clubs: 'संघठनें',
      council: 'छात्र परिषद',
      events: 'आयोजनाएँ',
      thoughtLab: 'विचार प्रयोगशाला',
      nss: 'एनएसएस',
      ncc: 'एनसीसी',
    },
    sections: { clubs: { title: 'संघठनें', more: 'सभी संघठनो को तलाशें' } },
  },
};

export default text;
