import type { Translations } from './translations';

const text: Translations = {
  Main: {
    director: {
      alt: 'डा. बी. वी. रमणा रेड्डी',
      title: 'निर्देशक का कोना',
      name: 'डा. बी. वी. रमणा रेड्डी',
      quote: [
        `भारत, साधकों की भूमि, ११०० वर्षों की पराधीनता, युद्ध, विलय और अपमान के बाद फिर से विश्व गुरु बन्ने
      के शिखर पर है। हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण ७५ वर्षों से यह फिर से एक स्वतंत्र
      देश है और इसने अपनी समृद्ध विविधता, संस्कृतियों, भाषाओं के साथ राष्ट्र के निर्माण की कई चुनौतियों के बीच
      खड़े होने की कला सीख ली है। देश को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता ही हमारा मंत्र है।`,
        'मैं इस संस्था की वेबसाइट पर आने वाले सभी लोगों का हृदय से स्वागत करता हूं।',
      ],
      more: 'और पढ़ें',
    },
  },

  Clubs: { title: 'संघठनें' },
  Committee: {
    building: 'निर्माण एवं कार्य समिति',
    financial: 'वित्तीय समिति',
    governor: 'राज्यपाल मंडल',
    members: {
      title: 'सदस्य',
      serial: 'क्रम संख्या',
      nomination: 'नामांकन',
      name: 'नाम',
      servingAs: 'के रूप में सेवारत',
    },
    meetings: {
      title: 'बैठकें',
      serial: 'बैठक संख्या',
      date: 'दिनांक',
      place: 'स्थान',
      agenda: 'कार्यसूची',
      minutes: 'विवरण',
    },
  },
  Curricula: {
    pageTitle: 'पाठ्यक्रम',
    code: 'कोड',
    title: 'शीर्षक',
    major: 'क्रमादेश',
    credits: 'एल-टी-पी',
    totalCredits: 'क्रेडिट्स',
    syllabus: 'पाठ्यक्रम',
  },
  Departments: { title: 'विभाग' },
  Department: {
    headings: {
      about: 'परिचय',
      vision: 'दृष्टि',
      and: 'और',
      mission: 'उद्देश्य',
      hod: {
        title: 'विभागाध्यक्ष का संदेश',
        session: (from: string) => `शैक्षणिक सत्र ${from} - वर्तमान`,
      },
      programmes: {
        title: 'कार्यक्रम',
        undergrad: 'पूर्वस्नातक',
        postgrad: 'स्नातकोत्तर',
        doctorate: 'डॉक्टरेट',
      },
      gallery: 'चित्र',
    },
    facultyAndStaff: 'संकाय और कर्मचारी',
    laboratories: 'प्रयोगशालाएँ',
    achievements: 'छात्र उपलब्धियाँ',
  },
  FacultyAndStaff: {
    placeholder: 'नाम या ईमेल से खोजें',
    departmentHead: 'विभागाध्यक्ष',
  },
  FAQ: { title: 'अक्सर पूछे जाने वाले प्रश्न' },
  Footer: {
    logo: 'प्रतीक चिन्ह',
    nit: 'राष्ट्रीय प्रौद्योगिकी संस्थान, कुरूक्षेत्र',
    location: 'थानेसर, हरियाणा, भारत १३६११९',
    design: 'कलाकृति',
    headings: ['त्वरित संदर्भ', 'त्वरित संदर्भ', 'त्वरित संदर्भ'],
    lorem: 'लोरेम इप्सम',
    copyright:
      '© २०२४ राष्ट्रीय प्रौद्योगिकी संस्थान कुरूक्षेत्र। सर्वाधिकार आरक्षित।',
  },
  Forms: { title: 'फॉर्म्स' },
  Header: {
    institute: 'संस्थान',
    academics: 'शैक्षिक',
    faculty: 'संकाय और कर्मचारी',
    placement: 'प्रशिक्षण एवं नियुक्ति',
    activities: 'छात्र गतिविधियाँ',
    alumni: 'भूतपूर्व छात्र',
    logo: 'प्रतीक चिन्ह',
    search: 'त्वरित खोज...',
    login: 'प्रवेश',
    profile: { alt: 'मेरी छवि', view: 'विवरण देखें' },
  },
  Institute: {
    welcome: 'एनआईटी कुरुक्षेत्र में आपका स्वागत है',
    profile: {
      title: 'संस्थान प्रोफाइल',
      vision: {
        title: 'संस्थान का दृष्टिकोण',
        content: [
          'वैश्विक चुनौतियों के प्रति उत्तरदायी तकनीकी शिक्षा और अनुसंधान में एक आदर्श बनना।',
        ],
      },
      mission: {
        title: 'संस्थान का मिशन',
        content: [
          'गुणवत्तापूर्ण तकनीकी शिक्षा प्रदान करना जो नवोन्मेषी पेशेवरों और उद्यमियों का विकास करे।',
          'ऐसा अनुसंधान करना जो सामाजिक-आर्थिक आवश्यकताओं पर ध्यान केंद्रित करते हुए अत्याधुनिक तकनीकों और भविष्यवादी ज्ञान का सृजन करे।',
        ],
      },
      history: {
        title: 'ऐतिहासिक छाप',
        content: [
          'केंद्रीय सरकार ने योजना आयोग के परामर्श से तीसरी पंचवर्षीय योजना के तहत क्षेत्रीय इंजीनियरिंग कॉलेजों की स्थापना की योजना को मंजूरी दी थी ताकि योजना अवधि के दौरान देश में तकनीकी शिक्षा के लिए सुविधाओं का विस्तार किया जा सके। "क्षेत्रीय इंजीनियरिंग कॉलेज, कुरुक्षेत्र" देश के सत्रह कॉलेजों में से एक था। सरकार के पत्र संख्या 16-4/60-T.5, दिनांक 26 फरवरी, 1962 के माध्यम से, यह संस्थान 1963 में भारत सरकार और हरियाणा राज्य सरकार का एक संयुक्त और सहकारी उपक्रम के रूप में स्थापित किया गया था ताकि हरियाणा राज्य और देश के बाकी हिस्सों के युवाओं को तकनीकी प्रशिक्षण प्रदान किया जा सके और राष्ट्रीय एकीकरण को बढ़ावा दिया जा सके। इसका उद्देश्य विभिन्न इंजीनियरिंग और प्रौद्योगिकी विषयों में शिक्षा और अनुसंधान सुविधाओं को प्रदान करना और प्रत्येक ऐसे विषय में सीखने और ज्ञान के प्रसार को बढ़ावा देना था।',

          'आईआरई कुरुक्षेत्र की पहली प्रवेश 1963 में पंजाब इंजीनियरिंग कॉलेज, चंडीगढ़ और थापर इंस्टीट्यूट ऑफ़ इंजीनियरिंग एंड टेक्नोलॉजी, पटियाला में किया गया था।',
          'आईआरई कुरुक्षेत्र को 25 अप्रैल, 1964 को सोसाइटीज रजिस्ट्रेशन एक्ट 1860 के तहत रजिस्टर किया गया था।',
          'नित कुरुक्षेत्र को 26 जून, 2002 को डीम्ड विश्वविद्यालय के रूप में उन्नत किया गया था।',
          'इस संस्थान ने अपनी पहचान को डीम्ड विश्वविद्यालय के रूप में प्राप्त किया था।',
          'इस संस्थान ने 1985-86 से 4 वर्षीय बीटेक डिग्री पाठ्यक्रमों पर स्विच किया।',
          'संस्थान ने 2006-07 में एक 2 वर्षीय एमबीए पाठ्यक्रम और दो चार वर्षीय बीटेक डिग्री पाठ्यक्रमों को शुरू किया।',
          'संस्थान ने उत्तरीय और अध्ययन के स्तर पर विभिन्न तकनीकी और प्रौद्योगिकी विषयों में निर्देश प्रदान किया है।',
        ],
      },
    },
    admission: {
      title: 'शैक्षिक प्रक्रिया और शिक्षा प्रणाली',
      process: {
        title: 'प्रवेश प्रक्रिया',
        content: [
          'स्नातक पाठ्यक्रमों में – बी.टेक. डिग्री पाठ्यक्रम, प्रवेश अखिल भारतीय इंजीनियरिंग प्रवेश परीक्षा (AIEEE) के आधार पर किया जाता है, जिसे भारत सरकार की ओर से केंद्रीय माध्यमिक शिक्षा बोर्ड (CBSE) द्वारा आयोजित किया जाता है।',
          'हालांकि, एम.टेक. डिग्री पाठ्यक्रमों में प्रवेश उम्मीदवार के GATE परीक्षा में प्राप्त अंकों के आधार पर किया जाता है। पहले सीटें GATE-योग्य उम्मीदवारों को भरने के बाद उद्योग-प्रायोजित उम्मीदवारों को दी जाती हैं। शेष खाली सीटें उन गैर-GATE उम्मीदवारों को दी जाती हैं जिनके योग्यता परीक्षा में कम से कम 60 प्रतिशत अंक (SC उम्मीदवारों के लिए 55 प्रतिशत) हैं। GATE उम्मीदवारों को 5000/- रुपये प्रति माह की छात्रवृत्ति के लिए पात्र होते हैं। गैर-GATE उम्मीदवारों को कोई छात्रवृत्ति नहीं दी जाती है।',
        ],
      },
      education: {
        title: 'शिक्षा प्रणाली',
        content: [
          'संस्थान की शिक्षा प्रणाली को शैक्षणिक सत्रों में विभाजित किया गया है जिसमें दो सेमेस्टर होते हैं – सम और विषम सेमेस्टर। संस्थान बी.टेक और एम.टेक. डिग्री प्रदान करने वाले पाठ्यक्रम और डॉक्टर ऑफ फिलॉसफी की डिग्री प्रदान करने वाले अनुसंधान सुविधाएं प्रदान करता है। निर्देश और परीक्षा की भाषा अंग्रेजी है। संस्थान को 26.6.2002 से एक डीम्ड यूनिवर्सिटी का दर्जा प्राप्त है। संस्थान अब शैक्षणिक कार्यों जैसे परीक्षाओं, उत्तर पुस्तिकाओं के मूल्यांकन, परिणामों की घोषणा और अन्य संबद्ध मामलों से संबंधित हर पहलू में स्वतंत्र है। संस्थान ने पारंपरिक परीक्षा और मूल्यांकन प्रणाली से क्रेडिट आधारित परीक्षा प्रणाली में परिवर्तन कर लिया है।',
          'पाठ्यक्रमों में संस्थान में अध्ययन, कार्य स्थलों का दौरा और संस्थान कार्यशालाओं और अनुमोदित इंजीनियरिंग कार्यों में व्यावहारिक प्रशिक्षण शामिल हैं। प्रत्येक सेमेस्टर के अंत में एक सेमेस्टर परीक्षा होती है।',
        ],
      },
    },
    funds: {
      title: 'आय के स्रोत',
      content:
        'आरईसी अब एनआईटी, कुरुक्षेत्र के स्थापना के अनुसार, सभी अनवांछित व्यय अंडरग्रेजुएट पाठ्यक्रम पर केंद्रीय और राज्य सरकारों द्वारा 50:50 अनुपात पर उत्तरजीवी था।',
    },
    collaboration: {
      title: 'संस्थान-उद्योग सहयोग',
      content: [
        'ईसीई विभाग का एचपी इंडिया सॉफ्टवेयर ऑपरेशन प्रा. लिमिटेड, 29 कनिंघम रोड, बैंगलोर-52 के साथ एक एमओयू है। इस एमओयू के तहत, B.Tech के अंतिम वर्ष के छात्रों को एचपी के लाइव प्रोजेक्ट सौंपे जाते हैं और इन्हें एचपी और NIT कुरुक्षेत्र के फैकल्टी द्वारा संयुक्त रूप से निगरानी की जाती है।',
        'संस्थान विभिन्न सरकारी और अन्य औद्योगिक संगठनों द्वारा संदर्भित डिज़ाइन और विकास समस्याओं पर परामर्श सेवाएं प्रदान करता है।',
        'TEQIP के प्रयासों के तहत संस्थान-उद्योग संपर्क को बढ़ाने का प्रयास किया जा रहा है। संस्थान ने 19-20 फरवरी, 2007 को होटल शिवालिकव्यू, चंडीगढ़ में उद्योग संस्थान संपर्क (NWIII-2007) पर दो दिवसीय कार्यशाला का आयोजन किया, जिसमें प्रमुख उद्योग और अकादमी के प्रतिनिधियों ने बड़े पैमाने पर भाग लिया। कार्यशाला के विचार-विमर्श के दौरान, NIT कुरुक्षेत्र और अल्टेयर इंजीनियरिंग इंडिया के बीच कंप्यूटर एडेड इंजीनियरिंग (CAE) के क्षेत्र में एक उत्कृष्टता केंद्र की स्थापना के लिए एक समझौता ज्ञापन पर सहमति व्यक्त की गई।',
      ],
    },
    quickLinks: {
      title: 'Quick Links',
      campus: 'कैंपस और बुनियाद',
      documentary: 'संस्थान डॉक्यूमेंटरी',
      organisationChart: 'संगठन चार्ट',
      sections: 'खंड',
      gallery: 'फोटो गैलरी',
      administration: 'प्रशासन',
    },
  },
  Login: {
    title: 'प्रवेश करें',
    enterEmail: 'अपना ईमेल दर्ज करें',
    continueButton: 'अगले चरण पर बढ़ें (तैयार नहीं)',
    signInWithGoogle: 'गूगल द्वारा प्रवेश करें',
  },
  Notifications: {
    title: 'सूचनाएँ',
    categories: {
      academic: 'शैक्षणिक',
      tender: 'निविदाएँ',
      workshop: 'कार्यशालाएं',
      recruitment: 'नियुक्ति',
    },
    viewAll: 'सारा देखें',
  },
  NotFound: {
    title: 'नहीं मिला',
    description: 'अनुरोधित संसाधन नहीं मिल सका',
    backHome: 'घर लौटें',
  },
  Profile: {
    tabs: {
      personal: {
        title: 'व्यक्तिगत विवरण',
        basic: {
          title: 'मूलभूत',
          name: 'नाम',
          rollNumber: 'रोल संख्या',
          sex: 'लिंग',
          dateOfBirth: 'जन्मदिन',
        },
        contact: {
          title: 'संपर्क',
          email: 'संस्थान ईमेल',
          personalEmail: 'व्यक्तिगत ईमेल',
          telephone: 'टेलीफ़ोन',
          alternateTelephone: 'वैकल्पिक टेलीफ़ोन',
        },
        institute: {
          title: 'संस्था',
          degree: 'उपाधि',
          major: 'क्रमादेश',
          currentSemester: 'मौजूदा छमाही',
          section: 'अनुभाग',
        },
        admission: {
          title: 'प्रवेश',
          applicationNumber: 'प्रवेश संख्या',
          candidateCategory: 'उम्मीदवार श्रेणी',
          admissionCategory: 'प्रवेश श्रेणी',
          admissionSubcategory: 'प्रवेश उपश्रेणी',
          dateOfAdmission: 'प्रवेश की तिथि',
        },
        guardians: {
          title: 'अभिभावक',
          father: 'पिता',
          mother: 'माता',
          local: 'स्थानीय संरक्षक',
          name: 'नाम',
          telephone: 'टेलीफ़ोन',
          email: 'ईमेल',
        },
        address: {
          title: 'पता',
          permanent: 'स्थायी पता',
          pinCode: 'पिन कोड',
        },
      },
      notifications: { title: 'सूचनाएँ' },
      courses: { title: 'पाठ्यक्रम' },
      clubs: { title: 'संघठन' },
      results: { title: 'परिणाम और विस्तृत अंक प्रमाण पत्र' },
      bookmarks: { title: 'बुकमार्क्स' },
      quickSend: { title: 'त्वरित प्रेषण' },
    },
    logout: 'प्रस्थान करें',
  },
  Search: {
    placeholder: 'त्वरित खोज...',
    categories: {
      all: 'सभी परिणाम',
      clubs: 'क्लब',
      committees: 'समितियां',
      courses: 'पाठ्यक्रम',
      departments: 'विभाग',
      faculty: 'लोग',
      sections: 'खंड',
      staff: 'कर्मचारी',
    },
    viewAll: 'सारा देखें',
    default: {
      recents: 'ताज़ा खोजें',
      clearRecents: 'हाल की खोजें साफ़ करें',
      mostSearched: 'एनआईटी की सर्वाधिक खोजें',
      studentLinks: {
        title: 'छात्र संबंधित त्वरित लिंक',
        clubs: 'संघठनें',
        courses: 'पाठ्यक्रम',
        departments: 'विभाग',
        notifications: 'सूचनाएँ',
        results: 'परिणाम',
      },
      facultyLinks: {
        title: 'संकाय संबंधित त्वरित लिंक',
        notifications: 'सूचनाएँ',
        profile: 'मेरा विवरण',
      },
    },
  },
  Section: {
    about: 'परिचय',
    gallery: 'चित्र',

    Account: {},
    CentralLibrary: {},
    CentralWorkshop: {},
    CentreOfComputingAndNetworking: {},
    ElectricalMaintenance: {},
    Estate: {},
    GeneralAdministration: {},
    HealthCentre: {},
    Security: {},
    Sports: {},
    Store: {},
  },
  Status: {
    NoResult: {
      title: 'कोई परिणाम नहीं मिला',
      description: 'आपके दिए गए प्रश्न से कोई परिणाम मेल नहीं खाता।',
    },
    Unauthorised: {
      title: 'अनधिकृत',
      description: 'आप इस पृष्ठ को देखने के लिए अधिकृत नहीं हैं।',
    },
    WorkInProgress: {
      title: 'कार्य प्रगति पर है',
      description: 'इस पेज पर अभी काम चल रहा है। कृपया दूसरी बार आएं',
    },
  },
  StudentActivities: {
    title: 'छात्र गतिविधियाँ',
    headings: {
      clubs: 'संघठनें',
      council: 'छात्र परिषद',
      events: 'आयोजनाएँ',
      thoughtLab: 'विचार प्रयोगशाला',
      nss: 'एनएसएस',
      ncc: 'एनसीसी',
    },
    sections: { clubs: { title: 'संघठनें', more: 'सभी संघठनो को तलाशें' } },
  },
};

export default text;
