import type { Translations } from './translations';

const text: Translations = {
  Awards: {
    aboutTitle: 'के बारे में',
    descriptionTitle: 'विवरण',
    criterionTitle: 'मानदंड',
    awards: [
      {
        title: 'सर्वश्रेष्ठ सर्वांगीण पुरस्कार',
        about:
          'संस्थान से स्नातक होने वाले B.Tech. छात्र इस पुरस्कार को पूरा कर सकते हैं जिसमें एक प्रमाणपत्र, नकद पुरस्कार और विजेता के नाम का उल्लेख सम्मान सूची में होता है। छात्रों का चयन उनके अध्ययन और संस्थान में रहने की पूरी अवधि के दौरान की गई अतिरिक्त गतिविधियों के आधार पर किया जाता है।',
        description:
          'उपरोक्त में से अंक घटाए जाएंगे यदि उम्मीदवार के अनुशासनहीनता के मामले पाए जाते हैं। जिन छात्रों को बड़े अनुशासनहीनता के लिए दंडित किया गया है, उन्हें (a) से (e) तक के उपरोक्त अंकों के लिए योग्य नहीं माना जाएगा। उदाहरण के लिए, यदि किसी छात्र को किसी अवधि के लिए संस्थान से निष्कासित कर दिया गया है तो उसे उप-शीर्षक (a) से (e) में शून्य अंक दिए जाएंगे। यदि किसी उम्मीदवार का किसी भी शीर्षक (a) से (e) में स्कोर 40% से कम है, तो उसे उप-शीर्षक के अंतर्गत शून्य अंक दिए जाएंगे।',
        criterion: [
          'सर्वश्रेष्ठ खिलाड़ी ट्रॉफी प्रदान करने के लिए, उम्मीदवारों को निम्नानुसार अंक प्रदान किए जाएंगे:',
          'इंटर स्टेट (राष्ट्रीय सीनियर) 9 अंक',
          'इंटर स्टेट (राष्ट्रीय जूनियर) 7 अंक',
          'इंटर यूनिवर्सिटी 5 अंक',
          'इंटर डिस्ट्रिक्ट (राष्ट्रीय सीनियर) 4 अंक',
          'इंटर डिस्ट्रिक्ट (राष्ट्रीय जूनियर) 3 अंक',
        ],
      },
      {
        title: 'सर्वश्रेष्ठ खिलाड़ी ट्रॉफी',
        about:
          'B.Tech. के उन छात्रों को, जो सेमेस्टर परीक्षा में सर्वोच्च अंक प्राप्त करते हैं, उन्हें तकनीकी पुस्तकों के रूप में रु. 2501 के पुरस्कार दिए जाते हैं। अंतिम वर्ष के बाहर जाने वाले छात्रों को यह राशि नकद में दी जाती है। द्वितीय सर्वश्रेष्ठ खिलाड़ी पुरस्कार के लिए रु. 2001 का नकद पुरस्कार और एक ट्रॉफी देने का भी प्रावधान है।',
        description:
          'उपरोक्त में से अंक घटाए जाएंगे यदि उम्मीदवार के अनुशासनहीनता के मामले पाए जाते हैं। जिन छात्रों को बड़े अनुशासनहीनता के लिए दंडित किया गया है, उन्हें (a) से (e) तक के उपरोक्त अंकों के लिए योग्य नहीं माना जाएगा। उदाहरण के लिए, यदि किसी छात्र को किसी अवधि के लिए संस्थान से निष्कासित कर दिया गया है तो उसे उप-शीर्षक (a) से (e) में शून्य अंक दिए जाएंगे। यदि किसी उम्मीदवार का किसी भी शीर्षक (a) से (e) में स्कोर 40% से कम है, तो उसे उप-शीर्षक के अंतर्गत शून्य अंक दिए जाएंगे।',
        criterion: [
          'सर्वश्रेष्ठ खिलाड़ी ट्रॉफी प्रदान करने के लिए, उम्मीदवारों को निम्नानुसार अंक प्रदान किए जाएंगे:',
          'इंटर स्टेट (राष्ट्रीय सीनियर) 9 अंक',
          'इंटर स्टेट (राष्ट्रीय जूनियर) 7 अंक',
          'इंटर यूनिवर्सिटी 5 अंक',
          'इंटर डिस्ट्रिक्ट (राष्ट्रीय सीनियर) 4 अंक',
          'इंटर डिस्ट्रिक्ट (राष्ट्रीय जूनियर) 3 अंक',
        ],
      },
      {
        title: 'सामान्य फिटनेस और व्यावसायिक योग्यता अंक',
        about:
          'वर्ष 1989-90 से वर्ष के सर्वश्रेष्ठ तकनीकी कार्य मॉडल के लिए रु. 50001 का पुरस्कार स्थापित किया गया है। संस्थान के सभी छात्र इस पुरस्कार के लिए आवेदन करने के पात्र हैं।',
      },
      {
        title: 'सर्वश्रेष्ठ खिलाड़ी ट्रॉफी',
        about:
          'छात्रों को अपनी व्यक्तित्व को पूर्ण रूप से विकसित करने के लिए खेल, सह-पाठयक्रम गतिविधियों और सामाजिक सेवा को सक्रिय रूप से अपनाने के लिए प्रोत्साहित किया जाता है। इन क्षेत्रों में उनकी उपलब्धियों को सामान्य फिटनेस और व्यावसायिक योग्यता में प्राप्त अंकों में प्रतिबिंबित किया जाता है। बी.टेक. डिग्री पाठ्यक्रम की परीक्षा योजना में इस शीर्षक के तहत पैंसठ अंक आवंटित किए गए हैं।',
        description:
          "उपरोक्त में से अंक घटाए जाएंगे यदि उम्मीदवार के अनुशासनहीनता के मामले पाए जाते हैं। जिन छात्रों को बड़े अनुशासनहीनता के लिए दंडित किया गया है, उन्हें (a) से (e) तक के उपरोक्त अंकों के लिए योग्य नहीं माना जाएगा। उदाहरण के लिए, यदि किसी छात्र को किसी अवधि के लिए संस्थान से निष्कासित कर दिया गया है तो उसे उप-शीर्षक (a) से (e) में शून्य अंक दिए जाएंगे। यदि किसी उम्मीदवार का किसी भी शीर्षक (a) से (e) में स्कोर 40% से कम है, तो उसे उप-शीर्षक के अंतर्गत शून्य अंक दिए जाएंगे। विभिन्न क्षेत्रों में छात्रों की उपलब्धियों के अनुपात में अंक उन्हें अंतिम समग्र मौखिक परीक्षा के समय निदेशक द्वारा प्रदान किए जाएंगे। खेल/क्लब/पत्रिका/NSS/NCC आदि गतिविधियों में प्रतिस्पर्धात्मक उत्कृष्टता का दावा करने वाले छात्र, अपनी गतिविधियों के संबंधित शिक्षक प्रभारी से सत्यापन प्राप्त करने के बाद अंक प्राप्त करने के लिए निदेशक से आवेदन कर सकते हैं। एक समिति जिसमें क्लब के अध्यक्ष, खेल अध्यक्ष, संस्थान पत्रिका के स्टाफ संपादक और NSS के शिक्षक प्रभारी शामिल हैं, छात्रों के दावों की जांच करने और उन्हें अंक प्रदान करने की सिफारिश करने में निदेशक की सहायता करती है। जिन्होंने संस्थान में अपने रहने के दौरान अनुशासनहीनता या अवांछनीय गतिविधियों में भाग लिया है, वे अनुचित आचरण के लिए अपने अपराधों की गंभीरता के सीधे अनुपात में अंक खो देंगे। इस शीर्षक (आचरण) के तहत कोई अंक नहीं दिए जाएंगे जिन्हें संस्थान से 'निष्कासित' किया गया है।",
        criterion: [
          'सर्वश्रेष्ठ खिलाड़ी ट्रॉफी प्रदान करने के लिए, उम्मीदवारों को निम्नानुसार अंक प्रदान किए जाएंगे:',
          'शैक्षणिक रिकॉर्ड 12 अंक',
          'आचरण 12 अंक',
          'इंटर यूनिवर्सिटी 5 अंक',
          'खेल और सह-पाठयक्रम गतिविधियां 20 अंक',
          'सामान्य प्रभाव 15 अंक',
        ],
      },
      {
        title: 'डॉ. आर.पी. सिंह रजत पदक',
        about:
          'स्वर्गीय डॉ. आर.पी. सिंह की स्मृति में रजत पदक, यांत्रिक इंजीनियरिंग में प्रथम, द्वितीय, तृतीय वर्ष के टॉपर्स को प्रदान किया जाएगा।',
      },
      {
        title: 'गुरु हरकृष्ण, शैक्षिक सोसाइटी, चंडीगढ़',
        about:
          'सोसाइटी ने बी.टेक. डिग्री कोर्स के सभी विषयों के समग्र टॉपर के लिए रु. 501/- का पुरस्कार स्थापित किया है।',
      },
      {
        title: 'हरियाणा राज्य औद्योगिक विकास निगम लिमिटेड',
        about:
          'निगम ने सिविल, कंप्यूटर और यांत्रिक इंजीनियरिंग के विषयों में संस्थान में अध्ययनरत हरियाणा के छात्रों के लिए मेरिट-कम-मीन्स छात्रवृत्ति स्थापित की है। छात्रवृत्ति राशि रु. 500/- प्रति माह, दस महीने की अवधि के लिए है।',
      },
      {
        title: 'पदक',
        about:
          'सोने का पदक और रु. 5000/- का नकद पुरस्कार उन छात्रों के लिए है जो एनआईटी कुरुक्षेत्र के उपरोक्त विषयों में अंतिम परीक्षा में प्रथम स्थान प्राप्त करते हैं।',
      },
      {
        title: 'हरियाणा राज्य इलेक्ट्रॉनिक्स विकास निगम लिमिटेड, चंडीगढ़',
        about:
          'निगम ने हरियाणा में संस्थानों के इलेक्ट्रॉनिक्स/कंप्यूटर क्षेत्र में हार्टन गोल्ड, सिल्वर और ब्रॉन्ज पदक स्थापित किए हैं, जो मेरिट प्रमाणपत्र और नकद पुरस्कार रु. 3000/- रु. 2000/- और रु. 1000/- के साथ होते हैं।',
      },
      {
        title: 'श्री श्याम सुंदर धींगरा पदक',
        about:
          '1981-86 बैच (ई) शाखा के छात्र ने स्वर्गीय श्री श्याम सुंदर धींगरा की स्मृति में बी.टेक. सीई शाखा के टॉप रैंकर को रु. 5000/- का नकद पुरस्कार और पदक प्रदान किया है, जो 2003 से प्रभावी है।',
      },
    ],
  },
  Main: {
    director: {
      alt: 'डा. बी. वी. रमणा रेड्डी',
      title: 'निर्देशक का कोना',
      name: 'डा. बी. वी. रमणा रेड्डी',
      quote: [
        `भारत, साधकों की भूमि, ११०० वर्षों की पराधीनता, युद्ध, विलय और अपमान के बाद फिर से विश्व गुरु बन्ने
      के शिखर पर है। हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण ७५ वर्षों से यह फिर से एक स्वतंत्र
      देश है और इसने अपनी समृद्ध विविधता, संस्कृतियों, भाषाओं के साथ राष्ट्र के निर्माण की कई चुनौतियों के बीच
      खड़े होने की कला सीख ली है। देश को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता ही हमारा मंत्र है।`,
        'मैं इस संस्था की वेबसाइट पर आने वाले सभी लोगों का हृदय से स्वागत करता हूं।',
      ],
      more: 'और पढ़ें',
    },
  },

  Clubs: { title: 'संघठनें' },
  Committee: {
    building: 'निर्माण एवं कार्य समिति',
    financial: 'वित्तीय समिति',
    governor: 'राज्यपाल मंडल',
    members: {
      title: 'सदस्य',
      serial: 'क्रम संख्या',
      nomination: 'नामांकन',
      name: 'नाम',
      servingAs: 'के रूप में सेवारत',
    },
    meetings: {
      title: 'बैठकें',
      serial: 'बैठक संख्या',
      date: 'दिनांक',
      place: 'स्थान',
      agenda: 'कार्यसूची',
      minutes: 'विवरण',
    },
  },
  Curricula: {
    pageTitle: 'पाठ्यक्रम',
    code: 'कोड',
    title: 'शीर्षक',
    major: 'क्रमादेश',
    credits: 'एल-टी-पी',
    totalCredits: 'क्रेडिट्स',
    syllabus: 'पाठ्यक्रम',
  },
  Departments: { title: 'विभाग' },
  Department: {
    headings: {
      about: 'परिचय',
      vision: 'दृष्टि',
      and: 'और',
      mission: 'उद्देश्य',
      hod: {
        title: 'विभागाध्यक्ष का संदेश',
        session: (from: string) => `शैक्षणिक सत्र ${from} - वर्तमान`,
      },
      programmes: {
        title: 'कार्यक्रम',
        undergrad: 'पूर्वस्नातक',
        postgrad: 'स्नातकोत्तर',
        doctorate: 'डॉक्टरेट',
      },
      gallery: 'चित्र',
    },
    facultyAndStaff: 'संकाय और कर्मचारी',
    laboratories: 'प्रयोगशालाएँ',
    achievements: 'छात्र उपलब्धियाँ',
  },
  FacultyAndStaff: {
    placeholder: 'नाम या ईमेल से खोजें',
    departmentHead: 'विभागाध्यक्ष',
  },
  FAQ: { title: 'अक्सर पूछे जाने वाले प्रश्न' },
  Footer: {
    logo: 'प्रतीक चिन्ह',
    nit: 'राष्ट्रीय प्रौद्योगिकी संस्थान, कुरूक्षेत्र',
    location: 'थानेसर, हरियाणा, भारत १३६११९',
    design: 'कलाकृति',
    headings: ['त्वरित संदर्भ', 'त्वरित संदर्भ', 'त्वरित संदर्भ'],
    lorem: 'लोरेम इप्सम',
    copyright:
      '© २०२४ राष्ट्रीय प्रौद्योगिकी संस्थान कुरूक्षेत्र। सर्वाधिकार आरक्षित।',
  },
  Forms: { title: 'फॉर्म्स' },
  Header: {
    institute: 'संस्थान',
    academics: 'शैक्षिक',
    faculty: 'संकाय और कर्मचारी',
    placement: 'प्रशिक्षण एवं नियुक्ति',
    activities: 'छात्र गतिविधियाँ',
    alumni: 'भूतपूर्व छात्र',
    logo: 'प्रतीक चिन्ह',
    search: 'त्वरित खोज...',
    login: 'प्रवेश',
    profile: { alt: 'मेरी छवि', view: 'विवरण देखें' },
  },
  Login: {
    title: 'प्रवेश करें',
    enterEmail: 'अपना ईमेल दर्ज करें',
    continueButton: 'अगले चरण पर बढ़ें (तैयार नहीं)',
    signInWithGoogle: 'गूगल द्वारा प्रवेश करें',
  },
  Notifications: {
    title: 'सूचनाएँ',
    categories: {
      academic: 'शैक्षणिक',
      tender: 'निविदाएँ',
      workshop: 'कार्यशालाएं',
      recruitment: 'नियुक्ति',
    },
    viewAll: 'सारा देखें',
  },
  NotFound: {
    title: 'नहीं मिला',
    description: 'अनुरोधित संसाधन नहीं मिल सका',
    backHome: 'घर लौटें',
  },
  Profile: {
    tabs: {
      personal: {
        title: 'व्यक्तिगत विवरण',
        basic: {
          title: 'मूलभूत',
          name: 'नाम',
          rollNumber: 'रोल संख्या',
          sex: 'लिंग',
          dateOfBirth: 'जन्मदिन',
        },
        contact: {
          title: 'संपर्क',
          email: 'संस्थान ईमेल',
          personalEmail: 'व्यक्तिगत ईमेल',
          telephone: 'टेलीफ़ोन',
          alternateTelephone: 'वैकल्पिक टेलीफ़ोन',
        },
        institute: {
          title: 'संस्था',
          degree: 'उपाधि',
          major: 'क्रमादेश',
          currentSemester: 'मौजूदा छमाही',
          section: 'अनुभाग',
        },
        admission: {
          title: 'प्रवेश',
          applicationNumber: 'प्रवेश संख्या',
          candidateCategory: 'उम्मीदवार श्रेणी',
          admissionCategory: 'प्रवेश श्रेणी',
          admissionSubcategory: 'प्रवेश उपश्रेणी',
          dateOfAdmission: 'प्रवेश की तिथि',
        },
        guardians: {
          title: 'अभिभावक',
          father: 'पिता',
          mother: 'माता',
          local: 'स्थानीय संरक्षक',
          name: 'नाम',
          telephone: 'टेलीफ़ोन',
          email: 'ईमेल',
        },
        address: {
          title: 'पता',
          permanent: 'स्थायी पता',
          pinCode: 'पिन कोड',
        },
      },
      notifications: { title: 'सूचनाएँ' },
      courses: { title: 'पाठ्यक्रम' },
      clubs: { title: 'संघठन' },
      results: { title: 'परिणाम और विस्तृत अंक प्रमाण पत्र' },
      bookmarks: { title: 'बुकमार्क्स' },
      quickSend: { title: 'त्वरित प्रेषण' },
    },
    logout: 'प्रस्थान करें',
  },
  Search: {
    placeholder: 'त्वरित खोज...',
    categories: {
      allResults: 'सभी परिणाम',
      webPages: 'वेब पृष्ठ',
      people: 'लोग',
      documents: 'दस्तावेज़',
      events: 'आयोजन',
      news: 'समाचार',
      courses: 'पाठ्यक्रम',
      clubs: 'क्लब',
      positions: 'पद',
    },
    viewAll: 'सारा देखें',
    default: {
      recents: 'ताज़ा खोजें',
      clearRecents: 'हाल की खोजें साफ़ करें',
      mostSearched: 'एनआईटी की सर्वाधिक खोजें',
      studentLinks: {
        title: 'छात्र संबंधित त्वरित लिंक',
        clubs: 'संघठनें',
        courses: 'पाठ्यक्रम',
        departments: 'विभाग',
        notifications: 'सूचनाएँ',
        results: 'परिणाम',
      },
      facultyLinks: {
        title: 'संकाय संबंधित त्वरित लिंक',
        notifications: 'सूचनाएँ',
        profile: 'मेरा विवरण',
      },
    },
  },
  Section: {
    about: 'परिचय',
    gallery: 'चित्र',

    Account: {},
    CentralLibrary: {},
    CentralWorkshop: {},
    CentreOfComputingAndNetworking: {},
    ElectricalMaintenance: {},
    Estate: {},
    GeneralAdministration: {},
    HealthCentre: {},
    Security: {},
    Sports: {},
    Store: {},
  },
  StudentActivities: {
    title: 'छात्र गतिविधियाँ',
    headings: {
      clubs: 'संघठनें',
      council: 'छात्र परिषद',
      events: 'आयोजनाएँ',
      thoughtLab: 'विचार प्रयोगशाला',
      nss: 'एनएसएस',
      ncc: 'एनसीसी',
    },
    sections: { clubs: { title: 'संघठनें', more: 'सभी संघठनो को तलाशें' } },
  },
  Unauthorised: {
    title: 'अनधिकृत',
    description: 'आप इस पृष्ठ को देखने के लिए अधिकृत नहीं हैं।',
  },
  WorkInProgress: {
    title: 'कार्य प्रगति पर है',
    description: 'इस पेज पर अभी काम चल रहा है. कृपया दूसरी बार आएं',
  },
};

export default text;
