import type { Translations } from './translations';

const text: Translations = {
  Main: {
    director: {
      alt: 'डा. बी. वी. रमणा रेड्डी',
      title: 'निर्देशक का कोना',
      name: 'डा. बी. वी. रमणा रेड्डी',
      quote: [
        `भारत, साधकों की भूमि, ११०० वर्षों की पराधीनता, युद्ध, विलय और अपमान के बाद फिर से विश्व गुरु बन्ने
      के शिखर पर है। हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण ७५ वर्षों से यह फिर से एक स्वतंत्र
      देश है और इसने अपनी समृद्ध विविधता, संस्कृतियों, भाषाओं के साथ राष्ट्र के निर्माण की कई चुनौतियों के बीच
      खड़े होने की कला सीख ली है। देश को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता ही हमारा मंत्र है।`,
        'मैं इस संस्था की वेबसाइट पर आने वाले सभी लोगों का हृदय से स्वागत करता हूं।',
      ],
      more: 'और पढ़ें',
    },
  },

  Clubs: { title: 'संघठनें' },
  Committee: {
    building: 'निर्माण एवं कार्य समिति',
    financial: 'वित्तीय समिति',
    governor: 'राज्यपाल मंडल',
    members: {
      title: 'सदस्य',
      serial: 'क्रम संख्या',
      nomination: 'नामांकन',
      name: 'नाम',
      servingAs: 'के रूप में सेवारत',
    },
    meetings: {
      title: 'बैठकें',
      serial: 'बैठक संख्या',
      date: 'दिनांक',
      place: 'स्थान',
      agenda: 'कार्यसूची',
      minutes: 'विवरण',
    },
  },
  Curricula: {
    pageTitle: 'पाठ्यक्रम',
    code: 'कोड',
    title: 'शीर्षक',
    major: 'क्रमादेश',
    credits: 'एल-टी-पी',
    totalCredits: 'क्रेडिट्स',
    syllabus: 'पाठ्यक्रम',
  },
  Departments: { title: 'विभाग' },
  Department: {
    headings: {
      about: 'परिचय',
      vision: 'दृष्टि',
      and: 'और',
      mission: 'उद्देश्य',
      hod: {
        title: 'विभागाध्यक्ष का संदेश',
        session: (from: string) => `शैक्षणिक सत्र ${from} - वर्तमान`,
      },
      programmes: {
        title: 'कार्यक्रम',
        undergrad: 'पूर्वस्नातक',
        postgrad: 'स्नातकोत्तर',
        doctorate: 'डॉक्टरेट',
      },
      gallery: 'चित्र',
    },
    facultyAndStaff: 'संकाय और कर्मचारी',
    laboratories: 'प्रयोगशालाएँ',
    achievements: 'छात्र उपलब्धियाँ',
  },
  FacultyAndStaff: {
    placeholder: 'नाम या ईमेल से खोजें',
    departmentHead: 'विभागाध्यक्ष',
  },
  FAQ: { title: 'अक्सर पूछे जाने वाले प्रश्न' },
  Footer: {
    logo: 'प्रतीक चिन्ह',
    nit: 'राष्ट्रीय प्रौद्योगिकी संस्थान, कुरूक्षेत्र',
    location: 'थानेसर, हरियाणा, भारत १३६११९',
    design: 'कलाकृति',
    headings: ['त्वरित संदर्भ', 'त्वरित संदर्भ', 'त्वरित संदर्भ'],
    lorem: 'लोरेम इप्सम',
    copyright:
      '© २०२४ राष्ट्रीय प्रौद्योगिकी संस्थान कुरूक्षेत्र। सर्वाधिकार आरक्षित।',
  },
  Forms: { title: 'फॉर्म्स' },
  Header: {
    institute: 'संस्थान',
    academics: 'शैक्षिक',
    faculty: 'संकाय और कर्मचारी',
    placement: 'प्रशिक्षण एवं नियुक्ति',
    activities: 'छात्र गतिविधियाँ',
    alumni: 'भूतपूर्व छात्र',
    logo: 'प्रतीक चिन्ह',
    search: 'त्वरित खोज...',
    login: 'प्रवेश',
    profile: { alt: 'मेरी छवि', view: 'विवरण देखें' },
  },
  Login: {
    title: 'प्रवेश करें',
    enterEmail: 'अपना ईमेल दर्ज करें',
    continueButton: 'अगले चरण पर बढ़ें (तैयार नहीं)',
    signInWithGoogle: 'गूगल द्वारा प्रवेश करें',
  },
  Notifications: {
    title: 'सूचनाएँ',
    categories: {
      academic: 'शैक्षणिक',
      tender: 'निविदाएँ',
      workshop: 'कार्यशालाएं',
      recruitment: 'नियुक्ति',
    },
    viewAll: 'सारा देखें',
  },
  NotFound: {
    title: 'नहीं मिला',
    description: 'अनुरोधित संसाधन नहीं मिल सका',
    backHome: 'घर लौटें',
  },
  Profile: {
    tabs: {
      personal: {
        title: 'व्यक्तिगत विवरण',
        basic: {
          title: 'मूलभूत',
          name: 'नाम',
          rollNumber: 'रोल संख्या',
          sex: 'लिंग',
          dateOfBirth: 'जन्मदिन',
        },
        contact: {
          title: 'संपर्क',
          email: 'संस्थान ईमेल',
          personalEmail: 'व्यक्तिगत ईमेल',
          telephone: 'टेलीफ़ोन',
          alternateTelephone: 'वैकल्पिक टेलीफ़ोन',
        },
        institute: {
          title: 'संस्था',
          degree: 'उपाधि',
          major: 'क्रमादेश',
          currentSemester: 'मौजूदा छमाही',
          section: 'अनुभाग',
        },
        admission: {
          title: 'प्रवेश',
          applicationNumber: 'प्रवेश संख्या',
          candidateCategory: 'उम्मीदवार श्रेणी',
          admissionCategory: 'प्रवेश श्रेणी',
          admissionSubcategory: 'प्रवेश उपश्रेणी',
          dateOfAdmission: 'प्रवेश की तिथि',
        },
        guardians: {
          title: 'अभिभावक',
          father: 'पिता',
          mother: 'माता',
          local: 'स्थानीय संरक्षक',
          name: 'नाम',
          telephone: 'टेलीफ़ोन',
          email: 'ईमेल',
        },
        address: {
          title: 'पता',
          permanent: 'स्थायी पता',
          pinCode: 'पिन कोड',
        },
      },
      notifications: { title: 'सूचनाएँ' },
      courses: { title: 'पाठ्यक्रम' },
      clubs: { title: 'संघठन' },
      results: { title: 'परिणाम और विस्तृत अंक प्रमाण पत्र' },
      bookmarks: { title: 'बुकमार्क्स' },
      quickSend: { title: 'त्वरित प्रेषण' },
    },
    logout: 'प्रस्थान करें',
  },
  Scholarships: {
    NSP: {
      abbreviation: 'एन.एस.पी',
      title: 'राष्ट्रीय छात्रवृत्ति पोर्टल (एनएसपी)',
      about:
        'राष्ट्रीय छात्रवृत्ति पोर्टल (एनएसपी) छात्रों के लिए छात्रवृत्ति सेवाओं को सुव्यवस्थित करने के लिए डिज़ाइन किया गया एक व्यापक मंच है। इसमें छात्र आवेदन, प्राप्ति, प्रसंस्करण, स्वीकृति, और वितरण सहित छात्रवृत्ति प्रक्रियाओं के विभिन्न चरण शामिल हैं। एनएसपी राष्ट्रीय ई-गवर्नेंस योजना (NeGP) के तहत एक मिशन मोड परियोजना (MMP) के रूप में कार्य करता है, जो सरकार की डिजिटल पहलों के साथ संरेखित है।',
      description:
        'एनएसपी पोर्टल विभिन्न श्रेणियों जैसे सामान्य, ओबीसी, एससी, एसटी, डीएनटी आदि के लिए विभिन्न छात्रवृत्ति योजनाओं की मेजबानी करता है। कुछ उल्लेखनीय योजनाओं में एससी छात्रों के लिए टॉप क्लास एजुकेशन स्कीम और ओबीसी, ईबीसी और डीएनटी छात्रों के लिए कॉलेज में टॉप क्लास एजुकेशन की पीएम यसस्वी केंद्रीय क्षेत्र योजना शामिल हैं। इन योजनाओं को संघ सरकार, राज्य सरकारों और केंद्र शासित प्रदेशों द्वारा शुरू किया गया है, जिनका उद्देश्य छात्रों को वित्तीय सहायता प्रदान करना और शिक्षा की पहुंच को बढ़ावा देना है।',
      objectives: [
        'छात्रों को छात्रवृत्तियों का समय पर वितरण सुनिश्चित करना।',
        'केंद्रीय और राज्य सरकार की छात्रवृत्ति योजनाओं के लिए एकीकृत पोर्टल प्रदान करना।',
        'विद्वानों का पारदर्शी डेटाबेस स्थापित करना।',
        'प्रसंस्करण में दोहराव को रोकना।',
        'छात्रवृत्ति योजनाओं और मानदंडों का मानकीकरण करना।',
        'कुशल निधि वितरण के लिए प्रत्यक्ष लाभ अंतरण (DBT) को लागू करना।',
      ],
    },
    PMSSS: {
      abbreviation: 'पी.एम.एस.एस.',
      title:
        'प्रधानमंत्री विशेष छात्रवृत्ति योजना जम्मू और कश्मीर के छात्रों के लिए',
      about:
        'प्रधानमंत्री विशेष छात्रवृत्ति योजना या PMSSS एक वित्तीय अवसर है जो आल इंडिया काउंसिल फॉर टेक्निकल एजुकेशन (AICTE) द्वारा प्रदान किया जाता है। PMSSS 2023, जिसे AICTE JK Scholarship 2023 भी कहा जाता है। PMSSS का उद्देश्य जम्मू और कश्मीर और लद्दाख क्षेत्र के छात्रों को वित्तीय रूप से सहायता प्रदान करना है।',
    },
    HCS: {
      abbreviation: 'एच.सी.एस',
      title: 'हर-छत्रवृत्ति पोर्टल',
      about:
        "हर-छात्रवृत्ति' पोर्टल, उच्च शिक्षा विभाग द्वारा विकसित, एक केंद्रीकृत मंच है जो योग्य छात्रों के लिए छात्रवृत्ति प्रक्रिया को सुविधाजनक बनाता है। यह पोर्टल उच्च शिक्षा में पहुंच, समानता और गुणवत्ता पर राज्य का ध्यान लगाने के साथ मेल खाता है। पोर्टल 7 सरकारी विभागों से 15 छात्रवृत्ति योजनाओं को समाहित करता है, छात्रवृत्ति वितरण में पहुंच, पारदर्शिता और कुशलता सुनिश्चित करते हुए।",
      description:
        'छात्रवृत्तियों के लिए आवेदन करने से पहले, PPP में नाम, जन्मतिथि, आधार नंबर आदि की नवीनीकृत विवरणों की पुष्टि करें। PMS-SC और PMS-BC योजनाओं के लिए, 1.80 से 2.50 लाख के बीच परिवार की आय वाले आवेदकों को आवेदन प्रक्रिया के दौरान SARAL पोर्टल से परिवार की आय प्रमाणपत्र डाउनलोड और अपलोड करना होगा।',
      objectives: [
        'केंद्रीकृत एंड-टू-एंड छात्रवृत्ति प्रक्रिया, जिसमें आवेदन प्रस्तुति, सत्यापन, और वितरण शामिल है। तीन-स्तरीय सत्यापन प्रणाली: संस्थान, विश्वविद्यालय/नोडल बॉडी, और मुख्य कार्यालय, जो आवेदक प्रमाणीकरण सुनिश्चित करते हैं। परिवार पहचान पत्र (PPP) योजना के साथ एकीकरण छात्रवृत्ति लाभार्थी सत्यापन के लिए। छात्रवृत्ति लाभ के लिए PPP की अनिवार्य आवश्यकता। हरियाणा के निवासी छात्रों को राज्य के बाहर पढ़ने की अनुमति, जो संबंधित विभागों द्वारा सत्यापित की गई है।',
      ],
    },
    RSSO: {
      abbreviation: 'आर.एस.एस.ओ.',
      title: 'राजस्थान सिंगल साइन-ऑन (एसएसओ) छात्रवृत्ति',
      about:
        'राजस्थान में SSO योजना छात्रों के लिए छात्रवृत्ति उपयोग को सुविधाजनक बनाती है। निवासियों को ऑनलाइन पंजीकरण के माध्यम से इस योजना के लिए आसानी से आवेदन कर सकते हैं, जहां SSO आईडी का उपयोग विभिन्न आधिकारिक सेवाओं के लिए एकल साइन-इन के रूप में होता है। इसमें श्रम कार्ड, आधार कार्ड, खाद्य सुरक्षा, सरकारी खेत, और अन्य सेवाओं का उपयोग शामिल है।',
      description:
        'राजस्थान SSO छात्रवृत्ति योजना के बारे में अधिक जानकारी चाहने वाले छात्र आधिकारिक पोर्टल https://sso.rajasthan.gov.in पर जा सकते हैं। पोर्टल पंजीकरण प्रक्रिया, पात्रता मानदंड, और SSO आईडी के माध्यम से पहुंचने वाली विभिन्न सेवाओं पर विस्तृत मार्गदर्शन प्रदान करता है, जो आवेदकों के लिए स्पष्टता और पहुंच की सुविधा को बढ़ावा देता है।',
      objectives: [
        'राजस्थान SSO पोर्टल, जिसे राज्य सरकार ने विकसित किया है, नागरिकों को विभिन्न ऑनलाइन सेवाओं तक पहुंच के लिए एक केंद्रीकृत मंच प्रदान करता है। SSO आईडी के लिए पंजीकरण करके, व्यक्ति को सरकारी सेवाओं तक पहुंच के लिए एक विशेष डिजिटल पहचान मिलती है। इसमें पंजीकरण प्रक्रिया, पात्रता मानदंड, और वेब पोर्टल पर उपलब्ध सेवाओं के विस्तृत जानकारी शामिल है।',
      ],
    },
    PMBS: {
      abbreviation: 'पी.एम.बी.एस',
      title: 'पोस्ट मैट्रिक बिहार छात्रवृत्ति',
      about:
        'बिहार सरकार ने पोस्ट मैट्रिक छात्रवृत्ति योजना की शुरुआत प्राथमिक उद्देश्य से की थी, जो छात्रों को उच्च शिक्षा का पीछा करने में सहायता और प्रोत्साहन करने के लिए है। बिहार पोस्ट मैट्रिक छात्रवृत्ति का लाभ यह है कि इसमें एससी/एसटी/बीसी/ईबीसी श्रेणियों में आने वाले छात्रों को वित्तीय सहायता प्रदान करता है, विशेष रूप से प्रोत्साहन राशि के रूप में। बिहार पोस्ट मैट्रिक छात्रवृत्ति एक वित्तीय सहायता कार्यक्रम है जो आर्थिक रूप से पिछड़े परिवारों के छात्रों को उच्च शिक्षा करने में मदद करने के लिए डिज़ाइन किया गया है। बिहार पोस्ट मैट्रिक छात्रवृत्ति की पुरस्कार राशि पाठ्यक्रम और अध्ययन के स्तर पर भिन्न होती है। छात्रवृत्ति में पाठ्यक्रम शुल्क, रक्षा भत्ता, और छात्र की शिक्षा से संबंधित अन्य खर्चों का भुगतान शामिल है।',
    },
    UPS: {
      abbreviation: 'यू. पी. एस',
      title: 'उत्तर प्रदेश छात्रवृत्ति (यूपीएस)',
      about:
        'उत्तर प्रदेश सरकार ने राज्य के छात्रों के लिए कई छात्रवृत्ति अवसर शुरू किए हैं। हर छात्रवृत्ति के अपने पात्रता मानदंड होते हैं जिन्हें छात्रों को पूरा करना होता है और छात्रवृत्ति अवसर के लिए पात्र होना होता है। उत्तर प्रदेश की छात्रवृत्तियों के लिए लागू एक प्रमुख मानदंड है कि छात्रों को उत्तर प्रदेश (यूपी) के स्थायी निवासी होना चाहिए या यूपी का निवासी प्रमाणपत्र होना चाहिए। अकादमिक योग्यता, पारिवारिक आय सीमा, आदि के अन्य पहलुओं से संबंधित पूरी जानकारी छात्रवृत्तियों के सफल आवेदन में सहायक होती है।',
    },
    MMVY: {
      abbreviation: 'एम.एम.वी.वाई.',
      title: 'मुख्यमंत्री मेधावी विद्यार्थी योजना',
      about:
        'मुख्यमंत्री मेधावी विद्यार्थी योजना मध्य प्रदेश सरकार द्वारा चलाई जाने वाली एक राज्य कार्यक्रम है। यह पुरस्कार वो छात्रों के लिए उपलब्ध है जिन्होंने 12वीं कक्षा में 70% अंक प्राप्त किए हैं और वर्तमान में स्नातक, स्नातकोत्तर या पेशेवर पाठ्यक्रमों को कर रहे हैं। छात्रवृत्ति की राशि पाठ्यक्रम से पाठ्यक्रम और कॉलेज के प्रकार के आधार पर भिन्न होती है।',
    },
    note: {
      title: 'संदेश',
      description:
        'सभी प्रकार की छात्रवृत्ति सूचनाएं विभिन्न विभागों/स्कूलों/होस्टलों में सूचना बोर्ड्स और संस्थान की वेबसाइट के माध्यम से सर्कुलेट और अपलोड की जाएंगी। छात्र को छात्रवृत्ति फार्म के सभी सहायक दस्तावेजों के साथ शैक्षणिक खंड में जमा करना आवश्यक है ताकि आवेदन की आगे की सत्यापन और फारवर्डिंग की जा सके। एक शैक्षणिक वर्ष में एक ही छात्रवृत्ति का लाभ ले सकता है। यदि किसी छात्र ने पिछले आवेदित छात्रवृत्ति में चयन नहीं होने का सबूत देकर एक से अधिक छात्रवृत्ति के लिए आवेदन किया है, तो उसे एक से अधिक छात्रवृत्ति के लिए आवेदन कर सकता है। छात्र को छात्रवृत्ति का लाभ उठाने की स्थिति के बारे में शैक्षणिक खंड को सूचित करना छात्र की जिम्मेदारी है। बाद में, किसी भी छात्र को पाया जाता है कि वह एक समय में दो छात्रवृत्तियों का लाभ उठा रहा है, तो नियमानुसार कार्रवाई की जाएगी। यहाँ अभिलेखित छात्रवृत्ति सूचनाओं को ब्राउज़ करें।',
    },
    visitPortal: 'पोर्टल में जाएं।',
    description: 'विवरण',
    about: 'परिचय',
    objectives: 'लक्ष्य',
  },
  Search: {
    placeholder: 'त्वरित खोज...',
    categories: {
      allResults: 'सभी परिणाम',
      webPages: 'वेब पृष्ठ',
      people: 'लोग',
      documents: 'दस्तावेज़',
      events: 'आयोजन',
      news: 'समाचार',
      courses: 'पाठ्यक्रम',
      clubs: 'क्लब',
      positions: 'पद',
    },
    viewAll: 'सारा देखें',
    default: {
      recents: 'ताज़ा खोजें',
      clearRecents: 'हाल की खोजें साफ़ करें',
      mostSearched: 'एनआईटी की सर्वाधिक खोजें',
      studentLinks: {
        title: 'छात्र संबंधित त्वरित लिंक',
        clubs: 'संघठनें',
        courses: 'पाठ्यक्रम',
        departments: 'विभाग',
        notifications: 'सूचनाएँ',
        results: 'परिणाम',
      },
      facultyLinks: {
        title: 'संकाय संबंधित त्वरित लिंक',
        notifications: 'सूचनाएँ',
        profile: 'मेरा विवरण',
      },
    },
  },
  Section: {
    about: 'परिचय',
    gallery: 'चित्र',

    Account: {},
    CentralLibrary: {},
    CentralWorkshop: {},
    CentreOfComputingAndNetworking: {},
    ElectricalMaintenance: {},
    Estate: {},
    GeneralAdministration: {},
    HealthCentre: {},
    Security: {},
    Sports: {},
    Store: {},
  },
  StudentActivities: {
    title: 'छात्र गतिविधियाँ',
    headings: {
      clubs: 'संघठनें',
      council: 'छात्र परिषद',
      events: 'आयोजनाएँ',
      thoughtLab: 'विचार प्रयोगशाला',
      nss: 'एनएसएस',
      ncc: 'एनसीसी',
    },
    sections: { clubs: { title: 'संघठनें', more: 'सभी संघठनो को तलाशें' } },
  },
  Unauthorised: {
    title: 'अनधिकृत',
    description: 'आप इस पृष्ठ को देखने के लिए अधिकृत नहीं हैं।',
  },
  WorkInProgress: {
    title: 'कार्य प्रगति पर है',
    description: 'इस पेज पर अभी काम चल रहा है. कृपया दूसरी बार आएं',
  },
};

export default text;
