import type { Translations } from './translations';

const text: Translations = {
  Main: {
    director: {
      alt: 'डा. बी. वी. रमणा रेड्डी',
      title: 'निर्देशक का कोना',
      name: 'डा. बी. वी. रमणा रेड्डी',
      quote: [
        `भारत, साधकों की भूमि, ११०० वर्षों की पराधीनता, युद्ध, विलय और अपमान के बाद फिर से विश्व गुरु बन्ने
      के शिखर पर है। हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण ७५ वर्षों से यह फिर से एक स्वतंत्र
      देश है और इसने अपनी समृद्ध विविधता, संस्कृतियों, भाषाओं के साथ राष्ट्र के निर्माण की कई चुनौतियों के बीच
      खड़े होने की कला सीख ली है। देश को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता ही हमारा मंत्र है।`,
        'मैं इस संस्था की वेबसाइट पर आने वाले सभी लोगों का हृदय से स्वागत करता हूं।',
      ],
      more: 'और पढ़ें',
    },
    title: {
      primary: 'एनआईटी कुरुक्षेत्र',
      secondary: 'NIT KURUKSHETRA',
    },
    slideshow: [
      {
        image: 'slideshow/image01.jpg',
        title: 'एनआईटी केकेआर को पहला हरित परिसर वाला एनआईटी माना गया!',
        subtitle:
          'परिसर की दीवारों के साथ 900 एकड़ से अधिक हरी पत्तियां लगाई गई हैं, प्रतिष्ठित संस्थान का परिसर...',
      },
      {
        image: 'slideshow/image02.jpg',
        title: 'राष्ट्रीय संस्थान शीर्ष 10 इंजीनियरिंग कॉलेजों में शामिल',
        subtitle:
          'एनआईटी कुरुक्षेत्र ने भारत के शीर्ष 10 इंजीनियरिंग कॉलेजों में स्थान हासिल किया है, शिक्षा और अनुसंधान में उत्कृष्टता का प्रदर्शन...',
      },
      {
        image: 'slideshow/image03.jpg',
        title: 'छात्रों के लिए अत्याधुनिक अनुसंधान सुविधाएं अब खुली हैं',
        subtitle:
          'एनआईटी केकेआर में नवनिर्मित अनुसंधान प्रयोगशालाएं और केंद्र छात्रों और संकाय सदस्यों के लिए अत्याधुनिक तकनीक और संसाधन प्रदान करते हैं...',
      },
    ],
  },

  Clubs: { title: 'संघठनें' },
  Committee: {
    building: 'निर्माण एवं कार्य समिति',
    financial: 'वित्तीय समिति',
    governor: 'राज्यपाल मंडल',
    members: {
      title: 'सदस्य',
      serial: 'क्रम संख्या',
      nomination: 'नामांकन',
      name: 'नाम',
      servingAs: 'के रूप में सेवारत',
    },
    meetings: {
      title: 'बैठकें',
      serial: 'बैठक संख्या',
      date: 'दिनांक',
      place: 'स्थान',
      agenda: 'कार्यसूची',
      minutes: 'विवरण',
    },
  },
  Curricula: {
    pageTitle: 'पाठ्यक्रम',
    code: 'कोड',
    title: 'शीर्षक',
    major: 'क्रमादेश',
    credits: 'एल-टी-पी',
    totalCredits: 'क्रेडिट्स',
    syllabus: 'पाठ्यक्रम',
  },
  Departments: { title: 'विभाग' },
  Department: {
    headings: {
      about: 'परिचय',
      vision: 'दृष्टि',
      and: 'और',
      mission: 'उद्देश्य',
      hod: {
        title: 'विभागाध्यक्ष का संदेश',
        session: (from: string) => `शैक्षणिक सत्र ${from} - वर्तमान`,
      },
      programmes: {
        title: 'कार्यक्रम',
        undergrad: 'पूर्वस्नातक',
        postgrad: 'स्नातकोत्तर',
        doctorate: 'डॉक्टरेट',
      },
      gallery: 'चित्र',
    },
    facultyAndStaff: 'संकाय और कर्मचारी',
    laboratories: 'प्रयोगशालाएँ',
    achievements: 'छात्र उपलब्धियाँ',
  },
  Events: {
    title: 'कार्यक्रम और समाचार',
    categories: {
      featured: 'विशेष',
      recents: 'हाल ही में',
      student: 'छात्र',
      faculty: 'शिक्षक',
    },
    viewAll: 'सभी देखें',
  },

  FacultyAndStaff: {
    placeholder: 'नाम या ईमेल से खोजें',
    departmentHead: 'विभागाध्यक्ष',
  },
  FAQ: { title: 'अक्सर पूछे जाने वाले प्रश्न' },
  Footer: {
    logo: 'प्रतीक चिन्ह',
    nit: 'राष्ट्रीय प्रौद्योगिकी संस्थान, कुरूक्षेत्र',
    location: 'थानेसर, हरियाणा, भारत १३६११९',
    design: 'कलाकृति',
    headings: ['त्वरित संदर्भ', 'त्वरित संदर्भ', 'त्वरित संदर्भ'],
    lorem: 'लोरेम इप्सम',
    copyright:
      '© २०२४ राष्ट्रीय प्रौद्योगिकी संस्थान कुरूक्षेत्र। सर्वाधिकार आरक्षित।',
  },
  Forms: { title: 'फॉर्म्स' },
  Header: {
    institute: 'संस्थान',
    academics: 'शैक्षिक',
    faculty: 'संकाय और कर्मचारी',
    placement: 'प्रशिक्षण एवं नियुक्ति',
    activities: 'छात्र गतिविधियाँ',
    alumni: 'भूतपूर्व छात्र',
    logo: 'प्रतीक चिन्ह',
    search: 'त्वरित खोज...',
    login: 'प्रवेश',
    profile: { alt: 'मेरी छवि', view: 'विवरण देखें' },
  },
  Login: {
    title: 'प्रवेश करें',
    enterEmail: 'अपना ईमेल दर्ज करें',
    continueButton: 'अगले चरण पर बढ़ें (तैयार नहीं)',
    signInWithGoogle: 'गूगल द्वारा प्रवेश करें',
  },
  Notifications: {
    title: 'सूचनाएँ',
    categories: {
      academic: 'शैक्षणिक',
      tender: 'निविदाएँ',
      workshop: 'कार्यशालाएं',
      recruitment: 'नियुक्ति',
    },
    viewAll: 'सारा देखें',
  },
  NotFound: {
    title: '404',
    description: 'लगता है आप भटक गए  हैं,',
    backHome: 'चलिए, आपको होम पेज पर ले चलें।',
  },
  Profile: {
    tabs: {
      personal: {
        title: 'व्यक्तिगत विवरण',
        basic: {
          title: 'मूलभूत',
          name: 'नाम',
          rollNumber: 'रोल संख्या',
          sex: 'लिंग',
          dateOfBirth: 'जन्मदिन',
        },
        contact: {
          title: 'संपर्क',
          email: 'संस्थान ईमेल',
          personalEmail: 'व्यक्तिगत ईमेल',
          telephone: 'टेलीफ़ोन',
          alternateTelephone: 'वैकल्पिक टेलीफ़ोन',
        },
        institute: {
          title: 'संस्था',
          degree: 'उपाधि',
          major: 'क्रमादेश',
          currentSemester: 'मौजूदा छमाही',
          section: 'अनुभाग',
        },
        admission: {
          title: 'प्रवेश',
          applicationNumber: 'प्रवेश संख्या',
          candidateCategory: 'उम्मीदवार श्रेणी',
          admissionCategory: 'प्रवेश श्रेणी',
          admissionSubcategory: 'प्रवेश उपश्रेणी',
          dateOfAdmission: 'प्रवेश की तिथि',
        },
        guardians: {
          title: 'अभिभावक',
          father: 'पिता',
          mother: 'माता',
          local: 'स्थानीय संरक्षक',
          name: 'नाम',
          telephone: 'टेलीफ़ोन',
          email: 'ईमेल',
        },
        address: {
          title: 'पता',
          permanent: 'स्थायी पता',
          pinCode: 'पिन कोड',
        },
      },
      notifications: { title: 'सूचनाएँ' },
      courses: { title: 'पाठ्यक्रम' },
      clubs: { title: 'संघठन' },
      results: { title: 'परिणाम और विस्तृत अंक प्रमाण पत्र' },
      bookmarks: { title: 'बुकमार्क्स' },
      quickSend: { title: 'त्वरित प्रेषण' },
    },
    logout: 'प्रस्थान करें',
  },
  Search: {
    placeholder: 'त्वरित खोज...',
    categories: {
      all: 'सभी परिणाम',
      clubs: 'क्लब',
      committees: 'समितियां',
      courses: 'पाठ्यक्रम',
      departments: 'विभाग',
      faculty: 'लोग',
      sections: 'खंड',
      staff: 'कर्मचारी',
    },
    viewAll: 'सारा देखें',
    default: {
      recents: 'ताज़ा खोजें',
      clearRecents: 'हाल की खोजें साफ़ करें',
      mostSearched: 'एनआईटी की सर्वाधिक खोजें',
      studentLinks: {
        title: 'छात्र संबंधित त्वरित लिंक',
        clubs: 'संघठनें',
        courses: 'पाठ्यक्रम',
        departments: 'विभाग',
        notifications: 'सूचनाएँ',
        results: 'परिणाम',
      },
      facultyLinks: {
        title: 'संकाय संबंधित त्वरित लिंक',
        notifications: 'सूचनाएँ',
        profile: 'मेरा विवरण',
      },
    },
  },
  Section: {
    about: 'परिचय',
    gallery: 'चित्र',

    Account: {},
    Library: {
      name: 'केंद्रीय पुस्तकालय',
      heading: {
        about: 'के बारे में',
        totalAreaLibraryHours: 'कुल क्षेत्र और पुस्तकालय का समय',
        facilities: 'सुविधाएँ',
        quickLinks: 'त्वरित लिंक्स',
        contactUs: 'संपर्क करें',
        gallery: 'गैलरी',
        libraryHours: 'पुस्तकालय का समय',
        totalFloorArea: 'कुल फ़्लोर क्षेत्र और पढ़ाई का स्थान',
        totalFloorAreaText:
          'पुस्तकालय एक बढ़ते हुए जीव है। सभी आवश्यकताओं को पूरा करने के लिए, पर्याप्त जगह स्टैकिंग, पढ़ाई और अन्य सेवाओं के लिए जोड़ी गई है। पुस्तकालय में 500 पाठकों की पढ़ाई करने की क्षमता है और नए दस्तावेज़ों, एक डिजिटल पुस्तकालय और ऑडियो-वीजुअल केंद्र को स्टैक करने के लिए पर्याप्त जगह है। वर्तमान में पुस्तकालय का कुल क्षेत्र 36711 वर्ग फ़ुट है।',
        libraryHoursText: `पढ़ाई की सुविधाएँ: 24x07x365
स्टैक और परिपत्र: 
सभी काम के दिन: सुबह 08:30 से शाम 05:30 बजे तक 
शनिवार और अवकाश: सुबह 09:00 से शाम 05:00 बजे तक`,
        aboutText:
          'पुस्तकालय, प्रारंभ में 1965 में स्थापित किया गया, आकार, संग्रह और सेवाओं में बढ़ गया है। वर्तमान में, NIT कुरुक्षेत्र में एक बहुत बड़ा पुस्तकालय है जिसमें टेक्स्ट और संदर्भ पुस्तकें, सीडी-आरओएम, और एक बड़ी संख्या में प्रिंट और ऑनलाइन पत्रिकाएँ और ई-पुस्तकें शामिल हैं। अपने वृद्धि श्रोत, जगह, और सेवाओं के साथ, पुस्तकालय शिक्षकों, अनुसंधानकर्ताओं, विद्यार्थियों की आवश्यकताओं को पूरा करता है।',
      },
      facilities: {
        bookBankFacilities: 'पुस्तक बैंक सुविधाएँ',
        libraryAutomation: 'पुस्तकालय स्वचालन प्रणाली, वेब-ओपेक, और परिपत्र',
        audioVideoCenter: 'ऑडियो-वीडियो केंद्र',
        jGatePlus: 'जेगेट प्लस',
        nptel: 'एनपीटीईईएल वेब और वीडियो पाठ्यक्रम',
        remoteAccess: 'दूरस्थ पहुंच सेवा: केएनआईएमबीयूएस',
        antiPlagiarism: 'खोजफलस्ती प्रतिलिपि नकल रोकथाम सॉफ़्टवेयर (टर्निटिन)',
        bookBankFacilitiesText:
          'पुस्तक बैंक पुस्तक बैंक की सबसे धनी है। सभी बी. टेक, एम.टेक, एमबीए और एमसीए छात्रों को पूरे सेमेस्टर के लिए 6-8 पुस्तकें बुक बैंक से दी जाती हैं।',
        libraryAutomationText:
          'पुस्तकालय कोहा सॉफ़्टवेयर का उपयोग करके पुस्तकालय के सभी खंडों में स्वचालित सेवाएँ प्रदान कर रहा है। सभी पुस्तकें बार-कोड किए गए हैं, और सदस्यों को बार-कोड सदस्यता कार्ड भी दिया जाता है ताकि पुस्तकालय में दस्तावेजों की चक्कियां स्मूद रूप से हो सकें। पुस्तकालय का डेटाबेस नियमित रूप से अपडेट किया जाता है, और पाठक वेब-ओपेक (ऑनलाइन सार्वजनिक पहुंच सूची) का उपयोग करके दस्तावेज़ों की खोज कर सकते हैं।',
        audioVideoCenterText:
          'पुस्तकालय में संपूर्ण एयर-संचालित ऑडियो-वीडियो केंद्र है जो सेमिनार, सम्मेलन, मेहमान व्याख्यान, उपयोगकर्ता जागरूकता कार्यक्रम आदि के लिए सीटिंग क्षमता 100 प्रतिभागियों के साथ है। यह वीडियो कॉन्फ्रेंसिंग सुविधा से भी संपन्न है।',
        jGatePlusText:
          'जेगेट कस्टम सामग्री के लिए संघ (जेसीसी) एक वर्चुअल पुस्तकालय है जो एक अनुकूलित ई-पत्रिका पहुंच गेटवे और डेटाबेस समाधान के रूप में बनाया गया है। यह एक बिंदु पहुंच प्रदान करता है 7900+ पत्रिकाओं को जिन्हें वर्तमान में यूजीसी इंफोनेट डिजिटल पुस्तकालय संघ द्वारा सदस्यता लिया गया है साथ ही उन विश्वविद्यालयों को भी सूचीबद्ध किया है जो अंतर पुस्तकालय ऋण (आईएलएल) केंद्र के रूप में निर्दिष्ट हैं साथ ही ओपन एक्सेस पत्रिकाओं की सूची।',
        nptelText:
          'पुस्तकालय ने आईआईटी, चेन्नई द्वारा डिज़ाइन और विकसित किए गए विभिन्न इंजीनियरिंग और विज्ञान विषयों में एनपीटीईईएल वेब और वीडियो पाठ्यक्रम प्राप्त किए हैं जिनका उपयोग शिक्षकों, अनुसंधान छात्रों और छात्रों के लिए किया जा सकता है। प्रयोक्ता इन वीडियो कोर्सेज का उपयोग पुस्तकालय संग्रह सर्वर के माध्यम से कर सकते हैं:',
        remoteAccessText:
          'पुस्तकालय को सदस्यता प्राप्त ई-संसाधनों की बाहरी पहुंच प्रदान करने के लिए, पुस्तकालय ने KNIMBUS सेवा की सदस्यता ली है। उपयोक्ता अपना खाता बना सकते हैं या तो nitkkr.knimbus.com पर जाकर या हमें librarian@nitkkr.ac.in पर लिखकर। खाता बनाने के बाद, उपयोक्ता लॉग इन कर सकते हैं और कहीं से भी सभी ई-संसाधनों का उपयोग कर सकते हैं।',
        antiPlagiarismText:
          'पुस्तकालय ने सभी शिक्षकों, अनुसंधान छात्रों और छात्रों के लिए खोजफलस्ती सॉफ़्टवेयर टर्निटिन की सदस्यता ली है। उपयोक्ता इस सुविधा का उपयोग करके अपने अनुसंधान पत्र, लेख, थीसिस, डिसर्टेशन आदि की अनुप्रयोग की जांच कर सकते हैं।',
      },
      quickLinks: {
        collectionResources: 'संग्रह और संसाधन',
        libraryCommittee: 'पुस्तकालय समिति',
        membershipPrivileges: 'सदस्यता विशेषाधिकार',
      },
      contactUs: {
        name: 'नाम',
        designation: 'पद और योग्यता',
        phoneNumber: 'फ़ोन नंबर',
        email: 'ईमेल',
      },
      libraryCommittee: {
        libraryCommitteeTitle: 'पुस्तकालय समिति',
        srNo: 'क्रमांक',
        name: 'नाम',
        generalDesignation: 'सामान्य पद',
        libraryCommitteeDesignation: 'पुस्तकालय समिति का पद',
      },
      CollectionAndResources: {
        title: 'संग्रह और संसाधन',
        totalDocuments: 'कुल दस्तावेज़',
        noOfDocuments: '1,72,237',
        totalBooks: 'पुस्तकालय की पुस्तकें',
        noOfBooks: '54,325',
        bookBank: 'पुस्तक बैंक',
        backSets: 'पिछले सेट्स',
        standards: 'मानक',
        cdsDvds: 'सीडी / डीवीडी',
        eBooks: 'ई-बुक्स',
        thesis: 'थीसिस',
        noOfBookBank: '81,259',
        noOfBackSets: '7,097',
        noOfStandards: '10,097',
        noOfCdsDvds: '832',
        noOfEBooks: '12,272',
        noOfThesis: '6,355',
        eresources: {
          title: 'ई-संसाधन',
          currentJournalsHeading: 'वर्तमान पत्रिकाएँ',
          currentJournalsDescription:
            'पुस्तकालय विज्ञान और प्रौद्योगिकी के क्षेत्र में 45 प्रिंट और लगभग 4200+ ऑनलाइन पत्रिकाओं की सदस्यता लेता है। पुस्तकालय में कई नि: शुल्क प्रतियां भी मिलती हैं। इन पत्रिकाओं की सूची पुस्तकालय के अवधारणा खंड में प्रदर्शित की जाती है और पुस्तकालय की अंतरजाल साइट के माध्यम से भी देखी जा सकती है: http://172.16.0.52',
          eShodhSindhuHeading: 'ई-शोध सिंधु (ईएसएस)',
          eShodhSindhuDescription:
            'एनआईटीकेके पुस्तकालय मानव संसाधन विकास मंत्रालय द्वारा स्थापित ई-शोध सिंधु संघ का मूल सदस्य है। प्रस्तुति में संघ द्वारा लगभग 4200+ ई-संसाधन सदस्यता में लेने/ प्रदान किए जा रहे हैं। संस्थान के परिसर में ऑनलाइन संसाधनों तक पहुंच करने के लिए, पुस्तकालय एक आंतरिक रूप से बनाए रखे गए वेब सर्वर के माध्यम से सेवाएं प्रदान कर रहा है। सभी इन संसाधनों/ई-पत्रिकाओं का उपयोग पुस्तकालय अंतरजाल साइट के माध्यम से किया जा सकता है: http://172.16.0.52',
        },
        eResourcesTable: {
          heading: {
            srno: 'क्रमांक',
            electronicResources: 'इलेक्ट्रॉनिक संसाधन',
            url: 'यूआरएल',
          },
        },
      },
      MembershipPrivileges: {
        title: 'सदस्यता और विशेषाधिकार',
        membershipPrivilegesText:
          'इंस्टीट्यूट के छात्र, संकाय अध्यापक, शोधार्थी और कर्मचारी पुस्तकालय के सदस्य के रूप में स्वीकृत होते हैं। पुस्तकालय सदस्यता प्रपत्र पुस्तकालय के परिसर में परिसर में उपलब्ध और जमा किए जा सकते हैं। प्रत्येक श्रेणी के सदस्यों द्वारा उधारण की जाने वाली पुस्तकों की संख्या और ऋण की अवधि निम्नलिखित है:',
        privileges: {
          title: 'विशेषाधिकार',
          conditionOnLoan: 'ऋण पर शर्तें',
          conditionOnLoanOne:
            'पुस्तकालय उन सदस्यों को जो ऋण की दिनांक से पहले ही पुस्तक को वापस लौटा देने का अधिकार रखता है।',
          conditionOnLoanTwo:
            'संदर्भ पुस्तकें, थीसिस और अन्य विशेष पठन सामग्री को सदस्यों को सामान्यत: उधारने की अनुमति नहीं होगी।',
          conditionOnLoanThree:
            'समाचार-पत्रिकाओं के बाउंड / अनबाउंड महीनों को केवल शिक्षकों को ही उधारा जाएगा। हालांकि, नवीनतम मुद्रण को उधार नहीं दिया जाएगा।',
          conditionOnLoanFour:
            'सदस्यों को पुस्तकालय की पुस्तकों को या तो समय से पहले या समय पर वापस करना चाहिए, विफलता के मामले में पहले 15 दिनों के लिए प्रति दिन प्रति पुस्तक रु. 1.00 वसूला जाएगा, और इसके बाद, प्रति दिन प्रति पुस्तक 2.00 रुपये लिया जाएगा।',
          lossOfBooks: 'पुस्तकों का हानि',
          lossOfBooksDescription:
            'सदस्यों को उनके द्वारा खोई गई पुस्तकों को पुनः स्थानांतरित करना होगा या उन्हें पुस्तक की कीमत का दोगुना देना होगा। यदि खोई गई पुस्तक सेट का हिस्सा है और स्वतंत्र रूप से उपलब्ध नहीं है, तो सदस्यों को पूरे सेट को बदलना होगा या सेट की कीमत का दोगुना देना होगा।',
          careOfBooks: 'पुस्तकों की देखभाल',
          careofBooksDescriptionOne:
            'पुस्तकालय की पुस्तकें केवल वर्तमान ही नहीं, बल्कि पुस्तकालय के भविष्य के सदस्यों के लाभ के लिए हैं। इसलिए, इन्हें पूरी देखभाल और विचारशीलता के साथ संचालित किया जाना चाहिए।',
          careofBooksDescriptionTwo:
            'पुस्तकों का क्षति करना और उन्हें बिगाड़ना काफी आपत्तिजनक है और सदस्यता की प्रिविलेजेज की रद्दी और नई पुस्तक द्वारा नुकसान की प्रतिस्थापना की ओर ले जा सकता है।',
          otherFacilities: 'अन्य सुविधाएं',
          reprographicFacilities: 'रिप्रोग्राफिक सुविधाएं:',
          reprographicFacilitiesDescription:
            'रिप्रोग्राफिक सुविधाएं: पाठकों को रिप्रोग्राफिक सेवाएं प्रदान करने के लिए एक ठेकेदार नियुक्त किया गया है। पुस्तकों, पत्रिकाओं और अन्य सामग्री से प्रतिलिपि प्रस्तुत की जाती है @ 60 पैसे प्रति प्रति।',
          binding: 'बाइंडिंग:',
          bindingDescription:
            'पुस्तकालय के पास अपना बाइंडरी है, जो पुस्तकालय पुस्तकों, और कॉलेज रिपोर्ट्स को बाँधता है और विभिन्न विभागों और संस्थान के अन्य खंडों के लिए बाइंडिंग का कार्य करता है। पुस्तकालय को कटाई, सिलाई, घुटने करने, स्पायरल बाइंडिंग और लेमिनेशन मशीनों से सम्पन्न किया गया है।',
        },
      },
    },

    CentralWorkshop: {},
    CentreOfComputingAndNetworking: {},
    ElectricalMaintenance: {},
    Estate: {},
    GeneralAdministration: {},
    HealthCentre: {},
    Security: {},
    Sports: {},
    Store: {},
  },
  Status: {
    NoResult: {
      title: '404',
      description: 'आपके दिए गए प्रश्न से कोई परिणाम मेल नहीं खाता।',
    },
    Unauthorised: {
      title: '403',
      description: 'अनुमति नहीं है।',
    },
    WorkInProgress: {
      title: '501',
      description: 'कार्य प्रगति पर है।',
    },
    NotAcceptable: {
      title: '406',
      description: 'अस्वीकार्य दुबारा प्रयास करें।',
    },
  },
  patentsandtechnology: {
    title: 'पेटेंट और प्रौद्योगिकी',

    no: 'संख्या',
    appno: 'आवेदन संख्या',
    patno: 'पेटेंट संख्या',
    techTitle: 'प्रौद्योगिकी / आविष्कार शीर्षक',
    inventor: 'आविष्कारक',

    patents: [
      {
        id: '1',
        application_number: '2269/DEL/2012',
        patent_number: '320045',
        title: 'बुद्धिमान इंडक्शन हार्डनिंग डिवाइस और उसकी विधि',
        inventors: [
          {
            facultyId: 'jitender_kumar_chhabra_1',
            name: 'जितेन्द्र कुमार छाबड़ा',
          },
        ],
      },
      {
        id: '2',
        application_number: '2269/DEL/2012',
        patent_number: '320045',
        title:
          'कंक्रीट के परिरक्षण प्रभाव से इनडोर वातावरण में रेडियोधर्मी गैस के प्रसार को रोकने की विधि',
        inventors: [
          {
            facultyId: 'jitender_kumar_chhabra_2',
            name: 'जितेन्द्र कुमार छाबड़ा',
          },
        ],
      },
      {
        id: '3',
        application_number: '2269/DEL/2012',
        patent_number: '320045',
        title: 'वायुमंडलीय वायु से जल निकालने की प्रणाली',
        inventors: [
          {
            facultyId: 'jitender_kumar_chhabra_3',
            name: 'जितेन्द्र कुमार छाबड़ा',
          },
        ],
      },
      {
        id: '4',
        application_number: '2269/DEL/2012',
        patent_number: '320045',
        title: 'वायुमंडलीय वायु से जल निकालने की प्रणाली',
        inventors: [
          {
            facultyId: 'jitender_kumar_chhabra_4',
            name: 'जितेन्द्र कुमार छाबड़ा',
          },
        ],
      },
      {
        id: '5',
        application_number: '2269/DEL/2012',
        patent_number: '320045',
        title: 'वायुमंडलीय वायु से जल निकालने की प्रणाली',
        inventors: [
          {
            facultyId: 'jitender_kumar_chhabra_5',
            name: 'जितेन्द्र कुमार छाबड़ा',
          },
        ],
      },
      {
        id: '6',
        application_number: '2269/DEL/2012',
        patent_number: '320045',
        title: 'वायुमंडलीय वायु से जल निकालने की प्रणाली',
        inventors: [
          {
            facultyId: 'jitender_kumar_chhabra_6',
            name: 'जितेन्द्र कुमार छाबड़ा',
          },
        ],
      },
    ],
  },
  StudentActivities: {
    title: 'छात्र गतिविधियाँ',
    headings: {
      clubs: 'संघठनें',
      council: 'छात्र परिषद',
      events: 'आयोजनाएँ',
      thoughtLab: 'विचार प्रयोगशाला',
      nss: 'एनएसएस',
      ncc: 'एनसीसी',
    },
    sections: { clubs: { title: 'संघठनें', more: 'सभी संघठनो को तलाशें' } },
  },
  DirectorMessage: {
    title: 'निदेशक महोदय का संदेश',
    message: [
      `साधकों की भूमि भारत, 1100 वर्षो की अधीनता, युद्ध, अनुबंध और अपमान के बाद फिर से विश्व गुरु बनने के कगार पर है । हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण यह फिर से एक स्वतंत्र देश है और इसने पिछले 75 वर्षो से अपनी समृद्ध विविधता, संस्कृतियों , भाषाओं के साथ राष्ट्र के निर्माण की चुनौतियों के बीच लंबे समय से खड़े होने की कला सीखी है । हमारे राष्ट्र को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता हमारा मंत्र है ।`,
      `कुरुक्षेत्र की भूमि को धर्म क्षेत्र के रूप में भी जाना जाता है, जिसने हमें अपने आचरण में धर्मी होना, मूल्यों को बनाए रखना, स्वयं को या कमजोर विषयों पर किसी भी हमले को रोकने के लिए आत्म – मजबूत बनाना सिखाया है । भगवद्‌ गीता का दिव्य संदेश हमें समग्र व्यक्तित्व का 360 डिग्री विकास प्राप्त करना सिखाता है और हमारे सभी संदेहों, दुर्दशाओं को दूर करने का प्रयास करता है और हमें खोजने, स्वयं और भौतिक दुनिया को तलाशने के लिए मार्गदर्शन करता है ।`,
      `सदियों से बिना किसी संदेह के यह साबित हो गया है कि कोई भी राष्ट्र अपनी प्रजा को शिक्षित किए बिना कभी भी विश्व नेता या खुशहाल राष्ट्‌ के कद तक नहीं बढ़ा है। विश्वविद्यालयों और उत्कृष्टता केंद्रों की भूमिका कभी सवालों के घेरे में नहीं थी। रचनात्मकता, नवीनता और व्यावहारिक अनुभव को महत्व दिया गया और प्रकृति ब्रह्मांड के रहस्यों को जानने की प्रायोगिक प्रयोगशाला थी। नालंदा और तक्षशिला के रूप में विश्वविद्यालय अंतर्राष्ट्रीय स्तर के शिक्षा केंद्रों के कद तक बढ़ गए, जो कि 64 कला रूपों के रूप में जाने जाने वाले विभिन्‍न प्रकार की गतिविधियों में खुद को तलाशने और प्रकृति के रहस्यों को उजागर करने के लिए युवा दिमाग का पोषण करते रहे | उन्होंने सस्वर पाठ, अनुभव और अनुभवात्मक शिक्षा के माध्यम से कौशल का पता लगाया । प्रसिद्ध गुरु शिष्य परम्परा युगों और पीढ़ियों से चली आ रही थी ।`,
      `तक्षशिला विश्वविद्यालय कभी न खत्म होने वाले लिपियों के संग्रह के कारण ही प्रसिद्ध नहीं था बल्कि यह मौजूद ज्ञान के कारण प्रसिद्ध था कि इंसान कैसे सबसे अच्छा काम कर सकता है । हमारी जाति के पास बुद्धि का उपयोग करने का ज्ञान है।`,
      `भारत और एनआईटी क्रुक्षेत्र जैसे महान राष्ट्‌ के लिए राष्ट्रीय स्तर के परीक्षण के माध्यम से चयन की कठोर प्रक्रिया के माध्यम से देश भर से चयनित हुए युवा दिमाग की क्षमता का दोहन करने के लिए सही विधि क्‍या हो सकती है । ये युवा लड़के और लड़कियां सीखने के इन मचों तक पहुंचने के लिए वास्तव में कठिन परिश्रम करते हैं । यह हमारा प्रयास है कि हम शिक्षण, सीखने का सही वातावरण प्रदान करें और उन्हें न केवल आगे बढ़ने वाली प्रौद्योगिकियों को स्वयं और प्रगति का पता लगाने की अनुमति दें बल्कि कई सामाजिक समस्याओं को हल करने और सेट करने में मार्गदर्शक शक्ति बनने के लिए रचनात्मकता और नवीन लक्षणों के अपने जन्मजात कौशल को बढ़ावा दें । एक ऐसा उदाहरण प्रस्तुत कर दें कि विश्वविद्यालय और उत्कृष्टता केंद्र अकेले ज्ञान की स्थापना के लिए अलग स्थान न बन जाए बल्कि स्टार्ट-अप संस्कृति और उद्यमशीलता की मानसिकता को बढ़ावा देकर राष्ट्‌ के विकास में योगदान कर सकें। इस दिशा में , एनआईटी कुरुक्षेत्र इन युवा दिमागों को एनआईटी कुरुक्षेत्र – स्थानीय समुदाय लिंक के माध्यम से जोड़कर अनुभवात्मक सीखने को बढ़ावा देते हुए महत्वपूर्ण सोच, पूछताछ, बहस और चर्चा के लिए सेटिंग बदलने और रटने की गति को समाप्त करेगा। कोई भी शिक्षा पूर्ण नहीं है, यदि विद्वान ज्ञान की ओर ले जाने वाले तथा ज्ञान को प्राप्त करने के लिए सीखने के स्तर से आगे बढ़ने में असमर्थ है ।`,
      `पिछले दो वर्षों में, महामारी के समय में , पूरी दुनिया में कई लोगों की जान गंवाई, आजीविका खो दी, राष्ट्रों को विकास की कमी का सामना करना पड़ा और इस तरह के परीक्षण के समय की चुनौतियों ने कई लोगों को अवसाद, चिंता, आत्महत्या की प्रवृत्ति, प्रिय की हानि आदि का कारण बना दिया । हम अभी भी महामारी से निपटने के लिए जूझ रहे हैं और वर्चुअल प्लेटफॉर्म पर ऑर्डर की समानता लाने का बीड़ा उठाया है । कुछ कठिन सबक सीखे गए हैं और शिक्षा क्षेत्र सबसे अधिक प्रभावित क्षेत्रों में से एक है, जहां युवा दिमाग शारीरिक,मानसिक, भावनात्मक और आध्यात्मिक रूप से अस्थिर थे । मानवीय उत्कृष्टता प्राप्त करने में इन सहज गुणों का पता लगाने का समय आ गया है ।`,
      `पुराने १६९ में से एक के निदेशक का पदभार ग्रहण करने के बाद, अब 05 फरवरी, 2022 (बसंत पंचमी) को राष्ट्रीय महत्व के संस्थान की स्थिति के साथ एनआईटी के रूप में परिवर्तित हुआ, मैं अपने शिक्षण, गैर-शिक्षण संकाय और सहायक कर्मचारियों के साथ आपका स्वागत करता हूं और हम ऑनलाइन शिक्षण, सीखने आदि के माध्यम से दो साल के अलगाबव के बाद प्रिय छात्रों के परिसर में आने के लिए बेसब्री से इंतजार करते हुए, स्वागत करने के लिए पूरी तरह से तैयार है। नेता के रूप में मैं आपको विश्वास दिलाता हूं कि घर के अनुरूप माहौल बनाकर, अपने आप को तलाशने के लिए घर से अधिक जगह बनाकर, खुद को तलाशने के लिए सुविधाएं और भौतिक प्रगति प्रदान करके, आपको बड़े सपने देखने की अनुमति देकर लाड्-प्यार करूंगा । मैं व्यक्तिगत रूप से कामना करता हूं कि आप में से प्रत्येक जीवन के प्रति जुनूनी बनें और टेक्नोक्रेट, व्यवसायी , विश्व नेताओं आदि के रूप में बड़े पैमाने पर समाज की सेवा करें। मैं विश्वास दिलाता हूं कि राष्ट्रीय शिक्षा नीति 2020 (एनईपी 2020) का कार्यान्वयन सर्वोच्च प्राथमिकता होगी ।`,
      `एनआईटी क्रुक्षेत्र के लोगो में एक आदर्श वाक्य है जो इस प्रकार है`,
      `"श्रमोऽनवरत चेष्टा च"`,
      `जिसका अर्थ है कड़ी मेहनत और लगातार प्रयास उत्कृष्टता की ओर ले जाते हैं ।`,
      `मैं सभी छात्र उम्मीदवारों को एनआईटी क्रुक्षेत्र के प्रांगण में प्रवेश करने के लिए बधाई देता हूं और एनआईटी क््‌रुक्षेत्र के सभी परिवार के सदस्यों को उनके सभी प्रयासों में सफलता की कामना करता हूं । मैं लगभग दो साल के लॉकडाउन जैसी स्थिति के बाद आपका स्वागत करने का बेसब्री से इंतजार कर रहा हूं, जिसमें तीन सौ एकड़ के विशाल परिसर में एक साथ आनंद और मस्ती का आनंद लिया जा रहा है। मैं अपने प्यारे छात्रों के सभी माता-पिता को विश्वास दिलाता हूं कि आपके बच्चे सुरक्षित हाथों में हैं, उनके साथ यथासंभव प्यार और उनकी देखभाल की जाएगी ।`,
      `जय हिन्द…………`,
      `प्रो. बी. वी. रमना रेड्डी`,
    ],
  },
};

export default text;
