import type { Translations } from './translations';

const text: Translations = {
  Main: {
    director: {
      alt: 'डा. बी. वी. रमणा रेड्डी',
      title: 'निर्देशक का कोना',
      name: 'डा. बी. वी. रमणा रेड्डी',
      quote: [
        `भारत, साधकों की भूमि, ११०० वर्षों की पराधीनता, युद्ध, विलय और अपमान के बाद फिर से विश्व गुरु बन्ने
      के शिखर पर है। हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण ७५ वर्षों से यह फिर से एक स्वतंत्र
      देश है और इसने अपनी समृद्ध विविधता, संस्कृतियों, भाषाओं के साथ राष्ट्र के निर्माण की कई चुनौतियों के बीच
      खड़े होने की कला सीख ली है। देश को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता ही हमारा मंत्र है।`,
        'मैं इस संस्था की वेबसाइट पर आने वाले सभी लोगों का हृदय से स्वागत करता हूं।',
      ],
      more: 'और पढ़ें',
    },
  },

  Clubs: { title: 'संघठनें' },
  Committee: {
    building: 'निर्माण एवं कार्य समिति',
    financial: 'वित्तीय समिति',
    governor: 'राज्यपाल मंडल',
    members: {
      title: 'सदस्य',
      serial: 'क्रम संख्या',
      nomination: 'नामांकन',
      name: 'नाम',
      servingAs: 'के रूप में सेवारत',
    },
    meetings: {
      title: 'बैठकें',
      serial: 'बैठक संख्या',
      date: 'दिनांक',
      place: 'स्थान',
      agenda: 'कार्यसूची',
      minutes: 'विवरण',
    },
  },
  Curricula: {
    pageTitle: 'पाठ्यक्रम',
    code: 'कोड',
    title: 'शीर्षक',
    major: 'क्रमादेश',
    credits: 'एल-टी-पी',
    totalCredits: 'क्रेडिट्स',
    syllabus: 'पाठ्यक्रम',
  },
  Departments: { title: 'विभाग' },
  Department: {
    headings: {
      about: 'परिचय',
      vision: 'दृष्टि',
      and: 'और',
      mission: 'उद्देश्य',
      hod: {
        title: 'विभागाध्यक्ष का संदेश',
        session: (from: string) => `शैक्षणिक सत्र ${from} - वर्तमान`,
      },
      programmes: {
        title: 'कार्यक्रम',
        undergrad: 'पूर्वस्नातक',
        postgrad: 'स्नातकोत्तर',
        doctorate: 'डॉक्टरेट',
      },
      gallery: 'चित्र',
    },
    facultyAndStaff: 'संकाय और कर्मचारी',
    laboratories: 'प्रयोगशालाएँ',
    achievements: 'छात्र उपलब्धियाँ',
  },
  FacultyAndStaff: {
    placeholder: 'नाम या ईमेल से खोजें',
    departmentHead: 'विभागाध्यक्ष',
  },
  FAQ: { title: 'अक्सर पूछे जाने वाले प्रश्न' },
  Footer: {
    logo: 'प्रतीक चिन्ह',
    nit: 'राष्ट्रीय प्रौद्योगिकी संस्थान, कुरूक्षेत्र',
    location: 'थानेसर, हरियाणा, भारत १३६११९',
    design: 'कलाकृति',
    headings: ['त्वरित संदर्भ', 'त्वरित संदर्भ', 'त्वरित संदर्भ'],
    lorem: 'लोरेम इप्सम',
    copyright:
      '© २०२४ राष्ट्रीय प्रौद्योगिकी संस्थान कुरूक्षेत्र। सर्वाधिकार आरक्षित।',
  },
  Forms: { title: 'फॉर्म्स' },
  Header: {
    institute: 'संस्थान',
    academics: 'शैक्षिक',
    faculty: 'संकाय और कर्मचारी',
    placement: 'प्रशिक्षण एवं नियुक्ति',
    activities: 'छात्र गतिविधियाँ',
    alumni: 'भूतपूर्व छात्र',
    logo: 'प्रतीक चिन्ह',
    search: 'त्वरित खोज...',
    login: 'प्रवेश',
    profile: { alt: 'मेरी छवि', view: 'विवरण देखें' },
  },
  Login: {
    title: 'प्रवेश करें',
    enterEmail: 'अपना ईमेल दर्ज करें',
    continueButton: 'अगले चरण पर बढ़ें (तैयार नहीं)',
    signInWithGoogle: 'गूगल द्वारा प्रवेश करें',
  },
  Notifications: {
    title: 'सूचनाएँ',
    categories: {
      academic: 'शैक्षणिक',
      tender: 'निविदाएँ',
      workshop: 'कार्यशालाएं',
      recruitment: 'नियुक्ति',
    },
    viewAll: 'सारा देखें',
  },
  NotFound: {
    title: 'नहीं मिला',
    description: 'अनुरोधित संसाधन नहीं मिल सका',
    backHome: 'घर लौटें',
  },
  Profile: {
    tabs: {
      personal: {
        title: 'व्यक्तिगत विवरण',
        basic: {
          title: 'मूलभूत',
          name: 'नाम',
          rollNumber: 'रोल संख्या',
          sex: 'लिंग',
          dateOfBirth: 'जन्मदिन',
        },
        contact: {
          title: 'संपर्क',
          email: 'संस्थान ईमेल',
          personalEmail: 'व्यक्तिगत ईमेल',
          telephone: 'टेलीफ़ोन',
          alternateTelephone: 'वैकल्पिक टेलीफ़ोन',
        },
        institute: {
          title: 'संस्था',
          degree: 'उपाधि',
          major: 'क्रमादेश',
          currentSemester: 'मौजूदा छमाही',
          section: 'अनुभाग',
        },
        admission: {
          title: 'प्रवेश',
          applicationNumber: 'प्रवेश संख्या',
          candidateCategory: 'उम्मीदवार श्रेणी',
          admissionCategory: 'प्रवेश श्रेणी',
          admissionSubcategory: 'प्रवेश उपश्रेणी',
          dateOfAdmission: 'प्रवेश की तिथि',
        },
        guardians: {
          title: 'अभिभावक',
          father: 'पिता',
          mother: 'माता',
          local: 'स्थानीय संरक्षक',
          name: 'नाम',
          telephone: 'टेलीफ़ोन',
          email: 'ईमेल',
        },
        address: {
          title: 'पता',
          permanent: 'स्थायी पता',
          pinCode: 'पिन कोड',
        },
      },
      notifications: { title: 'सूचनाएँ' },
      courses: { title: 'पाठ्यक्रम' },
      clubs: { title: 'संघठन' },
      results: { title: 'परिणाम और विस्तृत अंक प्रमाण पत्र' },
      bookmarks: { title: 'बुकमार्क्स' },
      quickSend: { title: 'त्वरित प्रेषण' },
    },
    logout: 'प्रस्थान करें',
  },
  Search: {
    placeholder: 'त्वरित खोज...',
    categories: {
      allResults: 'सभी परिणाम',
      webPages: 'वेब पृष्ठ',
      people: 'लोग',
      documents: 'दस्तावेज़',
      events: 'आयोजन',
      news: 'समाचार',
      courses: 'पाठ्यक्रम',
      clubs: 'क्लब',
      positions: 'पद',
    },
    viewAll: 'सारा देखें',
    default: {
      recents: 'ताज़ा खोजें',
      clearRecents: 'हाल की खोजें साफ़ करें',
      mostSearched: 'एनआईटी की सर्वाधिक खोजें',
      studentLinks: {
        title: 'छात्र संबंधित त्वरित लिंक',
        clubs: 'संघठनें',
        courses: 'पाठ्यक्रम',
        departments: 'विभाग',
        notifications: 'सूचनाएँ',
        results: 'परिणाम',
      },
      facultyLinks: {
        title: 'संकाय संबंधित त्वरित लिंक',
        notifications: 'सूचनाएँ',
        profile: 'मेरा विवरण',
      },
    },
  },
  Section: {
    about: 'परिचय',
    gallery: 'चित्र',

    Account: {},
    CentralLibrary: {},
    CentralWorkshop: {},
    CentreOfComputingAndNetworking: {},
    ElectricalMaintenance: {},
    Estate: {},
    GeneralAdministration: {},
    HealthCentre: {
      name: 'स्वास्थ्य केंद्र',
      headings: {
        about: 'के बारे में',
        staff: 'कर्मचारी',
        timings: 'समय',
        facilities: 'सुविधाएँ',
        aboutText:
          'कैंपस आबादी जिसमें छात्र, स्टाफ सदस्य और उनके परिवार के सदस्य शामिल हैं, की बहुपेक्षावाला चिकित्सा आवश्यकताओं को संतुलित करने के लिए संस्थानिक स्वास्थ्य केंद्र द्वारा पूरा किया जाता है। स्वास्थ्य केंद्र का मुख्य हैड (हॉस्पिटल सेवाएं) एक समूह के साथ है, जिसमें चिकित्सा अधिकारियों और पैरा चिकित्सा कर्मचारियों की टीम है। निदेशक ने संस्थान की हॉस्पिटल सलाहकार समिति की भी गठन की है, जिसमें उनके द्वारा नामित एक अध्यक्ष और सदस्यों का चयन किया गया है जो संस्थान के अन्य मान्यता प्राप्त निकायों से आएँ हैं, साथ ही हेड (हॉस्पिटल सेवाएं) समिति के सदस्य सचिव।',
        staffText: 'कर्मचारी सदस्य',
        insurance: 'चिकित्सा बीमा',
        immunization: 'टीकाकरण',
      },
      facilities: {
        counsellor: 'परामर्शक सेवाएँ',
        immunization: 'टीकाकरण',
        hospitals: 'अस्पताल और प्रयोगशालाएं वाट',
        insurance: 'मेडिकल इन्श्योरेंस',
        ambulance1: `  एम्बुलेंस सुविधा: स्वास्थ्य केंद्र के पास प्रतिदिन 24 घंटे उपलब्ध एम्बुलेंस वाहन का समर्थन है, जो उपचार के लिए संस्थान स्वास्थ्य केंद्र से स्थानीय सरकारी अस्पताल / एम्पैनल्ड अस्पताल / सरकारी चिकित्सा संस्थान तक मरीजों के परिवहन के लिए उपयुक्त प्रबंधन के लिए है:`,
        ambulance2: `- छात्र, स्टाफ और उनके आश्रितों के लिए एम्बुलेंस सेवाएं स्वास्थ्य संस्थान के एसएमओ / एमओ द्वारा सरकार / एम्पैनल्ड अस्पतालों में उपचार के लिए रेफर किए जाने पर मुफ्त में प्रदान की जाती है। आंतरिक मामलों में एम्बुलेंस केवल आंतरिक मामलों में अनुमति दी जाती है। इसके अलावा, एम्बुलेंस का फॉलो अप के लिए अनुमति नहीं है।`,
        ambulance3:
          '- स्वास्थ्य संस्थान के कर्मचारियों की पत्नियों और आश्रितों के लिए एम्बुलेंस सेवाएं सरकारी / एम्पैनल्ड अस्पतालों के लिए डिलीवरी के उद्देश्य से मुफ्त में प्रदान की जाती है। एम्बुलेंस सेवाएं अस्पताल से संस्थान कैंपस तक मृत शव को ले जाने के लिए मुफ्त में प्रदान की जाती हैं। एसएमओ / एमओ के अनुपस्थिति में एम्बुलेंस के अनुरोध की अनुमति प्रोफेसर I / c (स्वास्थ्य केंद्र) द्वारा दी जाएगी।',
        ambulanceTel: `एम्बुलेंस टेल: +91-9467844800`,
        opd: `ओपीडी: ओपीडी में, रोगियों को नॉलेज दिया जाता है और आवश्यक मामलों में प्रयोगशाला परीक्षण की सलाह दी जाती है।`,
        dental: `डेंटल सुविधा: एक अनुभवी डेंटल सर्जन डेंटल निकालन, आरसीटी, स्केलिंग / सफाई, भरना आदि जैसी प्रक्रियाएँ प्रदान करता है।`,
        lab: `प्रयोगशाला सेवाएँ: संस्थान स्वास्थ्य केंद्र पर नियमित जांच कार्यक्रम किए जाते हैं। एक पैथोलॉजिकल लैब का पंजीकरण किया गया है जो विशेषज्ञ परीक्षणों को संचालित करने के लिए है। माइक्रोबायोलॉजी परीक्षण को बाहर संदर्भित किया जाता है।`,
        pharmacy: `फार्मेसी: शिक्षक, गैर-शिक्षक कर्मचारियों, उनके आश्रितों और छात्रों के लिए नियमित दवाएँ उपलब्ध हैं। दवाएँ एसएमओ / एमओ, स्वास्थ्य केंद्र की पर्ची पर डिस्पेंस की जाती हैं।`,
        radiology: `रेडियोलॉजी / एक्स-रे सुविधा: डिजिटल एक्स-रे एसएमओ / एमओ, स्वास्थ्य केंद्र की पर्ची पर या परीक्षण समय के दौरान किए जाते हैं। (9:00 बजे से 1:00 बजे तक) और (3:00 बजे से 5:30 बजे तक)।`,
        ecg: `ईसीजी सेवाएँ: कम्प्यूटरीकृत ईसीजी सेवाएं स्वास्थ्य केंद्र में आपके ओपीडी के समय में उपलब्ध हैं। (9:00 बजे से 1:00 बजे तक) और (3:00 बजे से 5:30 बजे तक)।`,
        casualty1: `कैजुअल्टी / ट्रियाज: 08 बिस्तरों (04 बिस्तर महिला वार्ड में और 04 बिस्तर पुरुष वार्ड में) के साथ एक सुसज्जित कैजुअल्टी आपातकालीन मामलों के लिए उपलब्ध है। टाइफाइड, एक्यूट गैस्ट्रोएंटेराइटिस, सीओपीडी, ब्रोंकियल अस्थमा मलेरिया, डिस्मेनोरिया, एक्यूट कोलिक आदि जैसी विभिन्न बीमारियों का इलाज दिया जाता है।`,
        casualty2: `कैजुअल्टी / ट्रियाज: 08 बिस्तरों (04 बिस्तर महिला वार्ड में और 04 बिस्तर पुरुष वार्ड में) के साथ एक सुसज्जित कैजुअल्टी आपातकालीन मामलों के लिए उपलब्ध है। टाइफाइड, एक्यूट गैस्ट्रोएंटेराइटिस, सीओपीडी, ब्रोंकियल अस्थमा मलेरिया, डिस्मेनोरिया, एक्यूट कोलिक आदि जैसी विभिन्न बीमारियों का इलाज दिया जाता है।`,
      },
      staff: {
        sr: 'क्रम संख्या',
        name: 'नाम',
        designation: 'पदनाम',
        phone: 'फ़ोन',
        officers: 'चिकित्सा अधिकारी',
        other: 'चिकित्सा कर्मचारी',
      },
      timings: {
        day: 'दिन',
        from: 'से',
        to: 'तक',
        tod: 'दिन का समय',
      },
      hospitals: {
        sr: 'क्रमांक',
        name: 'अस्पताल का नाम',
        field: 'विशेषज्ञता का क्षेत्र',
        contact: 'संपर्क नंबर',
      },
      insurance: {
        text: 'वर्तमान में, जिन कर्मचारियों ने चिकित्सा बीमा का विकल्प चुना है, उन्हें गंभीर बीमारी के लिए प्रति वर्ष 5 लाख रुपये का कवर मिलता है। इसी प्रकार, छात्रों के पास अब तक प्रति वर्ष 1 लाख रुपये का चिकित्सा बीमा कवर है।',
        link: 'कैशलेस चिकित्सा बीमा योजना का उपयोग करने के लिए यहां क्लिक करें:',
        text2:
          '(उपयोगकर्ता नाम: NITK<कर्मचारी आईडी या छात्र रोल नंबर>, पासवर्ड: NITK<कर्मचारी आईडी या छात्र रोल नंबर>)',
      },
      immunization: {
        text1:
          'टीकाकरण विश्व स्वास्थ्य संगठन (WHO) के टीकाकरण अनुसूची के अनुसार जिला अस्पताल स्टाफ द्वारा हर महीने के पहले गुरुवार को NIT स्वास्थ्य केंद्र में प्रदान किया जाता है।',
        timings: 'समय: सुबह 10:00 बजे से दोपहर 02:00 बजे तक।',
        text2:
          'पल्स पोलियो कार्यक्रम: पल्स पोलियो कार्यक्रम समय-समय पर राज्य सरकार द्वारा संस्थान स्वास्थ्य केंद्र में आयोजित किया जाता है।',
        text3:
          '*नोट: NIT स्वास्थ्य केंद्र का बाहरी टीकाकरण स्टाफ या उनके कार्यक्रम पर सीधे कोई नियंत्रण नहीं है, जो जिला अस्पताल के CMO के निर्देशानुसार बदल सकता है।',
        schedule: 'बच्चों के लिए टीकाकरण अनुसूची',
      },
    },
    Security: {},
    Sports: {},
    Store: {},
  },
  StudentActivities: {
    title: 'छात्र गतिविधियाँ',
    headings: {
      clubs: 'संघठनें',
      council: 'छात्र परिषद',
      events: 'आयोजनाएँ',
      thoughtLab: 'विचार प्रयोगशाला',
      nss: 'एनएसएस',
      ncc: 'एनसीसी',
    },
    sections: { clubs: { title: 'संघठनें', more: 'सभी संघठनो को तलाशें' } },
  },
  Unauthorised: {
    title: 'अनधिकृत',
    description: 'आप इस पृष्ठ को देखने के लिए अधिकृत नहीं हैं।',
  },
  WorkInProgress: {
    title: 'कार्य प्रगति पर है',
    description: 'इस पेज पर अभी काम चल रहा है. कृपया दूसरी बार आएं',
  },
};

export default text;
