import type { Translations } from './translations';

const text: Translations = {
  Awards: {
    aboutTitle: 'के बारे में',
    descriptionTitle: 'विवरण',
    criterionTitle: 'मानदंड',
    awards: [
      {
        title: 'सर्वश्रेष्ठ सर्वांगीण पुरस्कार',
        about:
          'संस्थान से स्नातक होने वाले B.Tech. छात्र इस पुरस्कार को पूरा कर सकते हैं जिसमें एक प्रमाणपत्र, नकद पुरस्कार और विजेता के नाम का उल्लेख सम्मान सूची में होता है। छात्रों का चयन उनके अध्ययन और संस्थान में रहने की पूरी अवधि के दौरान की गई अतिरिक्त गतिविधियों के आधार पर किया जाता है।',
        description:
          'उपरोक्त में से अंक घटाए जाएंगे यदि उम्मीदवार के अनुशासनहीनता के मामले पाए जाते हैं। जिन छात्रों को बड़े अनुशासनहीनता के लिए दंडित किया गया है, उन्हें (a) से (e) तक के उपरोक्त अंकों के लिए योग्य नहीं माना जाएगा। उदाहरण के लिए, यदि किसी छात्र को किसी अवधि के लिए संस्थान से निष्कासित कर दिया गया है तो उसे उप-शीर्षक (a) से (e) में शून्य अंक दिए जाएंगे। यदि किसी उम्मीदवार का किसी भी शीर्षक (a) से (e) में स्कोर 40% से कम है, तो उसे उप-शीर्षक के अंतर्गत शून्य अंक दिए जाएंगे।',
        criterion: [
          'सर्वश्रेष्ठ खिलाड़ी ट्रॉफी प्रदान करने के लिए, उम्मीदवारों को निम्नानुसार अंक प्रदान किए जाएंगे:',
          'इंटर स्टेट (राष्ट्रीय सीनियर) 9 अंक',
          'इंटर स्टेट (राष्ट्रीय जूनियर) 7 अंक',
          'इंटर यूनिवर्सिटी 5 अंक',
          'इंटर डिस्ट्रिक्ट (राष्ट्रीय सीनियर) 4 अंक',
          'इंटर डिस्ट्रिक्ट (राष्ट्रीय जूनियर) 3 अंक',
        ],
      },
      {
        title: 'सर्वश्रेष्ठ खिलाड़ी ट्रॉफी',
        about:
          'B.Tech. के उन छात्रों को, जो सेमेस्टर परीक्षा में सर्वोच्च अंक प्राप्त करते हैं, उन्हें तकनीकी पुस्तकों के रूप में रु. 2501 के पुरस्कार दिए जाते हैं। अंतिम वर्ष के बाहर जाने वाले छात्रों को यह राशि नकद में दी जाती है। द्वितीय सर्वश्रेष्ठ खिलाड़ी पुरस्कार के लिए रु. 2001 का नकद पुरस्कार और एक ट्रॉफी देने का भी प्रावधान है।',
        description:
          'उपरोक्त में से अंक घटाए जाएंगे यदि उम्मीदवार के अनुशासनहीनता के मामले पाए जाते हैं। जिन छात्रों को बड़े अनुशासनहीनता के लिए दंडित किया गया है, उन्हें (a) से (e) तक के उपरोक्त अंकों के लिए योग्य नहीं माना जाएगा। उदाहरण के लिए, यदि किसी छात्र को किसी अवधि के लिए संस्थान से निष्कासित कर दिया गया है तो उसे उप-शीर्षक (a) से (e) में शून्य अंक दिए जाएंगे। यदि किसी उम्मीदवार का किसी भी शीर्षक (a) से (e) में स्कोर 40% से कम है, तो उसे उप-शीर्षक के अंतर्गत शून्य अंक दिए जाएंगे।',
        criterion: [
          'सर्वश्रेष्ठ खिलाड़ी ट्रॉफी प्रदान करने के लिए, उम्मीदवारों को निम्नानुसार अंक प्रदान किए जाएंगे:',
          'इंटर स्टेट (राष्ट्रीय सीनियर) 9 अंक',
          'इंटर स्टेट (राष्ट्रीय जूनियर) 7 अंक',
          'इंटर यूनिवर्सिटी 5 अंक',
          'इंटर डिस्ट्रिक्ट (राष्ट्रीय सीनियर) 4 अंक',
          'इंटर डिस्ट्रिक्ट (राष्ट्रीय जूनियर) 3 अंक',
        ],
      },
      {
        title: 'सामान्य फिटनेस और व्यावसायिक योग्यता अंक',
        about:
          'वर्ष 1989-90 से वर्ष के सर्वश्रेष्ठ तकनीकी कार्य मॉडल के लिए रु. 50001 का पुरस्कार स्थापित किया गया है। संस्थान के सभी छात्र इस पुरस्कार के लिए आवेदन करने के पात्र हैं।',
      },
      {
        title: 'सर्वश्रेष्ठ खिलाड़ी ट्रॉफी',
        about:
          'छात्रों को अपनी व्यक्तित्व को पूर्ण रूप से विकसित करने के लिए खेल, सह-पाठयक्रम गतिविधियों और सामाजिक सेवा को सक्रिय रूप से अपनाने के लिए प्रोत्साहित किया जाता है। इन क्षेत्रों में उनकी उपलब्धियों को सामान्य फिटनेस और व्यावसायिक योग्यता में प्राप्त अंकों में प्रतिबिंबित किया जाता है। बी.टेक. डिग्री पाठ्यक्रम की परीक्षा योजना में इस शीर्षक के तहत पैंसठ अंक आवंटित किए गए हैं।',
        description:
          "उपरोक्त में से अंक घटाए जाएंगे यदि उम्मीदवार के अनुशासनहीनता के मामले पाए जाते हैं। जिन छात्रों को बड़े अनुशासनहीनता के लिए दंडित किया गया है, उन्हें (a) से (e) तक के उपरोक्त अंकों के लिए योग्य नहीं माना जाएगा। उदाहरण के लिए, यदि किसी छात्र को किसी अवधि के लिए संस्थान से निष्कासित कर दिया गया है तो उसे उप-शीर्षक (a) से (e) में शून्य अंक दिए जाएंगे। यदि किसी उम्मीदवार का किसी भी शीर्षक (a) से (e) में स्कोर 40% से कम है, तो उसे उप-शीर्षक के अंतर्गत शून्य अंक दिए जाएंगे। विभिन्न क्षेत्रों में छात्रों की उपलब्धियों के अनुपात में अंक उन्हें अंतिम समग्र मौखिक परीक्षा के समय निदेशक द्वारा प्रदान किए जाएंगे। खेल/क्लब/पत्रिका/NSS/NCC आदि गतिविधियों में प्रतिस्पर्धात्मक उत्कृष्टता का दावा करने वाले छात्र, अपनी गतिविधियों के संबंधित शिक्षक प्रभारी से सत्यापन प्राप्त करने के बाद अंक प्राप्त करने के लिए निदेशक से आवेदन कर सकते हैं। एक समिति जिसमें क्लब के अध्यक्ष, खेल अध्यक्ष, संस्थान पत्रिका के स्टाफ संपादक और NSS के शिक्षक प्रभारी शामिल हैं, छात्रों के दावों की जांच करने और उन्हें अंक प्रदान करने की सिफारिश करने में निदेशक की सहायता करती है। जिन्होंने संस्थान में अपने रहने के दौरान अनुशासनहीनता या अवांछनीय गतिविधियों में भाग लिया है, वे अनुचित आचरण के लिए अपने अपराधों की गंभीरता के सीधे अनुपात में अंक खो देंगे। इस शीर्षक (आचरण) के तहत कोई अंक नहीं दिए जाएंगे जिन्हें संस्थान से 'निष्कासित' किया गया है।",
        criterion: [
          'सर्वश्रेष्ठ खिलाड़ी ट्रॉफी प्रदान करने के लिए, उम्मीदवारों को निम्नानुसार अंक प्रदान किए जाएंगे:',
          'शैक्षणिक रिकॉर्ड 12 अंक',
          'आचरण 12 अंक',
          'इंटर यूनिवर्सिटी 5 अंक',
          'खेल और सह-पाठयक्रम गतिविधियां 20 अंक',
          'सामान्य प्रभाव 15 अंक',
        ],
      },
      {
        title: 'डॉ. आर.पी. सिंह रजत पदक',
        about:
          'स्वर्गीय डॉ. आर.पी. सिंह की स्मृति में रजत पदक, यांत्रिक इंजीनियरिंग में प्रथम, द्वितीय, तृतीय वर्ष के टॉपर्स को प्रदान किया जाएगा।',
      },
      {
        title: 'गुरु हरकृष्ण, शैक्षिक सोसाइटी, चंडीगढ़',
        about:
          'सोसाइटी ने बी.टेक. डिग्री कोर्स के सभी विषयों के समग्र टॉपर के लिए रु. 501/- का पुरस्कार स्थापित किया है।',
      },
      {
        title: 'हरियाणा राज्य औद्योगिक विकास निगम लिमिटेड',
        about:
          'निगम ने सिविल, कंप्यूटर और यांत्रिक इंजीनियरिंग के विषयों में संस्थान में अध्ययनरत हरियाणा के छात्रों के लिए मेरिट-कम-मीन्स छात्रवृत्ति स्थापित की है। छात्रवृत्ति राशि रु. 500/- प्रति माह, दस महीने की अवधि के लिए है।',
      },
      {
        title: 'पदक',
        about:
          'सोने का पदक और रु. 5000/- का नकद पुरस्कार उन छात्रों के लिए है जो एनआईटी कुरुक्षेत्र के उपरोक्त विषयों में अंतिम परीक्षा में प्रथम स्थान प्राप्त करते हैं।',
      },
      {
        title: 'हरियाणा राज्य इलेक्ट्रॉनिक्स विकास निगम लिमिटेड, चंडीगढ़',
        about:
          'निगम ने हरियाणा में संस्थानों के इलेक्ट्रॉनिक्स/कंप्यूटर क्षेत्र में हार्टन गोल्ड, सिल्वर और ब्रॉन्ज पदक स्थापित किए हैं, जो मेरिट प्रमाणपत्र और नकद पुरस्कार रु. 3000/- रु. 2000/- और रु. 1000/- के साथ होते हैं।',
      },
      {
        title: 'श्री श्याम सुंदर धींगरा पदक',
        about:
          '1981-86 बैच (ई) शाखा के छात्र ने स्वर्गीय श्री श्याम सुंदर धींगरा की स्मृति में बी.टेक. सीई शाखा के टॉप रैंकर को रु. 5000/- का नकद पुरस्कार और पदक प्रदान किया है, जो 2003 से प्रभावी है।',
      },
    ],
  },
  Administration: {
    title: 'प्रशासन',
    boardOfGovernors: 'बोर्ड ऑफ डायरेक्टर्स',
    constitutionOfBoG: 'बोर्ड ऑफ डायरेक्टर्स का गठन',
    bogAgenda: 'बोर्ड ऑफ डायरेक्टर्स का एजेंडा',
    bogMinutes: 'बोर्ड ऑफ डायरेक्टर्स की कार्यवाही',
    buildingAndWork: 'बिल्डिंग और कार्य समिति',
    financial: 'वित्तीय समिति',
    senate: 'सीनेट',
    composition: 'संयोजन',
    sNo: 'क्रमांक',
    name: 'नाम',
    servedAs: 'के रूप में सेवा की',
    senateMeetingAgenda: 'सीनेट मीटिंग का एजेंडा',
    senateMeetingMinutes: 'सीनेट मीटिंग की कार्यवाही',
    scsaMeetingMinutes: 'एससीएसए मीटिंग की कार्यवाही',
    administrationHeads: 'प्रशासनिक प्रमुख',
    director: 'निर्देशक',
    deans: 'डीन्स',
    otherOfficers: 'अन्य अधिकारी',
    committees: 'समितियाँ',
    actsAndStatutes: 'NIT कानून और विधान',
    actsPoints: [
      'NIT अधिनियम 2007',
      'NIT अधिनियम (संशोधन) 2012',
      'NIT अधिनियम संशोधन राजपत्र अधिसूचना 2012',
      'NIT अधिनियम 2007 के तहत प्रथम उपविधान',
    ],
    and: 'और',
    description:
      'हमारा विभाग विभिन्न कार्यक्रम प्रदान करता है और उल्लेखनीय रूप से विकसित हुआ है, अत्याधुनिक सुविधाओं से युक्त प्रयोगशालाओं का आधुनिकीकरण किया गया है, पाठ्यक्रम को उद्योग की आवश्यकताओं के अनुरूप ढाला गया है, छात्र प्लेसमेंट को बेहतर बनाया गया है, और संकाय अनुसंधान को प्रोत्साहित किया गया है।  संकाय हार्डवेयर डिज़ाइन, मॉडलिंग, और एल्गोरिदम विकास में उत्कृष्टता प्राप्त करता है, विशेष रूप से डेटा संचार, वायरलेस नेटवर्क, सिग्नल प्रोसेसिंग, और VLSI डिज़ाइन के क्षेत्रों में। मजबूत बुनियादी ढांचे और अच्छी तरह से सुसज्जित कंप्यूटर केंद्रों के साथ, हम यूजी, पीजी, और पीएचडी कार्यक्रमों का समर्थन करते हैं, और छात्रों, संकाय, और स्टाफ को व्यापक संसाधन प्रदान करते हैं।',
    approvalHeading: 'एमएचआरडी-भारत सरकार/बीओजी की स्वीकृति',
    approvalDescription:
      'एमएचआरडी (अब एमओई) और/या भारत सरकार (जीओआई) से प्राप्त विभिन्न स्वीकृतियाँ (क्षेत्रीय अभियांत्रिकी कॉलेज (आरईसी) से राष्ट्रीय प्रौद्योगिकी संस्थान, कुरुक्षेत्र को "राष्ट्रीय महत्व के संस्थान" की स्थिति में परिवर्तन।',
    pointsOfApproval: [
      'क्षेत्रीय अभियांत्रिकी कॉलेज (आरईसी) को राष्ट्रीय प्रौद्योगिकी संस्थान (एनआईटी) में परिवर्तित करना: "राष्ट्रीय महत्व का संस्थान" [तिथि: 26-06-2002]',
      'एमएचआरडी द्वारा एनआईटी अधिनियम -2007 का प्रवर्तन',
      'एनआईटी अधिनियम -2007 की प्रथम विधियों का प्रवर्तन (राष्ट्रपति द्वारा 2009 में अनुमोदित) एमएचआरडी द्वारा',
      'एनआईटी अधिनियम-2007 का संशोधन गजट अधिसूचना (अधिनियम संख्या 28, 2012)',
      'एनआईटी अधिनियम -2007 (अधिनियम संख्या 29, 2007) संसद द्वारा 2007 में पारित, राष्ट्रपति द्वारा 5 जून, 2007 को अनुमोदित और भारत के गजट में 6 जून, 2007 को प्रकाशित, एमएचआरडी द्वारा 15 अगस्त, 2007 से अधिसूचित।',
      'एनआईटी अधिनियम-2007 की प्रथम विधियों को भारत के गजट में 23 अप्रैल, 2009 को प्रकाशित किया गया और एमएचआरडी द्वारा अधिसूचित किया गया, राष्ट्रपति (सभी एनआईटी के विजिटर) द्वारा अनुमोदित।',
      'एनआईटी अधिनियम-2007 का संशोधन-2012 (अधिनियम संख्या 28, 2012) संसद द्वारा 2012 में पारित, भारत के गजट में 7 जून, 2012 को प्रकाशित (व्यापक अधिनियम)',
      'सीएफटीआई सहित एनआईटी में जेआरएफ/एसआरएफ और अन्य आरएंडडी कर्मियों की छात्रवृत्ति और सेवा शर्तों पर नीति',
      'ओएम पर सामान्य प्रश्न (FAQ)',
    ],
  },

  Main: {
    director: {
      alt: 'डा. बी. वी. रमणा रेड्डी',
      title: 'निर्देशक का कोना',
      name: 'डा. बी. वी. रमणा रेड्डी',
      quote: [
        `भारत, साधकों की भूमि, ११०० वर्षों की पराधीनता, युद्ध, विलय और अपमान के बाद फिर से विश्व गुरु बन्ने
      के शिखर पर है। हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण ७५ वर्षों से यह फिर से एक स्वतंत्र
      देश है और इसने अपनी समृद्ध विविधता, संस्कृतियों, भाषाओं के साथ राष्ट्र के निर्माण की कई चुनौतियों के बीच
      खड़े होने की कला सीख ली है। देश को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता ही हमारा मंत्र है।`,
        'मैं इस संस्था की वेबसाइट पर आने वाले सभी लोगों का हृदय से स्वागत करता हूं।',
      ],
      more: 'और पढ़ें',
    },
    title: {
      primary: 'एनआईटी कुरुक्षेत्र',
      secondary: 'NIT KURUKSHETRA',
    },
    slideshow: [
      {
        image: 'slideshow/image01.jpg',
        title: 'एनआईटी केकेआर को पहला हरित परिसर वाला एनआईटी माना गया!',
        subtitle:
          'परिसर की दीवारों के साथ 900 एकड़ से अधिक हरी पत्तियां लगाई गई हैं, प्रतिष्ठित संस्थान का परिसर...',
      },
      {
        image: 'slideshow/image02.jpg',
        title: 'राष्ट्रीय संस्थान शीर्ष 10 इंजीनियरिंग कॉलेजों में शामिल',
        subtitle:
          'एनआईटी कुरुक्षेत्र ने भारत के शीर्ष 10 इंजीनियरिंग कॉलेजों में स्थान हासिल किया है, शिक्षा और अनुसंधान में उत्कृष्टता का प्रदर्शन...',
      },
      {
        image: 'slideshow/image03.jpg',
        title: 'छात्रों के लिए अत्याधुनिक अनुसंधान सुविधाएं अब खुली हैं',
        subtitle:
          'एनआईटी केकेआर में नवनिर्मित अनुसंधान प्रयोगशालाएं और केंद्र छात्रों और संकाय सदस्यों के लिए अत्याधुनिक तकनीक और संसाधन प्रदान करते हैं...',
      },
    ],
  },
  Academics: {
    notifications: 'सूचनाएँ',
    stats: 'आँकड़े',
    title: 'शैक्षणिक',
    departments: 'विभाग',
    programs: 'कार्यक्रम',
    courses: 'पाठ्यक्रम',
    regularFacultyMembers: 'नियमित संकाय सदस्य',
    postGraduatePrograms: 'स्नातकोत्तर कार्यक्रम',
    underGraduatePrograms: 'स्नातक कार्यक्रम',
    underGraduate: 'स्नातक',
    postGraduate: 'स्नातकोत्तर',
    doctorate: 'डॉक्टरेट',
    viewAll: 'सभी देखें',
    convocation: 'दीक्षांत समारोह',
    awards: 'पुरस्कार',
    scholarships: 'छात्रवृत्तियाँ',
    departmentsDetails:
      'विभागों ने आधुनिक प्रयोगशालाओं के आधुनिकीकरण और अत्याधुनिक सुविधाओं से सुसज्जित नए प्रयोगशालाओं की स्थापना के मामले में अपार वृद्धि दिखाई है, औद्योगिक आवश्यकताओं के अनुरूप पाठ्यक्रम विकास, छात्रों की नियुक्ति और फैकल्टी सदस्यों के शोध पत्रों के प्रकाशन के संबंध में। फैकल्टी सदस्यों ने हार्डवेयर डिजाइन, मॉडलिंग और विश्लेषण और डेटा संचार प्रणालियों और वायरलेस नेटवर्क, सिग्नल प्रोसेसिंग और VLSI डिजाइन के क्षेत्रों में नई तकनीकों और एल्गोरिदम विकसित करने के क्षेत्र में एक पहचान बनाई है।',

    aboutDetail:
      'NIT एक प्रमुख शोध विश्वविद्यालय है और भारत के सबसे पुराने कॉलेजों में से सातवां है। विश्वविद्यालय की शिक्षण, शोध और स्कॉलरशिप के केंद्र में शैक्षणिक उत्कृष्टता, बौद्धिक स्वतंत्रता और लोगों, समुदायों और समाज की बेहतर सेवा करने के लिए प्रभाव डालने की प्रतिबद्धता है। विश्वविद्यालय अपने लचीले लेकिन कठोर ओपन करिकुलम में निहित अद्वितीय अंडरग्रेजुएट अनुभव के लिए प्रसिद्ध है।',

    coursesDetails:
      'विभागों ने आधुनिक प्रयोगशालाओं के आधुनिकीकरण और अत्याधुनिक सुविधाओं से सुसज्जित नए प्रयोगशालाओं की स्थापना के मामले में अपार वृद्धि दिखाई है, औद्योगिक आवश्यकताओं के अनुरूप पाठ्यक्रम विकास, छात्रों की नियुक्ति और फैकल्टी सदस्यों के शोध पत्रों के प्रकाशन के संबंध में। फैकल्टी सदस्यों ने हार्डवेयर डिजाइन, मॉडलिंग और विश्लेषण और डेटा संचार प्रणालियों और वायरलेस नेटवर्क, सिग्नल प्रोसेसिंग और VLSI डिजाइन के क्षेत्रों में नई तकनीकों और एल्गोरिदम विकसित करने के क्षेत्र में एक पहचान बनाई है।',

    programmesDetails:
      'विभागों ने आधुनिक प्रयोगशालाओं के आधुनिकीकरण और अत्याधुनिक सुविधाओं से सुसज्जित नए प्रयोगशालाओं की स्थापना के मामले में अपार वृद्धि दिखाई है, औद्योगिक आवश्यकताओं के अनुरूप पाठ्यक्रम विकास, छात्रों की नियुक्ति और फैकल्टी सदस्यों के शोध पत्रों के प्रकाशन के संबंध में। फैकल्टी सदस्यों ने हार्डवेयर डिजाइन, मॉडलिंग और विश्लेषण और डेटा संचार प्रणालियों और वायरलेस नेटवर्क, सिग्नल प्रोसेसिंग और VLSI डिजाइन के क्षेत्रों में नई तकनीकों और एल्गोरिदम विकसित करने के क्षेत्र में एक पहचान बनाई है।',
  },

  Clubs: { title: 'संघठनें' },
  Committee: {
    building: 'निर्माण एवं कार्य समिति',
    financial: 'वित्तीय समिति',
    governor: 'राज्यपाल मंडल',
    members: {
      title: 'सदस्य',
      serial: 'क्रम संख्या',
      nomination: 'नामांकन',
      name: 'नाम',
      servingAs: 'के रूप में सेवारत',
    },
    meetings: {
      title: 'बैठकें',
      serial: 'बैठक संख्या',
      date: 'दिनांक',
      place: 'स्थान',
      agenda: 'कार्यसूची',
      minutes: 'विवरण',
    },
  },
  Convocation: {
    about: 'परिचय',
    guest: 'मुख्य अतिथि का संदेश',
    student: 'टॉपर्स और पुरस्कार विजेता',
    gallery: 'चित्र',
    notification: 'सूचनाएं',
    srNo: 'क्रमांक',
    name: 'नाम',
    depratment: 'विभाग',
    rankOrAward: 'पदवी/पुरस्कार',
  },
  Curricula: {
    pageTitle: 'पाठ्यक्रम',
    code: 'कोड',
    title: 'शीर्षक',
    major: 'क्रमादेश',
    credits: 'एल-टी-पी',
    totalCredits: 'क्रेडिट्स',
    syllabus: 'पाठ्यक्रम',
  },
  Curriculum: {
    courseCode: 'कोर्स कोड',
    title: 'कोर्स विवरण',
    coordinator: 'समन्वयक',
    prerequisites: {
      title: 'आवश्यकताएँ',
      none: 'इस कोर्स के लिए कोई आवश्यकता नहीं',
    },
    nature: 'कोर्स प्रकृति',
    objectives: 'उद्देश्य',
    content: 'सामग्री',
    outcomes: 'परिणाम',
    essentialReading: 'आवश्यक पाठ्य',
    supplementaryReading: 'परिशिष्ट पाठ्य',
    similarCourses: 'समान कोर्स',
    referenceBooks: 'संदर्भ पुस्तकें',
  },
  Dean: {
    deanTitles: {
      academic: 'शैक्षिक डीन',
      'estate-and-construction': 'भूमि और निर्माण डीन',
      'faculty-welfare': 'संकाय कल्याण डीन',
      'industry-and-international-relations':
        'उद्योग और अंतरराष्ट्रीय संबंध डीन',
      'planning-and-development': 'नियोजन और विकास डीन',
      'research-and-consultancy': 'अनुसंधान और परामर्श डीन',
      'student-welfare': 'छात्र कल्याण डीन',
    },
    responsibilities: 'जिम्मेदारियाँ',
  },

  Deans: {
    title: 'Deans',
    academic: 'शैक्षणिक',
    estateAndConstruction: 'एस्टेट और निर्माण',
    facultyWelfare: 'शिक्षक कल्याण',
    industryAndInternationalRelations: 'उद्योग और अंतर्राष्ट्रीय संबंध',
    planningAndDevelopment: 'योजना और विकास',
    researchAndConsultancy: 'अनुसंधान और परामर्श',
    studentWelfare: 'छात्र कल्याण',
  },
  Departments: { title: 'विभाग' },
  Department: {
    headings: {
      about: 'परिचय',
      vision: 'दृष्टि',
      and: 'और',
      mission: 'उद्देश्य',
      hod: {
        title: 'विभागाध्यक्ष का संदेश',
        session: (from: string) => `शैक्षणिक सत्र ${from} - वर्तमान`,
      },
      programmes: {
        title: 'कार्यक्रम',
        undergrad: 'पूर्वस्नातक',
        postgrad: 'स्नातकोत्तर',
        doctorate: 'डॉक्टरेट',
      },
      gallery: 'चित्र',
    },
    facultyAndStaff: 'संकाय और कर्मचारी',
    laboratories: 'प्रयोगशालाएँ',
    achievements: 'छात्र उपलब्धियाँ',
  },
  Events: {
    title: 'कार्यक्रम और समाचार',
    categories: {
      featured: 'विशेष',
      recents: 'हाल ही में',
      student: 'छात्र',
      faculty: 'शिक्षक',
    },
    viewAll: 'सभी देखें',
  },

  FacultyAndStaff: {
    placeholder: 'नाम या ईमेल से खोजें',
    departmentHead: 'विभागाध्यक्ष',
    tabs: {
      qualifications: 'शैक्षिक योग्यता',
      experience: 'अनुभव',
      projects: 'प्रोजेक्ट्स',
      educationCurrent: 'निरंतर शिक्षा',
      publications: 'प्रकाशन',
      scholars: 'अनुसंधान विद्वान',
      awards: 'पुरस्कार और सम्मान',
    },
  },
  FAQ: { title: 'अक्सर पूछे जाने वाले प्रश्न' },
  Footer: {
    logo: 'प्रतीक चिन्ह',
    nit: 'राष्ट्रीय प्रौद्योगिकी संस्थान, कुरूक्षेत्र',
    location: 'थानेसर, हरियाणा, भारत १३६११९',
    design: 'कलाकृति',
    headings: ['त्वरित संदर्भ', 'त्वरित संदर्भ', 'त्वरित संदर्भ'],
    lorem: 'लोरेम इप्सम',
    copyright:
      '© २०२४ राष्ट्रीय प्रौद्योगिकी संस्थान कुरूक्षेत्र। सर्वाधिकार आरक्षित।',
  },
  Forms: { title: 'फॉर्म्स' },
  Header: {
    institute: 'संस्थान',
    academics: 'शैक्षिक',
    faculty: 'संकाय और कर्मचारी',
    placement: 'प्रशिक्षण एवं नियुक्ति',
    activities: 'छात्र गतिविधियाँ',
    alumni: 'भूतपूर्व छात्र',
    logo: 'प्रतीक चिन्ह',
    search: 'त्वरित खोज...',
    login: 'प्रवेश',
    profile: { alt: 'मेरी छवि', view: 'विवरण देखें' },
  },
  Institute: {
    welcome: 'एनआईटी कुरुक्षेत्र में आपका स्वागत है',
    profile: {
      title: 'संस्थान प्रोफाइल',
      vision: {
        title: 'संस्थान का दृष्टिकोण',
        content: [
          'वैश्विक चुनौतियों के प्रति उत्तरदायी तकनीकी शिक्षा और अनुसंधान में एक आदर्श बनना।',
        ],
      },
      mission: {
        title: 'संस्थान का मिशन',
        content: [
          'गुणवत्तापूर्ण तकनीकी शिक्षा प्रदान करना जो नवोन्मेषी पेशेवरों और उद्यमियों का विकास करे।',
          'ऐसा अनुसंधान करना जो सामाजिक-आर्थिक आवश्यकताओं पर ध्यान केंद्रित करते हुए अत्याधुनिक तकनीकों और भविष्यवादी ज्ञान का सृजन करे।',
        ],
      },
      history: {
        title: 'ऐतिहासिक छाप',
        content: [
          'केंद्रीय सरकार ने योजना आयोग के परामर्श से तीसरी पंचवर्षीय योजना के तहत क्षेत्रीय इंजीनियरिंग कॉलेजों की स्थापना की योजना को मंजूरी दी थी ताकि योजना अवधि के दौरान देश में तकनीकी शिक्षा के लिए सुविधाओं का विस्तार किया जा सके। "क्षेत्रीय इंजीनियरिंग कॉलेज, कुरुक्षेत्र" देश के सत्रह कॉलेजों में से एक था। सरकार के पत्र संख्या 16-4/60-T.5, दिनांक 26 फरवरी, 1962 के माध्यम से, यह संस्थान 1963 में भारत सरकार और हरियाणा राज्य सरकार का एक संयुक्त और सहकारी उपक्रम के रूप में स्थापित किया गया था ताकि हरियाणा राज्य और देश के बाकी हिस्सों के युवाओं को तकनीकी प्रशिक्षण प्रदान किया जा सके और राष्ट्रीय एकीकरण को बढ़ावा दिया जा सके। इसका उद्देश्य विभिन्न इंजीनियरिंग और प्रौद्योगिकी विषयों में शिक्षा और अनुसंधान सुविधाओं को प्रदान करना और प्रत्येक ऐसे विषय में सीखने और ज्ञान के प्रसार को बढ़ावा देना था।',

          'आईआरई कुरुक्षेत्र की पहली प्रवेश 1963 में पंजाब इंजीनियरिंग कॉलेज, चंडीगढ़ और थापर इंस्टीट्यूट ऑफ़ इंजीनियरिंग एंड टेक्नोलॉजी, पटियाला में किया गया था।',
          'आईआरई कुरुक्षेत्र को 25 अप्रैल, 1964 को सोसाइटीज रजिस्ट्रेशन एक्ट 1860 के तहत रजिस्टर किया गया था।',
          'नित कुरुक्षेत्र को 26 जून, 2002 को डीम्ड विश्वविद्यालय के रूप में उन्नत किया गया था।',
          'इस संस्थान ने अपनी पहचान को डीम्ड विश्वविद्यालय के रूप में प्राप्त किया था।',
          'इस संस्थान ने 1985-86 से 4 वर्षीय बीटेक डिग्री पाठ्यक्रमों पर स्विच किया।',
          'संस्थान ने 2006-07 में एक 2 वर्षीय एमबीए पाठ्यक्रम और दो चार वर्षीय बीटेक डिग्री पाठ्यक्रमों को शुरू किया।',
          'संस्थान ने उत्तरीय और अध्ययन के स्तर पर विभिन्न तकनीकी और प्रौद्योगिकी विषयों में निर्देश प्रदान किया है।',
        ],
        readMore: 'और पढ़ें',
      },
    },
    admission: {
      title: 'शैक्षिक प्रक्रिया और शिक्षा प्रणाली',
      process: {
        title: 'प्रवेश प्रक्रिया',
        content: [
          'स्नातक पाठ्यक्रमों में – बी.टेक. डिग्री पाठ्यक्रम, प्रवेश अखिल भारतीय इंजीनियरिंग प्रवेश परीक्षा (AIEEE) के आधार पर किया जाता है, जिसे भारत सरकार की ओर से केंद्रीय माध्यमिक शिक्षा बोर्ड (CBSE) द्वारा आयोजित किया जाता है।',
          'हालांकि, एम.टेक. डिग्री पाठ्यक्रमों में प्रवेश उम्मीदवार के GATE परीक्षा में प्राप्त अंकों के आधार पर किया जाता है। पहले सीटें GATE-योग्य उम्मीदवारों को भरने के बाद उद्योग-प्रायोजित उम्मीदवारों को दी जाती हैं। शेष खाली सीटें उन गैर-GATE उम्मीदवारों को दी जाती हैं जिनके योग्यता परीक्षा में कम से कम 60 प्रतिशत अंक (SC उम्मीदवारों के लिए 55 प्रतिशत) हैं। GATE उम्मीदवारों को 5000/- रुपये प्रति माह की छात्रवृत्ति के लिए पात्र होते हैं। गैर-GATE उम्मीदवारों को कोई छात्रवृत्ति नहीं दी जाती है।',
        ],
      },
      education: {
        title: 'शिक्षा प्रणाली',
        content: [
          'संस्थान की शिक्षा प्रणाली को शैक्षणिक सत्रों में विभाजित किया गया है जिसमें दो सेमेस्टर होते हैं – सम और विषम सेमेस्टर। संस्थान बी.टेक और एम.टेक. डिग्री प्रदान करने वाले पाठ्यक्रम और डॉक्टर ऑफ फिलॉसफी की डिग्री प्रदान करने वाले अनुसंधान सुविधाएं प्रदान करता है। निर्देश और परीक्षा की भाषा अंग्रेजी है। संस्थान को 26.6.2002 से एक डीम्ड यूनिवर्सिटी का दर्जा प्राप्त है। संस्थान अब शैक्षणिक कार्यों जैसे परीक्षाओं, उत्तर पुस्तिकाओं के मूल्यांकन, परिणामों की घोषणा और अन्य संबद्ध मामलों से संबंधित हर पहलू में स्वतंत्र है। संस्थान ने पारंपरिक परीक्षा और मूल्यांकन प्रणाली से क्रेडिट आधारित परीक्षा प्रणाली में परिवर्तन कर लिया है।',
          'पाठ्यक्रमों में संस्थान में अध्ययन, कार्य स्थलों का दौरा और संस्थान कार्यशालाओं और अनुमोदित इंजीनियरिंग कार्यों में व्यावहारिक प्रशिक्षण शामिल हैं। प्रत्येक सेमेस्टर के अंत में एक सेमेस्टर परीक्षा होती है।',
        ],
      },
    },
    nirf: {
      title: 'एनआईआरएफ रैंकिंग',
      year: 'वर्ष',
      result: 'परिणाम',
      dataFile: 'डेटा फ़ाइल',
      nirfCertificate: 'एनआईआरएफ प्रमाणपत्र',
    },

    funds: {
      title: 'आय के स्रोत',
      content:
        'आरईसी अब एनआईटी, कुरुक्षेत्र के स्थापना के अनुसार, सभी अनवांछित व्यय अंडरग्रेजुएट पाठ्यक्रम पर केंद्रीय और राज्य सरकारों द्वारा 50:50 अनुपात पर उत्तरजीवी था।',
    },
    collaboration: {
      title: 'संस्थान-उद्योग सहयोग',
      content: [
        'ईसीई विभाग का एचपी इंडिया सॉफ्टवेयर ऑपरेशन प्रा. लिमिटेड, 29 कनिंघम रोड, बैंगलोर-52 के साथ एक एमओयू है। इस एमओयू के तहत, B.Tech के अंतिम वर्ष के छात्रों को एचपी के लाइव प्रोजेक्ट सौंपे जाते हैं और इन्हें एचपी और NIT कुरुक्षेत्र के फैकल्टी द्वारा संयुक्त रूप से निगरानी की जाती है।',
        'संस्थान विभिन्न सरकारी और अन्य औद्योगिक संगठनों द्वारा संदर्भित डिज़ाइन और विकास समस्याओं पर परामर्श सेवाएं प्रदान करता है।',
        'TEQIP के प्रयासों के तहत संस्थान-उद्योग संपर्क को बढ़ाने का प्रयास किया जा रहा है। संस्थान ने 19-20 फरवरी, 2007 को होटल शिवालिकव्यू, चंडीगढ़ में उद्योग संस्थान संपर्क (NWIII-2007) पर दो दिवसीय कार्यशाला का आयोजन किया, जिसमें प्रमुख उद्योग और अकादमी के प्रतिनिधियों ने बड़े पैमाने पर भाग लिया। कार्यशाला के विचार-विमर्श के दौरान, NIT कुरुक्षेत्र और अल्टेयर इंजीनियरिंग इंडिया के बीच कंप्यूटर एडेड इंजीनियरिंग (CAE) के क्षेत्र में एक उत्कृष्टता केंद्र की स्थापना के लिए एक समझौता ज्ञापन पर सहमति व्यक्त की गई।',
      ],
    },
    quickLinks: {
      title: 'Quick Links',
      campus: 'कैंपस और बुनियाद',
      documentary: 'संस्थान डॉक्यूमेंटरी',
      organisationChart: 'संगठन चार्ट',
      sections: 'खंड',
      gallery: 'फोटो गैलरी',
      administration: 'प्रशासन',
    },
    infrastructure: {
      heading: 'कैम्पस और आधारिक संरचना',
      headings: ['कैम्पस', `आधारिक संरचना`, `कैसे पहुँचें`],
      campus: [
        "कुरुक्षेत्र, इतिहास और पौराणिक कथाओं में डूबी हुई, एक महान आध्यात्मिक महत्त्व की जगह है, जहां भगवान कृष्ण ने 'श्रीमद भगवद गीता' का दिव्य संदेश दिया। ज्ञान की धारा दूर-दूर तक फैलाने का स्थान राजा हर्षवर्धन ने अपनी राजधानी चुनी थी। यह एक प्रमुख तीर्थ स्थल है, जो साल भर भक्तों को लगातार आकर्षित करता है। कुरुक्षेत्र उत्तरी रेलवे के दिल्ली-करनाल-अम्बाला खंड पर एक रेलवे जंक्शन है। यह दिल्ली से लगभग 160 किलोमीटर की दूरी पर है। संस्थान कैम्पस पिपली से लगभग 10 किलोमीटर और कुरुक्षेत्र रेलवे स्टेशन से लगभग 5 किलोमीटर की दूरी पर है।",
        'कैम्पस का क्षेत्रफल लगभग 300 एकड़ है जो एक चित्रस्थल पर अभूतपूर्व रूप से बिछाया गया है। यह वास्तुकला और प्राकृतिक सौंदर्य में समानता का दृश्य प्रस्तुत करता है। कैम्पस को तीन कार्यात्मक क्षेत्रों में व्यवस्थित किया गया है: छात्रों के लिए हॉस्टल, अध्यापन भवन और कर्मचारियों के लिए आवासीय क्षेत्र।',
        'छात्रों के लिए हॉस्टल कैम्पस के पूर्वी भाग में गुच्छे के रूप में स्थित हैं। हॉस्टल के तीन मंजिल के भवन छात्रों को आरामदायक आवास और प्रिय वातावरण प्रदान करते हैं।',
        'नेशनल इंस्टीट्यूट ऑफ टेक्नोलॉजी कुरुक्षेत्र (एनआईटीके) एक प्रशस्ति केंद्र होने का श्रेय प्राप्त है, जो गुणवत्तापूर्ण तकनीकी और प्रबंधन शिक्षा, अनुसंधान और प्रशिक्षण को सुविधाजनक बनाता है। इसे राष्ट्रीय महत्व के संस्थान होने का दर्जा प्राप्त है।',
        'पैरामीटर्स पर ऊची गुणवत्ता प्राप्त की। सन् 1963 में स्थापित किया गया, एनआईटीके ने उत्कृष्टता की ओर तेजी से कदम बढ़ाया। एक विशाल हरित-भरे कैम्पस, उत्कृष्ट आधारभूत संरचना, आधुनिक समर्थन प्रणाली, समकालीन पाठ्यक्रम और एक समर्पित शिक्षक दल गुणवत्ता शिक्षण, शिक्षा और अनुसंधान के लिए एक समर्थ वातावरण प्रदान करते हैं। संस्थान संस्था-उद्योग संवाद के महत्व को पहचानता है और छात्र स्थानांतरण, परामर्श सेवाएं, संयुक्त अनुसंधान परियोजनाओं और कार्यशालाओं, सेमिनारों, सम्मेलनों आदि का संगठन करके उद्योग के साथ आंतरिक क्रियाकलाप को बढ़ावा देता है। इस संघ को और मजबूत करना संस्थान के लिए वर्तमान में प्राथमिकता का विषय है।',
        'वर्तमान में, एनआईटीके ने सिविल, कंप्यूटर साइंस, इलेक्ट्रिकल, इलेक्ट्रॉनिक्स और कम्युनिकेशन, मैकेनिकल इंजीनियरिंग, औद्योगिक इंजीनियरिंग और प्रबंधन, सूचना प्रौद्योगिकी और मास्टर ऑफ बिजनेस एडमिनिस्ट्रेशन (एमबीए) - विपणन, वित्त, मानव संसाधन प्रबंधन, सूचना प्रौद्योगिकी के साथ स्नातक (बी.टेक.) और पोस्ट ग्रेजुएट (एम.टेक.) कार्यक्रम प्रदान किए हैं - इंजीनियरिंग, प्रौद्योगिकी, अनुप्रयोग विज्ञान, और विज्ञान और मानविकी और सामाजिक विज्ञानों के क्षेत्र में शोध के लिए उत्कृष्ट सुविधाएं भी प्रदान की हैं। पाठ्यक्रम को लगातार अद्यतन किया जाता है ताकि देश की विभिन्न प्रौद्योगिकी और प्रबंधन क्षेत्रों में वृद्धि और आवश्यकताओं को पूरा किया जा सके।',
        'एनआईटी कुरुक्षेत्र कैम्पस:',
      ],
      infra: [
        'इंफ्रास्ट्रक्चर भी संस्थान को उच्च गुणवत्ता के तकनीकी कर्मचारियों का विकास करने में सक्षम है। संस्थान द्वारा अनेक परियोजनाएं चलाई जा रही हैं, जिन्हें विज्ञान और शिक्षा मंत्रालय, भारत सरकार, सीएसआईआर, एआईसीटीई और यूजीसी द्वारा प्रदान किया जाता है। शिक्षण और अनुसंधान कार्यक्रमों का समर्थन एक केंद्रीय पुस्तकालय (जिसमें बहुलक्ष वाले पुस्तकों, बाउंड जर्नल्स, आईएस कोड, थिसिस, वीडियो सीडी आदि हैं। पुस्तकालय में आईईएल, एएससीई, एसीएम, एएसएमई, एसएई, आदि के ऑनलाइन जर्नल्स की सुविधा भी है), एक ऑडियो विजुअल एड सेंटर विकसित किया गया है जो मानव संसाधन विकास मंत्रालय (एमएचआरडी) के एक परियोजना के तहत है। 24 घंटे के इंटरनेट सुविधा और 2 एमबीपीएस लीज्ड लाइन के साथ एक मॉडर्न संचार और नेटवर्किंग केंद्र प्रदान किया गया है।',
        'एनआईटीके नए उत्साह के साथ भविष्य की दिशा में देखता है। संस्थान ने हाल ही में बीस वर्ष का रोड मैप तैयार किया है जिसमें संस्थान के दृष्टिकोण को सफलतापूर्वक लागू करने और भविष्य के चुनौतियों को सफलतापूर्वक सामना करने के रणनीतियों का विवरण दिया गया है। रोड मैप में मील के पत्थर को सफलतापूर्वक कवर करने पर, संस्थान को देश के उत्कृष्ट संस्थानों के प्रमुख में एक स्थान की गारंटी है।',
      ],
      library: {
        heading: 'पुस्तकालय',
        text: [
          `पुस्तकालय एक अलग इमारत में स्थित है जिसका आवरित क्षेत्र 3600 वर्ग मीटर है। इसके प्राचुर्य, स्थान और सेवाओं के साथ, पुस्तकालय विभाग, अनुसंधान शोधी और छात्रों की आवश्यकताओं को बहुत प्रभावी और कुशलतापूर्वक पूरा करता है। उन्हें अनुसंधान में नवीनतम विकासों के बारे में सम्मिलित रखने के लिए, यह अब मानव संसाधन विकास मंत्रालय द्वारा स्थापित आईएनडेएसटी संघ के माध्यम से इलेक्ट्रॉनिक संसाधनों की सदस्यता करता है। पुस्तकालय में 100,000 पुस्तकें, 6028 पीछे के वॉल्यूम और 3659 ई-पुस्तकें हैं। पुस्तकालय विज्ञान, प्रबंधन और प्रौद्योगिकी के क्षेत्रों में लगभग 2800 ऑनलाइन जर्नलों की सदस्यता करता है। पुस्तकालय अपने उपयोगकर्ताओं के लिए 24 x 7 उपलब्ध रहता है।`,
        ],
      },
      computing: {
        heading: `कंप्यूटिंग सुविधाएं:`,
        text: [
          `कंप्यूटिंग और नेटवर्किंग केंद्र (सीसीएन) संस्थान के छात्रों, शिक्षकों और कर्मचारियों के लिए केंद्रीकृत सुविधा है। इसे 2 एमबीपीएस किराया लाइन के साथ 24 घंटे का इंटरनेट सुविधा प्रदान की गई है। NITK को माना जाता है कि सूचना प्रौद्योगिकी प्रबंधन का अभिन्न हिस्सा है। NITK का इंट्रानेट संस्थान में सिखाया गया सब कुछ को ग्रहण करता है और उपभोक्ताओं की मांग पर उन सभी को वितरित करता है। यह प्रयोगशाला गहन कंप्यूटिंग एप्लिकेशन्स को संचालित करने की क्षमता रखती है और नवीनतम हार्डवेयर के साथ सम्पर्कित है, यहां उपभोक्ता और सर्वर कंप्यूटिंग के लिए। वाई-फाई बुनियादी संरचना सुनिश्चित करती है कि कैंपस पर हर रोज़गारी करने वाले को अपने डिजिटल तंत्रिका तंत्र से कहीं से भी कनेक्ट करने की क्षमता है।`,
        ],
      },
      senate: {
        heading: `सीनेट हॉल:`,
        text: [
          `NITK के पास एक आधुनिक सीनेट हॉल है। यह एक रंगीन डिज़ाइन और सुविधाजनक स्थानित संगोष्ठी-कैंटीन सुविधा है। सीनेट हॉल संस्थान को सम्मेलन, सेमिनार, कार्यशाला आदि का आयोजन करने के लिए समर्थ बनाता है। सभी अतिथि शिक्षकों और कॉर्पोरेट प्रबंधकों के व्याख्यान यहां आयोजित किए जाते हैं। प्रशिक्षण और स्थानन कोश भी पहले मंजिल पर स्थित है।`,
        ],
      },
      sports: {
        heading: `खेल परिसर:`,
        text: [
          `परिसर में विस्तृत और हरित महाखेलकुद का मैदान है जिसमें बास्केटबॉल, वॉलीबॉल, लॉन टेनिस, बैडमिंटन, और रैकेटबॉल कोर्ट्स, क्रिकेट और फुटबॉल ग्राउंड्स शामिल हैं। इसमें एक मिनी-जिमनेसियम और एक 400 मीटर धावक ट्रैक भी है। यह छात्रों को विविध रीक्रिएशन प्रदान करता है। नियमित आधार पर कई गतिविधियाँ और राष्ट्रीय स्तर पर आयोजित कार्यक्रम स्टूडेंट्स को टीम कार्य की भावना और साधना को मजबूत करते हैं।`,
        ],
      },
      address: [
        `राष्ट्रीय प्रौद्योगिकी संस्थान कुरुक्षेत्र - १३६११९ (भारत)`,
        `टेलीफोन नंबर: +९१-१७४४-२३३२१२ (कार्यालय)`,
        `फैक्स: +९१-१७४४-२३८०५०`,
      ],
    },
  },
  Hostels: {
    title: 'छात्रावास',
    notificationsTitle: 'छात्रावास सूचनाएँ',
    boysHostels: 'लड़कों के छात्रावास',
    girlsHostels: 'लड़कियों के छात्रावास',
    misc: 'विविध',
    rulesTitle: 'छात्रावास नियम एवं आचरण',
    hostelDetails: {
      name: 'छात्रावास का नाम: ',
      overview: 'छात्रावास का अवलोकन',
      staffOverview: 'छात्रावास स्टाफ का अवलोकन',
      facilities: 'छात्रावास सुविधाओं का अवलोकन',
      contact: 'हमसे संपर्क करें: ',
      email: 'ईमेल: ',
      wardens: 'वार्डन: ',
      faculty: 'फैकल्टी',
      staff: 'स्टाफ',
      general: 'सामान्य',
      hostelsStaffTable: {
        name: 'नाम',
        designation: 'पदनाम',
        contact: 'संपर्क',
        hostelPost: 'छात्रावास पद',
        email: 'ईमेल',
      },
    },
  },
  Login: {
    title: 'प्रवेश करें',
    enterEmail: 'अपना ईमेल दर्ज करें',
    continueButton: 'अगले चरण पर बढ़ें (तैयार नहीं)',
    signInWithGoogle: 'गूगल द्वारा प्रवेश करें',
  },
  Notifications: {
    title: 'सूचनाएँ',
    categories: {
      academic: 'शैक्षणिक',
      tender: 'निविदाएँ',
      workshop: 'कार्यशालाएं',
      recruitment: 'नियुक्ति',
    },
    viewAll: 'सारा देखें',
  },
  NotFound: {
    title: '404',
    description: 'लगता है आप भटक गए  हैं,',
    backHome: 'चलिए, आपको होम पेज पर ले चलें।',
  },
  Profile: {
    tabs: {
      personal: {
        title: 'व्यक्तिगत विवरण',
        basic: {
          title: 'मूलभूत',
          name: 'नाम',
          rollNumber: 'रोल संख्या',
          sex: 'लिंग',
          dateOfBirth: 'जन्मदिन',
        },
        contact: {
          title: 'संपर्क',
          email: 'संस्थान ईमेल',
          personalEmail: 'व्यक्तिगत ईमेल',
          telephone: 'टेलीफ़ोन',
          alternateTelephone: 'वैकल्पिक टेलीफ़ोन',
        },
        institute: {
          title: 'संस्था',
          degree: 'उपाधि',
          major: 'क्रमादेश',
          currentSemester: 'मौजूदा छमाही',
          section: 'अनुभाग',
        },
        admission: {
          title: 'प्रवेश',
          applicationNumber: 'प्रवेश संख्या',
          candidateCategory: 'उम्मीदवार श्रेणी',
          admissionCategory: 'प्रवेश श्रेणी',
          admissionSubcategory: 'प्रवेश उपश्रेणी',
          dateOfAdmission: 'प्रवेश की तिथि',
        },
        guardians: {
          title: 'अभिभावक',
          father: 'पिता',
          mother: 'माता',
          local: 'स्थानीय संरक्षक',
          name: 'नाम',
          telephone: 'टेलीफ़ोन',
          email: 'ईमेल',
        },
        address: {
          title: 'पता',
          permanent: 'स्थायी पता',
          pinCode: 'पिन कोड',
        },
      },
      notifications: { title: 'सूचनाएँ' },
      courses: { title: 'पाठ्यक्रम' },
      clubs: { title: 'संघठन' },
      results: { title: 'परिणाम और विस्तृत अंक प्रमाण पत्र' },
      bookmarks: { title: 'बुकमार्क्स' },
      quickSend: { title: 'त्वरित प्रेषण' },
    },
    logout: 'प्रस्थान करें',
  },
  Programmes: {
    btechAbout:
      'संस्थान बी.टेक., एम.टेक. की डिग्री की ओर ले जाने वाले पाठ्यक्रम और डॉक्टरेट ऑफ फिलॉसफी की डिग्री की ओर अनुसंधान सुविधाएँ प्रदान करता है। शिक्षा और परीक्षा का माध्यम अंग्रेजी है। संस्थान ने डीम्ड विश्वविद्यालय का दर्जा प्राप्त कर लिया है। पाठ्यक्रमों में संस्थान में अध्ययन, कार्य स्थलों का दौरा और व्यावहारिक प्रशिक्षण शामिल हैं। संस्थान की कार्यशालाओं में और अनुमोदित इंजीनियरिंग कार्यों में। प्रत्येक सेमेस्टर के अंत में डीम्ड विश्वविद्यालय की परीक्षा होती है। अध्ययन के पाठ्यक्रम निम्नलिखित विषयों में प्रस्तुत किए जाते हैं:',
    mtechAbout:
      'प्रत्येक शैक्षणिक वर्ष में शिक्षण दो सेमेस्टरों में विभाजित होता है। नियमित छात्रों के लिए पाठ्यक्रम की अवधि चार सेमेस्टर और पार्ट-टाइम छात्रों (केवल एनआईटी, कुरुक्षेत्र कर्मचारियों के लिए) के लिए छह सेमेस्टर होती है। सभी प्रवेशित उम्मीदवार राष्ट्रीय प्रौद्योगिकी संस्थान (राष्ट्रीय महत्व का संस्थान), कुरुक्षेत्र द्वारा निर्धारित पोस्ट-ग्रेजुएट कार्यक्रमों के लिए शैक्षणिक नियमों द्वारा संचालित होंगे। एम.टेक. सीटें पहले GATE-योग्य उम्मीदवारों द्वारा भरी जाती हैं, फिर उद्योग द्वारा प्रायोजित उम्मीदवारों द्वारा, और यदि सीटें खाली रहती हैं, तो अन्य उम्मीदवारों द्वारा भरी जाती हैं। गैर-GATE उम्मीदवार छात्रवृत्ति के लिए पात्र नहीं होते हैं।',
    courseOfStudy: 'अध्ययन के पाठ्यक्रम:',
    departmentAndSchools: 'विभाग/ स्कूल',
    noOfSeats: 'सीटों की संख्या',
    secialization: 'विशेषज्ञता',
    discipline: 'विषय',
    btech: 'बी.टेक',
    mtech: 'एम.टेक',
    seatDistribution: 'सीट वितरण',
  },
  Scholarships: {
    NSP: {
      abbreviation: 'एन.एस.पी',
      title: 'राष्ट्रीय छात्रवृत्ति पोर्टल (एनएसपी)',
      about:
        'राष्ट्रीय छात्रवृत्ति पोर्टल (एनएसपी) छात्रों के लिए छात्रवृत्ति सेवाओं को सुव्यवस्थित करने के लिए डिज़ाइन किया गया एक व्यापक मंच है। इसमें छात्र आवेदन, प्राप्ति, प्रसंस्करण, स्वीकृति, और वितरण सहित छात्रवृत्ति प्रक्रियाओं के विभिन्न चरण शामिल हैं। एनएसपी राष्ट्रीय ई-गवर्नेंस योजना (NeGP) के तहत एक मिशन मोड परियोजना (MMP) के रूप में कार्य करता है, जो सरकार की डिजिटल पहलों के साथ संरेखित है।',
      description:
        'एनएसपी पोर्टल विभिन्न श्रेणियों जैसे सामान्य, ओबीसी, एससी, एसटी, डीएनटी आदि के लिए विभिन्न छात्रवृत्ति योजनाओं की मेजबानी करता है। कुछ उल्लेखनीय योजनाओं में एससी छात्रों के लिए टॉप क्लास एजुकेशन स्कीम और ओबीसी, ईबीसी और डीएनटी छात्रों के लिए कॉलेज में टॉप क्लास एजुकेशन की पीएम यसस्वी केंद्रीय क्षेत्र योजना शामिल हैं। इन योजनाओं को संघ सरकार, राज्य सरकारों और केंद्र शासित प्रदेशों द्वारा शुरू किया गया है, जिनका उद्देश्य छात्रों को वित्तीय सहायता प्रदान करना और शिक्षा की पहुंच को बढ़ावा देना है।',
      objectives: [
        'छात्रों को छात्रवृत्तियों का समय पर वितरण सुनिश्चित करना।',
        'केंद्रीय और राज्य सरकार की छात्रवृत्ति योजनाओं के लिए एकीकृत पोर्टल प्रदान करना।',
        'विद्वानों का पारदर्शी डेटाबेस स्थापित करना।',
        'प्रसंस्करण में दोहराव को रोकना।',
        'छात्रवृत्ति योजनाओं और मानदंडों का मानकीकरण करना।',
        'कुशल निधि वितरण के लिए प्रत्यक्ष लाभ अंतरण (DBT) को लागू करना।',
      ],
    },
    PMSSS: {
      abbreviation: 'पी.एम.एस.एस.',
      title:
        'प्रधानमंत्री विशेष छात्रवृत्ति योजना जम्मू और कश्मीर के छात्रों के लिए',
      about:
        'प्रधानमंत्री विशेष छात्रवृत्ति योजना या PMSSS एक वित्तीय अवसर है जो आल इंडिया काउंसिल फॉर टेक्निकल एजुकेशन (AICTE) द्वारा प्रदान किया जाता है। PMSSS 2023, जिसे AICTE JK Scholarship 2023 भी कहा जाता है। PMSSS का उद्देश्य जम्मू और कश्मीर और लद्दाख क्षेत्र के छात्रों को वित्तीय रूप से सहायता प्रदान करना है।',
    },
    HCS: {
      abbreviation: 'एच.सी.एस',
      title: 'हर-छत्रवृत्ति पोर्टल',
      about:
        "हर-छात्रवृत्ति' पोर्टल, उच्च शिक्षा विभाग द्वारा विकसित, एक केंद्रीकृत मंच है जो योग्य छात्रों के लिए छात्रवृत्ति प्रक्रिया को सुविधाजनक बनाता है। यह पोर्टल उच्च शिक्षा में पहुंच, समानता और गुणवत्ता पर राज्य का ध्यान लगाने के साथ मेल खाता है। पोर्टल 7 सरकारी विभागों से 15 छात्रवृत्ति योजनाओं को समाहित करता है, छात्रवृत्ति वितरण में पहुंच, पारदर्शिता और कुशलता सुनिश्चित करते हुए।",
      description:
        'छात्रवृत्तियों के लिए आवेदन करने से पहले, PPP में नाम, जन्मतिथि, आधार नंबर आदि की नवीनीकृत विवरणों की पुष्टि करें। PMS-SC और PMS-BC योजनाओं के लिए, 1.80 से 2.50 लाख के बीच परिवार की आय वाले आवेदकों को आवेदन प्रक्रिया के दौरान SARAL पोर्टल से परिवार की आय प्रमाणपत्र डाउनलोड और अपलोड करना होगा।',
      objectives: [
        'केंद्रीकृत एंड-टू-एंड छात्रवृत्ति प्रक्रिया, जिसमें आवेदन प्रस्तुति, सत्यापन, और वितरण शामिल है। तीन-स्तरीय सत्यापन प्रणाली: संस्थान, विश्वविद्यालय/नोडल बॉडी, और मुख्य कार्यालय, जो आवेदक प्रमाणीकरण सुनिश्चित करते हैं। परिवार पहचान पत्र (PPP) योजना के साथ एकीकरण छात्रवृत्ति लाभार्थी सत्यापन के लिए। छात्रवृत्ति लाभ के लिए PPP की अनिवार्य आवश्यकता। हरियाणा के निवासी छात्रों को राज्य के बाहर पढ़ने की अनुमति, जो संबंधित विभागों द्वारा सत्यापित की गई है।',
      ],
    },
    RSSO: {
      abbreviation: 'आर.एस.एस.ओ.',
      title: 'राजस्थान सिंगल साइन-ऑन (एसएसओ) छात्रवृत्ति',
      about:
        'राजस्थान में SSO योजना छात्रों के लिए छात्रवृत्ति उपयोग को सुविधाजनक बनाती है। निवासियों को ऑनलाइन पंजीकरण के माध्यम से इस योजना के लिए आसानी से आवेदन कर सकते हैं, जहां SSO आईडी का उपयोग विभिन्न आधिकारिक सेवाओं के लिए एकल साइन-इन के रूप में होता है। इसमें श्रम कार्ड, आधार कार्ड, खाद्य सुरक्षा, सरकारी खेत, और अन्य सेवाओं का उपयोग शामिल है।',
      description:
        'राजस्थान SSO छात्रवृत्ति योजना के बारे में अधिक जानकारी चाहने वाले छात्र आधिकारिक पोर्टल https://sso.rajasthan.gov.in पर जा सकते हैं। पोर्टल पंजीकरण प्रक्रिया, पात्रता मानदंड, और SSO आईडी के माध्यम से पहुंचने वाली विभिन्न सेवाओं पर विस्तृत मार्गदर्शन प्रदान करता है, जो आवेदकों के लिए स्पष्टता और पहुंच की सुविधा को बढ़ावा देता है।',
      objectives: [
        'राजस्थान SSO पोर्टल, जिसे राज्य सरकार ने विकसित किया है, नागरिकों को विभिन्न ऑनलाइन सेवाओं तक पहुंच के लिए एक केंद्रीकृत मंच प्रदान करता है। SSO आईडी के लिए पंजीकरण करके, व्यक्ति को सरकारी सेवाओं तक पहुंच के लिए एक विशेष डिजिटल पहचान मिलती है। इसमें पंजीकरण प्रक्रिया, पात्रता मानदंड, और वेब पोर्टल पर उपलब्ध सेवाओं के विस्तृत जानकारी शामिल है।',
      ],
    },
    PMBS: {
      abbreviation: 'पी.एम.बी.एस',
      title: 'पोस्ट मैट्रिक बिहार छात्रवृत्ति',
      about:
        'बिहार सरकार ने पोस्ट मैट्रिक छात्रवृत्ति योजना की शुरुआत प्राथमिक उद्देश्य से की थी, जो छात्रों को उच्च शिक्षा का पीछा करने में सहायता और प्रोत्साहन करने के लिए है। बिहार पोस्ट मैट्रिक छात्रवृत्ति का लाभ यह है कि इसमें एससी/एसटी/बीसी/ईबीसी श्रेणियों में आने वाले छात्रों को वित्तीय सहायता प्रदान करता है, विशेष रूप से प्रोत्साहन राशि के रूप में। बिहार पोस्ट मैट्रिक छात्रवृत्ति एक वित्तीय सहायता कार्यक्रम है जो आर्थिक रूप से पिछड़े परिवारों के छात्रों को उच्च शिक्षा करने में मदद करने के लिए डिज़ाइन किया गया है। बिहार पोस्ट मैट्रिक छात्रवृत्ति की पुरस्कार राशि पाठ्यक्रम और अध्ययन के स्तर पर भिन्न होती है। छात्रवृत्ति में पाठ्यक्रम शुल्क, रक्षा भत्ता, और छात्र की शिक्षा से संबंधित अन्य खर्चों का भुगतान शामिल है।',
    },
    UPS: {
      abbreviation: 'यू. पी. एस',
      title: 'उत्तर प्रदेश छात्रवृत्ति (यूपीएस)',
      about:
        'उत्तर प्रदेश सरकार ने राज्य के छात्रों के लिए कई छात्रवृत्ति अवसर शुरू किए हैं। हर छात्रवृत्ति के अपने पात्रता मानदंड होते हैं जिन्हें छात्रों को पूरा करना होता है और छात्रवृत्ति अवसर के लिए पात्र होना होता है। उत्तर प्रदेश की छात्रवृत्तियों के लिए लागू एक प्रमुख मानदंड है कि छात्रों को उत्तर प्रदेश (यूपी) के स्थायी निवासी होना चाहिए या यूपी का निवासी प्रमाणपत्र होना चाहिए। अकादमिक योग्यता, पारिवारिक आय सीमा, आदि के अन्य पहलुओं से संबंधित पूरी जानकारी छात्रवृत्तियों के सफल आवेदन में सहायक होती है।',
    },
    MMVY: {
      abbreviation: 'एम.एम.वी.वाई.',
      title: 'मुख्यमंत्री मेधावी विद्यार्थी योजना',
      about:
        'मुख्यमंत्री मेधावी विद्यार्थी योजना मध्य प्रदेश सरकार द्वारा चलाई जाने वाली एक राज्य कार्यक्रम है। यह पुरस्कार वो छात्रों के लिए उपलब्ध है जिन्होंने 12वीं कक्षा में 70% अंक प्राप्त किए हैं और वर्तमान में स्नातक, स्नातकोत्तर या पेशेवर पाठ्यक्रमों को कर रहे हैं। छात्रवृत्ति की राशि पाठ्यक्रम से पाठ्यक्रम और कॉलेज के प्रकार के आधार पर भिन्न होती है।',
    },
    note: {
      title: 'संदेश',
      description:
        'सभी प्रकार की छात्रवृत्ति सूचनाएं विभिन्न विभागों/स्कूलों/होस्टलों में सूचना बोर्ड्स और संस्थान की वेबसाइट के माध्यम से सर्कुलेट और अपलोड की जाएंगी। छात्र को छात्रवृत्ति फार्म के सभी सहायक दस्तावेजों के साथ शैक्षणिक खंड में जमा करना आवश्यक है ताकि आवेदन की आगे की सत्यापन और फारवर्डिंग की जा सके। एक शैक्षणिक वर्ष में एक ही छात्रवृत्ति का लाभ ले सकता है। यदि किसी छात्र ने पिछले आवेदित छात्रवृत्ति में चयन नहीं होने का सबूत देकर एक से अधिक छात्रवृत्ति के लिए आवेदन किया है, तो उसे एक से अधिक छात्रवृत्ति के लिए आवेदन कर सकता है। छात्र को छात्रवृत्ति का लाभ उठाने की स्थिति के बारे में शैक्षणिक खंड को सूचित करना छात्र की जिम्मेदारी है। बाद में, किसी भी छात्र को पाया जाता है कि वह एक समय में दो छात्रवृत्तियों का लाभ उठा रहा है, तो नियमानुसार कार्रवाई की जाएगी। यहाँ अभिलेखित छात्रवृत्ति सूचनाओं को ब्राउज़ करें।',
    },
    visitPortal: 'पोर्टल में जाएं।',
    description: 'विवरण',
    about: 'परिचय',
    objectives: 'लक्ष्य',
  },
  Search: {
    placeholder: 'त्वरित खोज...',
    categories: {
      all: 'सभी परिणाम',
      clubs: 'क्लब',
      committees: 'समितियां',
      courses: 'पाठ्यक्रम',
      departments: 'विभाग',
      faculty: 'लोग',
      sections: 'खंड',
      staff: 'कर्मचारी',
    },
    viewAll: 'सारा देखें',
    default: {
      recents: 'ताज़ा खोजें',
      clearRecents: 'हाल की खोजें साफ़ करें',
      mostSearched: 'एनआईटी की सर्वाधिक खोजें',
      studentLinks: {
        title: 'छात्र संबंधित त्वरित लिंक',
        clubs: 'संघठनें',
        courses: 'पाठ्यक्रम',
        departments: 'विभाग',
        notifications: 'सूचनाएँ',
        results: 'परिणाम',
      },
      facultyLinks: {
        title: 'संकाय संबंधित त्वरित लिंक',
        notifications: 'सूचनाएँ',
        profile: 'मेरा विवरण',
      },
    },
  },
  Section: {
    about: 'परिचय',
    gallery: 'चित्र',

    Account: {
      title: 'लेखा खंड',
      about: 'Aboutहमारी जानकारी',
      reportTitle: 'वार्षिक रिपोर्ट्स',
      report: 'वार्षिक खाता',
      forms: 'फार्म',
      formsList: [
        'पेंशन जीवन प्रमाण पत्र',
        'आईडीबीआई बैंक कुरुक्षेत्र से पेंशन संवितरण',
        'स्व-प्रमाणन के लिए LTC प्रदर्शन',
        'चिकित्सा प्रतिपूर्ति प्रपत्र',
        'एनपीएस पंजीकरण फॉर्म',
        'एनपीएस के लिए नामांकन फॉर्म',
        'गैर-वापसी योग्य अग्रिम GPF फ़ॉर्म',
        'वापसी योग्य अग्रिम GPF फ़ॉर्म',
        'पैन आधार अपडेशन फॉर्म',
        'अग्रिम निकासी के लिए प्रोफार्मा',
        'टीए बिल',
        'टेलीफोन प्रतिपूर्ति',
        'विक्रेताओं के लिए बैंक खाता विवरण',
        'कर्मचारियों/छात्रों/पेंशनर्स/पूर्व-छात्रों के लिए बैंक खाता विवरण',
      ],

      quickLinksTitle: 'त्वरित लिंक',
      quickLinks: ['ईएमएस कर्मचारी लॉगिन परिचय', 'ऑनलाइन शुल्क भुगतान'],
    },
    Library: {
      name: 'केंद्रीय पुस्तकालय',
      heading: {
        about: 'के बारे में',
        totalAreaLibraryHours: 'कुल क्षेत्र और पुस्तकालय का समय',
        facilities: 'सुविधाएँ',
        quickLinks: 'त्वरित लिंक्स',
        contactUs: 'संपर्क करें',
        gallery: 'गैलरी',
        libraryHours: 'पुस्तकालय का समय',
        totalFloorArea: 'कुल फ़्लोर क्षेत्र और पढ़ाई का स्थान',
        totalFloorAreaText:
          'पुस्तकालय एक बढ़ते हुए जीव है। सभी आवश्यकताओं को पूरा करने के लिए, पर्याप्त जगह स्टैकिंग, पढ़ाई और अन्य सेवाओं के लिए जोड़ी गई है। पुस्तकालय में 500 पाठकों की पढ़ाई करने की क्षमता है और नए दस्तावेज़ों, एक डिजिटल पुस्तकालय और ऑडियो-वीजुअल केंद्र को स्टैक करने के लिए पर्याप्त जगह है। वर्तमान में पुस्तकालय का कुल क्षेत्र 36711 वर्ग फ़ुट है।',
        libraryHoursText: `पढ़ाई की सुविधाएँ: 24x07x365
स्टैक और परिपत्र:
सभी काम के दिन: सुबह 08:30 से शाम 05:30 बजे तक
शनिवार और अवकाश: सुबह 09:00 से शाम 05:00 बजे तक`,
        aboutText:
          'पुस्तकालय, प्रारंभ में 1965 में स्थापित किया गया, आकार, संग्रह और सेवाओं में बढ़ गया है। वर्तमान में, NIT कुरुक्षेत्र में एक बहुत बड़ा पुस्तकालय है जिसमें टेक्स्ट और संदर्भ पुस्तकें, सीडी-आरओएम, और एक बड़ी संख्या में प्रिंट और ऑनलाइन पत्रिकाएँ और ई-पुस्तकें शामिल हैं। अपने वृद्धि श्रोत, जगह, और सेवाओं के साथ, पुस्तकालय शिक्षकों, अनुसंधानकर्ताओं, विद्यार्थियों की आवश्यकताओं को पूरा करता है।',
      },
      facilities: {
        bookBankFacilities: 'पुस्तक बैंक सुविधाएँ',
        libraryAutomation: 'पुस्तकालय स्वचालन प्रणाली, वेब-ओपेक, और परिपत्र',
        audioVideoCenter: 'ऑडियो-वीडियो केंद्र',
        jGatePlus: 'जेगेट प्लस',
        nptel: 'एनपीटीईईएल वेब और वीडियो पाठ्यक्रम',
        remoteAccess: 'दूरस्थ पहुंच सेवा: केएनआईएमबीयूएस',
        antiPlagiarism: 'खोजफलस्ती प्रतिलिपि नकल रोकथाम सॉफ़्टवेयर (टर्निटिन)',
        bookBankFacilitiesText:
          'पुस्तक बैंक पुस्तक बैंक की सबसे धनी है। सभी बी. टेक, एम.टेक, एमबीए और एमसीए छात्रों को पूरे सेमेस्टर के लिए 6-8 पुस्तकें बुक बैंक से दी जाती हैं।',
        libraryAutomationText:
          'पुस्तकालय कोहा सॉफ़्टवेयर का उपयोग करके पुस्तकालय के सभी खंडों में स्वचालित सेवाएँ प्रदान कर रहा है। सभी पुस्तकें बार-कोड किए गए हैं, और सदस्यों को बार-कोड सदस्यता कार्ड भी दिया जाता है ताकि पुस्तकालय में दस्तावेजों की चक्कियां स्मूद रूप से हो सकें। पुस्तकालय का डेटाबेस नियमित रूप से अपडेट किया जाता है, और पाठक वेब-ओपेक (ऑनलाइन सार्वजनिक पहुंच सूची) का उपयोग करके दस्तावेज़ों की खोज कर सकते हैं।',
        audioVideoCenterText:
          'पुस्तकालय में संपूर्ण एयर-संचालित ऑडियो-वीडियो केंद्र है जो सेमिनार, सम्मेलन, मेहमान व्याख्यान, उपयोगकर्ता जागरूकता कार्यक्रम आदि के लिए सीटिंग क्षमता 100 प्रतिभागियों के साथ है। यह वीडियो कॉन्फ्रेंसिंग सुविधा से भी संपन्न है।',
        jGatePlusText:
          'जेगेट कस्टम सामग्री के लिए संघ (जेसीसी) एक वर्चुअल पुस्तकालय है जो एक अनुकूलित ई-पत्रिका पहुंच गेटवे और डेटाबेस समाधान के रूप में बनाया गया है। यह एक बिंदु पहुंच प्रदान करता है 7900+ पत्रिकाओं को जिन्हें वर्तमान में यूजीसी इंफोनेट डिजिटल पुस्तकालय संघ द्वारा सदस्यता लिया गया है साथ ही उन विश्वविद्यालयों को भी सूचीबद्ध किया है जो अंतर पुस्तकालय ऋण (आईएलएल) केंद्र के रूप में निर्दिष्ट हैं साथ ही ओपन एक्सेस पत्रिकाओं की सूची।',
        nptelText:
          'पुस्तकालय ने आईआईटी, चेन्नई द्वारा डिज़ाइन और विकसित किए गए विभिन्न इंजीनियरिंग और विज्ञान विषयों में एनपीटीईईएल वेब और वीडियो पाठ्यक्रम प्राप्त किए हैं जिनका उपयोग शिक्षकों, अनुसंधान छात्रों और छात्रों के लिए किया जा सकता है। प्रयोक्ता इन वीडियो कोर्सेज का उपयोग पुस्तकालय संग्रह सर्वर के माध्यम से कर सकते हैं:',
        remoteAccessText:
          'पुस्तकालय को सदस्यता प्राप्त ई-संसाधनों की बाहरी पहुंच प्रदान करने के लिए, पुस्तकालय ने KNIMBUS सेवा की सदस्यता ली है। उपयोक्ता अपना खाता बना सकते हैं या तो nitkkr.knimbus.com पर जाकर या हमें librarian@nitkkr.ac.in पर लिखकर। खाता बनाने के बाद, उपयोक्ता लॉग इन कर सकते हैं और कहीं से भी सभी ई-संसाधनों का उपयोग कर सकते हैं।',
        antiPlagiarismText:
          'पुस्तकालय ने सभी शिक्षकों, अनुसंधान छात्रों और छात्रों के लिए खोजफलस्ती सॉफ़्टवेयर टर्निटिन की सदस्यता ली है। उपयोक्ता इस सुविधा का उपयोग करके अपने अनुसंधान पत्र, लेख, थीसिस, डिसर्टेशन आदि की अनुप्रयोग की जांच कर सकते हैं।',
      },
      quickLinks: {
        collectionResources: 'संग्रह और संसाधन',
        libraryCommittee: 'पुस्तकालय समिति',
        membershipPrivileges: 'सदस्यता विशेषाधिकार',
      },
      contactUs: {
        name: 'नाम',
        designation: 'पद और योग्यता',
        phoneNumber: 'फ़ोन नंबर',
        email: 'ईमेल',
      },
      libraryCommittee: {
        libraryCommitteeTitle: 'पुस्तकालय समिति',
        srNo: 'क्रमांक',
        name: 'नाम',
        generalDesignation: 'सामान्य पद',
        libraryCommitteeDesignation: 'पुस्तकालय समिति का पद',
      },
      CollectionAndResources: {
        title: 'संग्रह और संसाधन',
        totalDocuments: 'कुल दस्तावेज़',
        noOfDocuments: '1,72,237',
        totalBooks: 'पुस्तकालय की पुस्तकें',
        noOfBooks: '54,325',
        bookBank: 'पुस्तक बैंक',
        backSets: 'पिछले सेट्स',
        standards: 'मानक',
        cdsDvds: 'सीडी / डीवीडी',
        eBooks: 'ई-बुक्स',
        thesis: 'थीसिस',
        noOfBookBank: '81,259',
        noOfBackSets: '7,097',
        noOfStandards: '10,097',
        noOfCdsDvds: '832',
        noOfEBooks: '12,272',
        noOfThesis: '6,355',
        eresources: {
          title: 'ई-संसाधन',
          currentJournalsHeading: 'वर्तमान पत्रिकाएँ',
          currentJournalsDescription:
            'पुस्तकालय विज्ञान और प्रौद्योगिकी के क्षेत्र में 45 प्रिंट और लगभग 4200+ ऑनलाइन पत्रिकाओं की सदस्यता लेता है। पुस्तकालय में कई नि: शुल्क प्रतियां भी मिलती हैं। इन पत्रिकाओं की सूची पुस्तकालय के अवधारणा खंड में प्रदर्शित की जाती है और पुस्तकालय की अंतरजाल साइट के माध्यम से भी देखी जा सकती है: http://172.16.0.52',
          eShodhSindhuHeading: 'ई-शोध सिंधु (ईएसएस)',
          eShodhSindhuDescription:
            'एनआईटीकेके पुस्तकालय मानव संसाधन विकास मंत्रालय द्वारा स्थापित ई-शोध सिंधु संघ का मूल सदस्य है। प्रस्तुति में संघ द्वारा लगभग 4200+ ई-संसाधन सदस्यता में लेने/ प्रदान किए जा रहे हैं। संस्थान के परिसर में ऑनलाइन संसाधनों तक पहुंच करने के लिए, पुस्तकालय एक आंतरिक रूप से बनाए रखे गए वेब सर्वर के माध्यम से सेवाएं प्रदान कर रहा है। सभी इन संसाधनों/ई-पत्रिकाओं का उपयोग पुस्तकालय अंतरजाल साइट के माध्यम से किया जा सकता है: http://172.16.0.52',
        },
        eResourcesTable: {
          heading: {
            srno: 'क्रमांक',
            electronicResources: 'इलेक्ट्रॉनिक संसाधन',
            url: 'यूआरएल',
          },
        },
      },
      MembershipPrivileges: {
        title: 'सदस्यता और विशेषाधिकार',
        membershipPrivilegesText:
          'इंस्टीट्यूट के छात्र, संकाय अध्यापक, शोधार्थी और कर्मचारी पुस्तकालय के सदस्य के रूप में स्वीकृत होते हैं। पुस्तकालय सदस्यता प्रपत्र पुस्तकालय के परिसर में परिसर में उपलब्ध और जमा किए जा सकते हैं। प्रत्येक श्रेणी के सदस्यों द्वारा उधारण की जाने वाली पुस्तकों की संख्या और ऋण की अवधि निम्नलिखित है:',
        privileges: {
          title: 'विशेषाधिकार',
          conditionOnLoan: 'ऋण पर शर्तें',
          conditionOnLoanOne:
            'पुस्तकालय उन सदस्यों को जो ऋण की दिनांक से पहले ही पुस्तक को वापस लौटा देने का अधिकार रखता है।',
          conditionOnLoanTwo:
            'संदर्भ पुस्तकें, थीसिस और अन्य विशेष पठन सामग्री को सदस्यों को सामान्यत: उधारने की अनुमति नहीं होगी।',
          conditionOnLoanThree:
            'समाचार-पत्रिकाओं के बाउंड / अनबाउंड महीनों को केवल शिक्षकों को ही उधारा जाएगा। हालांकि, नवीनतम मुद्रण को उधार नहीं दिया जाएगा।',
          conditionOnLoanFour:
            'सदस्यों को पुस्तकालय की पुस्तकों को या तो समय से पहले या समय पर वापस करना चाहिए, विफलता के मामले में पहले 15 दिनों के लिए प्रति दिन प्रति पुस्तक रु. 1.00 वसूला जाएगा, और इसके बाद, प्रति दिन प्रति पुस्तक 2.00 रुपये लिया जाएगा।',
          lossOfBooks: 'पुस्तकों का हानि',
          lossOfBooksDescription:
            'सदस्यों को उनके द्वारा खोई गई पुस्तकों को पुनः स्थानांतरित करना होगा या उन्हें पुस्तक की कीमत का दोगुना देना होगा। यदि खोई गई पुस्तक सेट का हिस्सा है और स्वतंत्र रूप से उपलब्ध नहीं है, तो सदस्यों को पूरे सेट को बदलना होगा या सेट की कीमत का दोगुना देना होगा।',
          careOfBooks: 'पुस्तकों की देखभाल',
          careofBooksDescriptionOne:
            'पुस्तकालय की पुस्तकें केवल वर्तमान ही नहीं, बल्कि पुस्तकालय के भविष्य के सदस्यों के लाभ के लिए हैं। इसलिए, इन्हें पूरी देखभाल और विचारशीलता के साथ संचालित किया जाना चाहिए।',
          careofBooksDescriptionTwo:
            'पुस्तकों का क्षति करना और उन्हें बिगाड़ना काफी आपत्तिजनक है और सदस्यता की प्रिविलेजेज की रद्दी और नई पुस्तक द्वारा नुकसान की प्रतिस्थापना की ओर ले जा सकता है।',
          otherFacilities: 'अन्य सुविधाएं',
          reprographicFacilities: 'रिप्रोग्राफिक सुविधाएं:',
          reprographicFacilitiesDescription:
            'रिप्रोग्राफिक सुविधाएं: पाठकों को रिप्रोग्राफिक सेवाएं प्रदान करने के लिए एक ठेकेदार नियुक्त किया गया है। पुस्तकों, पत्रिकाओं और अन्य सामग्री से प्रतिलिपि प्रस्तुत की जाती है @ 60 पैसे प्रति प्रति।',
          binding: 'बाइंडिंग:',
          bindingDescription:
            'पुस्तकालय के पास अपना बाइंडरी है, जो पुस्तकालय पुस्तकों, और कॉलेज रिपोर्ट्स को बाँधता है और विभिन्न विभागों और संस्थान के अन्य खंडों के लिए बाइंडिंग का कार्य करता है। पुस्तकालय को कटाई, सिलाई, घुटने करने, स्पायरल बाइंडिंग और लेमिनेशन मशीनों से सम्पन्न किया गया है।',
        },
      },
    },

    CentralWorkshop: {
      title: 'केंद्रीय कार्यशाला',
      organization:
        'केंद्रीय कार्यशाला इंजीनियरिंग के सभी विषयों के लिए संस्थान की केंद्रीय सुविधा है। इसे निम्नलिखित जिम्मेदारी सौंपी गई है।',
      organizationSub: '',
      organizationDetails: [
        'सभी विषयों के प्रथम वर्ष के छात्रों, उत्पादन और औद्योगिक इंजीनियरिंग और मैकेनिकल अनुशासन के द्वितीय वर्ष और तीसरे वर्ष के छात्रों को प्रशिक्षण प्रदान करना।',
        'मशीन को चलाने और संसाधन का इस्तेमाल करने की शॉप, पैटर्न शॉप, फाउंड्री शॉप, वेल्डिंग शॉप, उत्पादन प्रौद्योगिकी प्रयोगशाला और उन्नत विनिर्माण प्रयोगशाला और दृश्य प्रदर्शन द्वारा अन्य निर्माण प्रक्रिया में उपकरणों के उपयोग के लिए अनुभव प्रदान करना।',
        'छात्रों को औद्योगिक कार्य संस्कृति के वास्तविक व्यवहार और कठिनाई को समझने में मदद करता है।',
        'विभिन्न विनिर्माण प्रक्रियाओं में छात्रों के विश्वास का निर्माण करने में मदद करता है।',
      ],
      services: 'सेवाएं',
      servicesSub: 'सहायता/ सहयोग प्रदान करना',
      servicesDetails: [
        'परियोजना कार्य के लिए – स्नातक / स्नातकोत्तर छात्र।',
        'अनुसंधान कार्य – पीएचडी छात्र।',
        'संस्थान के वाहनों के रखरखाव की देखभाल करना।',
        'संस्थान के फर्नीचर की मरम्मत और रखरखाव का काम देखता है।',
      ],
      tableTitle: {
        sno: 'क्रमिक संख्या',
        name: 'मशीन नाम',
        quantity: 'मात्रा',
      },
      miscTitle: 'मापने के उपकरण/उपकरण का नाम',
      facilities: {
        title: 'सुविधाएँ',
        sub: 'केंद्रीय कार्यशाला में निम्नलिखित पूरी तरह से सुसज्जित शॉप शामिल हैं।',
        data: [
          { name: 'मशीन शॉप', quantity: '29' },
          { name: 'उत्पादन प्रौद्योगिकी प्रयोगशाला', quantity: '17' },
          { name: 'फिटिंग शॉप', quantity: '3' },
          { name: 'पैटर्न मेकिंग शॉप', quantity: '9' },
          { name: 'फाउंड्री शॉप', quantity: '20' },
          { name: 'वेल्डिंग शॉप', quantity: '21' },
          { name: 'केम लैब', quantity: '1' },
        ],
      },
      equipmentDetails:
        'डिजिटल वर्नियर कैलिपर, बोर गेज, लीवर प्रकार डायल संकेतक, संपर्क रहित टैकोमीटर, सिंपल / डिजिटल माइक्रोमीटर, साइन बार 10 “, ग्रेनाइट तुलनित्र स्टैंड और समायोज्य स्नैप गेज।',
      machineShop: {
        title: 'मशीन शॉप',
        data: [
          { name: 'लेथ मशीन', quantity: '09' },
          { name: 'सीo एमo टीo लेथ LB-17', quantity: '07' },
          { name: 'किरलोस्कर लेथ', quantity: '05' },
          { name: 'पावर हक्सॉ', quantity: '01' },
          { name: 'क्षैतिज मिलिंग मशीन', quantity: '01' },
          { name: 'लंबवत मिलिंग मशीन', quantity: '01' },
          { name: 'टूल और कटर ग्राइंडर', quantity: '01' },
          { name: 'डीo ईo पेडस्टल ग्राइंडर', quantity: '01' },
          { name: 'रेडियल ड्रिल', quantity: '01' },
          { name: 'शेपर 24”', quantity: '01' },
          { name: 'धातु काटने की मशीन', quantity: '01' },
        ],
        miscDetails:
          'डिजिटल वर्नियर कैलिपर, बोर गेज, लीवर प्रकार डायल संकेतक, संपर्क रहित टैकोमीटर, सिंपल / डिजिटल माइक्रोमीटर, साइन बार 10 “, ग्रेनाइट तुलनित्र स्टैंड और समायोज्य स्नैप गेज।',
      },
      productionShop: {
        title: 'उत्पादन प्रौद्योगिकी प्रयोगशाला',
        data: [
          { name: 'सिलिंडरीक्ल ग्राइंडर', quantity: '01' },
          { name: 'रेडियल ड्रिलिंग', quantity: '01' },
          { name: 'लंबवत मिलिंग', quantity: '01' },
          { name: 'यूनिवर्सल मिलिंग', quantity: '01' },
          { name: 'गियर हॉबिंग', quantity: '01' },
          { name: 'क्षैतिज मिलिंग', quantity: '01' },
          { name: 'स्तंभ प्रकार ड्रिल', quantity: '01' },
          { name: 'ड्रिल मशीन 1 ”', quantity: '01' },
          { name: 'एचएमटी लेथ (एनएच -22)', quantity: '01' },
          { name: 'अग्रणी लेथ', quantity: '04' },
          { name: 'ईडीएम मशीन', quantity: '01' },
          { name: 'ड्रिल मशीन ½”', quantity: '01' },
          { name: 'धातु काटने की मशीन', quantity: '01' },
          { name: 'कोबरा पावर हैकसॉ', quantity: '01' },
        ],
        miscDetails:
          'सिंपल/डिजिटल वर्नियर कैलिपर, समायोज्य स्नैप गेज, बोर गेज, लीवर प्रकार डायल सूचक, सिंपल /डिजिटल माइक्रोमीटर और डायल सूचक।',
      },
      fittingShop: {
        title: 'फिटिंग शॉप',
        data: [
          { name: 'पावर हैकसॉ', quantity: '01' },
          { name: 'ड्रिल मशीन 25 मिमी', quantity: '01' },
          { name: 'ड्रिल मशीन 20 मिमी', quantity: '01' },
        ],
        miscDetails:
          'सिंपल/डिजिटल वर्नियर, सिंपल /डिजिटल माइक्रोमीटर, सिंपल /डिजिटल वर्नियर ऊंचाई गेज, सरफेस प्लेट्स और बेंच वाइस।',
      },
      patternShop: {
        title: 'पैटर्न मेकिंग शॉप',
        data: [
          { name: 'मोटर के साथ बैंड आरा मशीन', quantity: '01' },
          { name: 'लकड़ी परिपत्र कटर जीसीएम', quantity: '01' },
          { name: 'प्लेन सैंडर GSS140A', quantity: '01' },
          { name: 'प्लानर जीएचओ 10-82', quantity: '01' },
          { name: 'लकड़ी कटर GTS-10', quantity: '01' },
          { name: 'वुड वोर्किंग लेथ', quantity: '01' },
          { name: 'रोटरी हाथ हथौड़ा ड्रिल', quantity: '01' },
          { name: 'ड्रिल मशीन 20 मिमी', quantity: '01' },
          { name: 'ग्राइंडर मशीन', quantity: '01' },
        ],
        miscDetails:
          'बेंच वाइस, विभिन्न प्रकार की फाइलें, विभिन्न प्रकार के आरी और विभिन्न प्रकार के प्लेंस।',
      },
      foundryShop: {
        title: 'फाउंड्री शॉप',
        data: [
          { name: 'एल्यूमीनियम पिघलने वाली भट्टी', quantity: '01' },
          { name: 'डिजिटल सीव शेकर', quantity: '01' },
          { name: 'सीव शेकर', quantity: '01' },
          { name: 'खुला चूल्हा ब्लोअर', quantity: '01' },
          { name: 'कपला भट्टी', quantity: '01' },
          { name: 'यूनिवर्सल रेत परीक्षण मशीन', quantity: '02' },
          { name: 'पारगम्यता मीटर', quantity: '02' },
          { name: 'हाथ मोल्डिंग मशीन', quantity: '01' },
          { name: 'नमी परीक्षक', quantity: '01' },
          { name: 'हरी कठोरता परीक्षक', quantity: '01' },
          { name: 'भार पैमाना', quantity: '01' },
          { name: 'नमी परीक्षक', quantity: '01' },
          { name: 'संपीड़न शक्ति परीक्षण', quantity: '01' },
          { name: 'उच्च तापमान ट्यूबलर भट्ठी', quantity: '01' },
          { name: 'कंपन नियंत्रण के साथ ग्राइंडर', quantity: '01' },
          { name: 'सीधी ग्राइंडर', quantity: '01' },
          { name: 'रैपिड रेत वाशिंग मशीन', quantity: '01' },
          { name: 'इलेक्ट्रिक रिड्ल', quantity: '01' },
        ],
      },
      weldingShop: {
        title: 'वेल्डिंग शॉप',
        data: [
          { name: 'हाथ कतरनी मशीन', quantity: '01' },
          { name: '½ ”पोर्टेबल ड्रिल मशीन', quantity: '01' },
          { name: 'पोर्टेबल शीट धातु कतरनी मशीन', quantity: '01' },
          {
            name: 'निबलर (शीट मेटल प्रोफाइल कटिंग मशीन पोर्टेबल)',
            quantity: '01',
          },
          { name: 'पोर्टेबल जिग-जग प्रोफाइल काटने की मशीन', quantity: '01' },
          { name: 'पोर्टेबल चॉप-सॉ मशीन', quantity: '01' },
          { name: 'टिग वेल्डिंग सेट (25-250A)', quantity: '01' },
          { name: 'मिग वेल्डिंग सेट (25-250A)', quantity: '03' },
          { name: 'एसी आर्क वेल्डिंग ट्रांसफार्मर', quantity: '01' },
          { name: 'मिग वेल्डिंग', quantity: '02' },
          { name: 'पावर हैकसॉ', quantity: '01' },
          { name: 'पेडस्टल ग्राइंडर 200/250 मिमी', quantity: '01' },
          { name: 'बॉश मेटल कटिंग चॉप आरी', quantity: '01' },
          { name: 'शंट टाइप वेल्डिंग रेक्टीफायर (TSR-300)', quantity: '01' },
          {
            name: 'पोर्टेबल ऑयल कूल्ड ट्रांसफॉर्मर (2/300 ST)',
            quantity: '01',
          },
          { name: 'वेल्डिंग पोस्टियनर / मैनिपुलेटर (MH-500)', quantity: '01' },
          { name: 'चुंबकीय दरार डिटेक्टर मानक सामान', quantity: '01' },
          { name: 'सबमर्जड आर्क वेल्डिंग मशीन', quantity: '01' },
        ],
      },
      camLabs: {
        title: 'केम लैब',
        data: [{ name: 'एम्स प्रणाली', quantity: '01' }],
      },
      staffTitle: '  प्रशासनिक और तकनीकी कर्मचारी:',
      staffTableTitle: {
        name: 'नाम',
        designation: 'पदनाम',
      },
    },
    CentreOfComputingAndNetworking: {},
    ElectricalMaintenance: {},
    Estate: {
      name: `संपदा`,
      links: [
        'आवास आवंटन नियम 2014',
        'आवास आवंटन नियम 2017',
        'दर सूची',
        'ऑनलाइन शिकायत',
      ],
      headings: [
        `के बारे में`,
        'भवन और कार्य समिति',
        'संपदा अनुभाग की समितियाँ',
        'परिसर और उपलब्ध अवसंरचना का विवरण',
        'परियोजनाएँ',
        'संपदा अनुभाग का संगठन चार्ट',
        'हाउस आवंटन नियम 2014 और 2017',
        'दर सूची',
        'वरिष्ठता सूची',
      ],
      subheadings: [
        'भूमि प्रबंधन समिति (EAC)',
        'अंतरिक्ष आवंटन समिति (SAC)',
        'प्रगति समीक्षा समिति (PRC)',
        'लाइसेंसिंग समिति (LC)',
        'गृह आवंटन समिति (HAC) – शिक्षण स्थल',
        'गृह आवंटन समिति (HAC) – गैर-शिक्षण स्थल कर्मचारी',
        'सामान्य बुनियादी संरचना के विवरण',
        'शैक्षिक क्षेत्र',
        'हॉस्टल क्षेत्र',
        'लड़कों के हॉस्टल (UG + PG)',
        'लड़कियों के हॉस्टल',
        'निवासीय क्षेत्र',
        'सहायक सुविधाएँ',
        'पिछले तीन वर्षों में पूर्ण हुए परियोजनाएं',
        'चल रही परियोजनाएँ',
        'भविष्य की परियोजनाएँ',
      ],

      about: [
        `एस्टेट धारा नए भवनों और अन्य बुनियादी सुविधाओं के सिविल & रखरखाव के निर्माण में शामिल किया जाता है ; बिजली के काम करता है , बागवानी & बागवानी के काम करता है , साफ-सफाई & साफ-सफाई काम करता है और कुशल, semiskilled , अकुशल विभिन्न वर्गों / संस्थान के विभागों में आवश्यक श्रमिकों की आउटसोर्सिंग । और यह भी कि घरों , फर्नीचर और भूमि, दुकानों & के पट्टे के आवंटन के बारे में रिकॉर्ड बनाए रखने ; कैंटीन और माल के सभी प्रकार बनाए रखें। प्रो आई / सी ( स्वच्छता & साफ-सफाई ), प्रो आई / सी ( विद्युत रखरखाव) और प्रो ; खंड डीन ( एस्टेट ), जो प्रो आई / सी ( निर्माण एस्टेट और एएमपी) द्वारा सहायता प्रदान की है के नेतृत्व में है आई / सी (बागवानी & बागवानी )।`,
        `कार्यालय का काम है जो वरिष्ठ लेखाकार , सहायक एसजी मैं & द्वारा सहायता प्रदान की है अधीक्षक एसजी – द्वितीय की देखरेख के द्वारा किया जाता है; परिचर। तकनीकी काम सहायक अभियंता ( सिविल) & के नेतृत्व में है ; सहायक अभियंता ( इलेक्ट्रोनिक ।)। सहायक अभियंता ( सिविल) सह एस्टेट ऑफिसर दो जूनियर इंजीनियर (सिविल) & द्वारा समर्थित है; एक जूनियर इंजीनियर (मैकेनिकल) और सहायक अभियंता ( इलेक्ट्रोनिक ।) एक जूनियर इंजीनियर के द्वारा समर्थित है ( इलेक्ट्रोनिक ।)।   विभिन्न रखरखाव कार्यों के लिए बजट आवश्यकताओं गैर योजना अनुदान के माध्यम से मिले हैं। नए कार्यों के बजटीय आवश्यकता इस वर्ष की योजना के अनुदान से मुलाकात की है। एस्टेट धारा के अगले 25 साल के लिए रोड मैप संस्थान के भविष्य के विस्तार को देखते हुए केन्द्रीय लोक निर्माण विभाग द्वारा तैयार की जा रही है।`,
      ],
      project: {
        completed: [
          '1. 96 बियरर्स को आसक्ति करने के लिए 2 ब्लॉकों से मिलकर बने 3 मंजिले बियरर बैरेक का निर्माण।',

          '2. दो संस्थान मुख्य गेट्स की प्रावधानी।',
          '3. लगभग 800 मीटर लंबी क्षेत्र में सीमा दीवार (बचे हुए टुकड़ों में) और गेट (UHBVN कार्यालय के पास) का निर्माण।',

          '4. हॉस्टल नंबर 1 से 9 तक के लड़कों के हॉस्टल, गर्ल्स हॉस्टल नंबर 1 और 2 में सोलर वॉटर हीटिंग प्रणाली में ठंडे पानी टैंक आपूर्ति पाइप लाइन का स्थापना।',

          '5. निवास, हॉस्टल और शैक्षिक भवन में सी.आई./ए.सी. जल आपूर्ति लाइनों की केंट्रीफ़्यूगली कास्ट (स्पन) आयरन पाइप्स क्लास एल.ए. में बदलाव।',

          '6. निवासीय कैम्पस और संस्थागत क्षेत्र में मौजूदा सड़कों के पुनर्नवीकरण और विस्तार की प्रावधान।',
          '7. स्विमिंग पूल का निर्माण।',

          '8. 600 सीटर गर्ल्स हॉस्टल का निर्माण (मल्टी-स्टोरीड फ्रेम्ड स्ट्रक्चर, ग्राउंड फ्लोर + 5)।',
          '9. सीवेज ट्रीटमेंट प्लांट (एसटीपी) का निर्माण।',
          '10. सुरक्षा के उद्देश्य से संस्थान की सीमा पर कॉन्सर्टीना कोइल का प्रदान।',
          '11. NIT, कुरुक्षेत्र में संस्थान के विभिन्न स्थानों पर स्थायी / अस्थायी हट्स की प्रावधान।',

          '12. स्पोर्ट्स ग्राउंड और विभिन्न अन्य स्थानों पर 16/20 मीटर उच्च मास्ट लाइट्स का प्रदान और स्थापना।',
          '13. संस्थान में शिक्षण संबंधी भवनों और संबंधित सुविधाओं के विभिन्न स्थानों पर डीजी पावर बैकअप की प्रावधान।',
          '14. बॉय्ज और गर्ल्स हॉस्टल में डीजी पावर बैकअप की प्रावधान।',
          '15. संस्थान में मौजूदा एलटी पैनल्स की एमसीबी के साथ बदलाव।',

          '16. NIT, कुरुक्षेत्र में मेगा बॉय्ज हॉस्टल (1000 क्षमता) में एविएशन लाइट और लाइटनिंग कंडक्टर की प्रावधान।',
          '17. गैर-निवासीय क्षेत्र में इलेक्ट्रिकल सब-स्टेशन एचटी/एलटी वितरण का प्रदान और सड़क लाइटिंग और फीडर पिलर आदि की स्थापना।',
        ],
        ongoing: [
          '1. NITK के संस्थान मास्टर प्लान की तैयारी।',

          '2. विदेशी छात्रों, अनुसंधान विद्यार्थियों और विवाहित पीजी छात्रों के लिए 300 सीटर मल्टीपर्पज़ बॉय्स हॉस्टल का निर्माण (मल्टी-स्टोरीड फ्रेम्ड स्ट्रक्चर, ग्राउंड फ्लोर + 5)।',

          '3. NIT, कुरुक्षेत्र में शैक्षिक भवन में मौजूदा इलेक्ट्रिकल वायरिंग की बदलाव।',

          '4. आवासीय क्षेत्र में इलेक्ट्रिकल सब-स्टेशन एचटी/एलटी वितरण और फीडर पिलरों का प्रदान और स्थापना।',

          'हॉस्टल (मल्टी-स्टोरीड) आरसीसी फ्रेम्ड स्ट्रक्चर (ग्राउंड + 5) में किचन उपकरण प्रदान करना।',
        ],
        future: [
          '1. संस्थान में विकलांग व्यक्तिओं (PwD) के लिए लिफ्ट्स की प्रावधान।',

          '2. बोर्ड रूम, गोल्डन जुबली प्रशासनिक भवन में ऑडियो सिस्टम प्रदान करना, जिसमें जुबली हॉल और सीनेट हॉल शामिल हैं।',

          '3. पुराने बॉयज हॉस्टल नंबर 1 से 6 और गर्ल्स हॉस्टल नंबर 1 में सामान्य कक्ष, डाइनिंग हॉल, वार्डन कार्यालय और एमएमसीए कार्यालय में फ्लोर फर्निशिंग टाइल्स से सजावट करना।',

          '4. नॉन-टीचिंग स्टाफ क्लब में स्थित एफ-टाइप क्वार्टर्स के लिए वेरंडा का निर्माण प्रावधान।',
          '5. स्पोर्ट्स कॉम्प्लेक्स में इंडोर बैडमिंटन हॉल का निर्माण।',

          '6. स्पोर्ट्स कॉम्प्लेक्स सीढ़ियों को आवरण करने के लिए शेड का निर्माण।',

          '7. पश्चिम की ओर अंतरिक्ष सीमा दीवार के पास गोल्डन जुबली प्रशासनिक भवन तक पहुँच प्रदान करके सोने की जुबली प्रशासनिक भवन को एक्सेस प्रदान करना।',

          '8. NIT मार्केट के पास मौजूदा पार्किंग में केवल चार पहिया वाहनों के लिए शेड का निर्माण प्रावधान।',

          '9. NIT, कुरुक्षेत्र के बॉय्ज और गर्ल्स हॉस्टल के डाइनिंग हॉल में एयर कंडीशनिंग प्रदान करना।',

          '10. कंप्यूटर एप्लीकेशन विभाग के मौजूदा भवन पर अतिरिक्त मंजिल का निर्माण।',
          '11. लैब्स कॉम्प्लेक्स का निर्माण (जी+5)।',

          '12. कंप्यूटर इंजीनियरिंग विभाग के मौजूदा भवन पर अतिरिक्त मंजिल का निर्माण।',

          '13. ईसीई विभाग के मौजूदा भवन के 2 नंबर फ्लोर पर अतिरिक्त 3 नंबर लेक्चर हॉल और इलेक्ट्रॉनिक्स एंड कम्युनिकेशन इंजीनियरिंग विभाग के मौजूदा भवन पर अतिरिक्त मंजिल का निर्माण।',

          '14. मौजूदा 12 नंबर लेक्चर हॉल कंप्लेक्स पर अतिरिक्त 6 नंबर लेक्चर हॉल का निर्माण।',
          '15. मौजूदा एबी ब्लॉक पर अतिरिक्त मंजिल का निर्माण।',
          '16. परीक्षा हॉल के मौजूदा भवन पर अतिरिक्त मंजिल का निर्माण।',

          '17. मौजूदा पुराने एमबीए ब्लॉक (नया वर्कशॉप बिल्डिंग) पर अतिरिक्त मंजिल का निर्माण।',

          '18. पुराने एमबीए ब्लॉक से 12 नंबर लेक्चर हॉल कंप्लेक्स और एमबीए/एमसीए भवन के बीच निर्माण विस्तारित कोरिडोर का निर्माण।',
          '19. जिमनेशियम हॉल का निर्माण।',
          '20. समुदाय केंद्र/सम्मेलन/SAC का निर्माण।',

          '21. सुरक्षा और रखरखाव के उद्देश्य से संस्थान की बाह्य सीमा दीवार के साथ पेरिफरल रोड प्रदान करना',

          '22. शिक्षक/अधिकारी के लिए मल्टी-स्टोरीड बिल्डिंग का निर्माण, जिसमें 40 अपार्टमेंट्स होंगे',

          '23. गैर-शिक्षण स्टाफ के लिए मल्टी-स्टोरीड 20 नंबर टाइप-II और 20 नंबर टाइप-III क्वार्टर्स का निर्माण',

          '24. NIT, कुरुक्षेत्र में 33/11KV सब-स्टेशन का निर्माण, स्थापना और कमीशनिंग',

          '25. सभी पुराने बॉयज, गर्ल्स हॉस्टल और आवासीय क्षेत्र में रिवायरिंग की जगह पर नई तार की बदलाव',
          '26. कला केंद्र का निर्माण',

          '27. अतिरिक्त लेक्चर हॉल कॉम्प्लेक्स का निर्माण (18 नंबर लेक्चर हॉल)',
        ],
      },
      seniority: [
        '09.04.2024 आवास के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3353/161 दिनांक 12.03.2024 के खिलाफ',

        '23.01.2024 वरिष्ठता सूची (एनटी) नोटिफिकेशन दिनांक 02.01.2024 के खिलाफ आवेदनकर्ताओं की',

        '18.12.2023 आवेदनकर्ताओं (टी) की वरिष्ठता सूची नोटिफिकेशन दिनांक 02.11.2023 के खिलाफ',

        '12-09-2023 वरिष्ठता सूची (एनटी) नोटिफिकेशन संख्या EO/3353/552 दिनांक 28.07.2023 के खिलाफ आवेदनकर्ताओं की',

        '18-07-2023 आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/547 दिनांक 24.07.2023 के खिलाफ',

        '17-05-2023 आवेदनकर्ताओं (टी) की वरिष्ठता सूची नोटिफिकेशन दिनांक 18.04.2023 के खिलाफ',

        '16-02-2023 आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/51 दिनांक 18.01.2023 के खिलाफ',

        '13-12-2022 आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/690 दिनांक 03.11.2022 के खिलाफ',

        '16-08-2022 आवेदनकर्ताओं (टी) की वरिष्ठता सूची आवासों के लिए नोटिफिकेशन दिनांक 23.06.2022 16082022 के खिलाफ',

        '15-06-2022 आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO3353299 दिनांक 17.05.2022 के खिलाफ',
        '05-04-2022 आवेदनकर्ताओं (टी) की वरिष्ठता सूची अप्रैल 2022',
        '10-03-2022 आवेदनकर्ताओं की वरिष्ठता सूची (एफ)',
        '05-08-2021 आवेदनकर्ताओं (टी) की वरिष्ठता सूची',
        '05-08-2021 आवेदनकर्ताओं (एनटी) की वरिष्ठता सूची',

        '05-01-2020 वरिष्ठता सूची आवेदनकर्ताओं (एनटी) एफ-प्रकार के आवासों के आवंटन के लिए',
        '03-11-2020 आवेदनकर्ताओं की वरिष्ठता सूची शिक्षण',
        '06-08-2020 शिक्षण आवेदनकर्ताओं की वरिष्ठता सूची अगस्त 2020',

        '18-02-2020 वरिष्ठता सूची आवेदनकर्ताओं (एनटी) जिनके खिलाफ 23.01.2020 को नोटिफाई किया गया था',
        'शिक्षण के लिए आवेदनकर्ताओं की वरिष्ठता सूची',

        'एफ-प्रकार के आवासों के लिए आवेदनकर्ताओं (एनटी) की वरिष्ठता सूची',
        'शिक्षण आवेदनकर्ताओं की वरिष्ठता सूची 03-10-2019',
        'एनटी आवेदनकर्ताओं की वरिष्ठता सूची 19-09-2019',

        'आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/298 दिनांक 16/5/2019 के खिलाफ',
        'ई-एफ-प्रकार के आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची',

        'नोटिफाइड ई-प्रकार के आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची',
        'आवेदनकर्ताओं की वरिष्ठता सूची (एनटी)',

        'आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/468 दिनांक 24.07.2018 के खिलाफ',

        'आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3352/246 दिनांक 16.04.2018 के खिलाफ',

        'आवासों के लिए आवेदनकर्ताओं की वरिष्ठता सूची नोटिफिकेशन संख्या EO/3353/735 और 736 दिनांक 23.11.2017 के खिलाफ',
        'अप्रशिक्षित आवेदनकर्ताओं की वरिष्ठता सूची',
        'आवेदनकर्ताओं की वरिष्ठता सूची',
      ],
    },
    GeneralAdministration: {},
    HealthCentre: {
      name: 'स्वास्थ्य केंद्र',
      headings: {
        about: 'के बारे में',
        staff: 'कर्मचारी',
        timings: 'समय',
        facilities: 'सुविधाएँ',
        aboutText:
          'कैंपस आबादी जिसमें छात्र, स्टाफ सदस्य और उनके परिवार के सदस्य शामिल हैं, की बहुपेक्षावाला चिकित्सा आवश्यकताओं को संतुलित करने के लिए संस्थानिक स्वास्थ्य केंद्र द्वारा पूरा किया जाता है। स्वास्थ्य केंद्र का मुख्य हैड (हॉस्पिटल सेवाएं) एक समूह के साथ है, जिसमें चिकित्सा अधिकारियों और पैरा चिकित्सा कर्मचारियों की टीम है। निदेशक ने संस्थान की हॉस्पिटल सलाहकार समिति की भी गठन की है, जिसमें उनके द्वारा नामित एक अध्यक्ष और सदस्यों का चयन किया गया है जो संस्थान के अन्य मान्यता प्राप्त निकायों से आएँ हैं, साथ ही हेड (हॉस्पिटल सेवाएं) समिति के सदस्य सचिव।',
        staffText: 'कर्मचारी सदस्य',
        insurance: 'चिकित्सा बीमा',
        immunization: 'टीकाकरण',
        ambulance: 'एम्बुलेंस',
        ecg: 'ईसीजी',
        dental: 'दंत चिकित्सा',
        opd: 'ओपीडी',
        lab: 'प्रयोगशाला सेवाएं',
        pharmacy: 'फार्मेसी',
        radiology: 'रेडियोलॉजी/एक्स-रे सुविधा',
        casualty: 'आपातकालीन',
      },
      facilities: {
        counsellor: 'परामर्शक सेवाएँ',
        immunization: 'टीकाकरण',
        hospitals: 'अस्पताल और प्रयोगशालाएं वाट',
        insurance: 'मेडिकल इन्श्योरेंस',
        ambulance: [
          `  एम्बुलेंस सुविधा: स्वास्थ्य केंद्र के पास प्रतिदिन 24 घंटे उपलब्ध एम्बुलेंस वाहन का समर्थन है, जो उपचार के लिए संस्थान स्वास्थ्य केंद्र से स्थानीय सरकारी अस्पताल / एम्पैनल्ड अस्पताल / सरकारी चिकित्सा संस्थान तक मरीजों के परिवहन के लिए उपयुक्त प्रबंधन के लिए है:`,
          `- छात्र, स्टाफ और उनके आश्रितों के लिए एम्बुलेंस सेवाएं स्वास्थ्य संस्थान के एसएमओ / एमओ द्वारा सरकार / एम्पैनल्ड अस्पतालों में उपचार के लिए रेफर किए जाने पर मुफ्त में प्रदान की जाती है। आंतरिक मामलों में एम्बुलेंस केवल आंतरिक मामलों में अनुमति दी जाती है। इसके अलावा, एम्बुलेंस का फॉलो अप के लिए अनुमति नहीं है।`,

          '- स्वास्थ्य संस्थान के कर्मचारियों की पत्नियों और आश्रितों के लिए एम्बुलेंस सेवाएं सरकारी / एम्पैनल्ड अस्पतालों के लिए डिलीवरी के उद्देश्य से मुफ्त में प्रदान की जाती है। एम्बुलेंस सेवाएं अस्पताल से संस्थान कैंपस तक मृत शव को ले जाने के लिए मुफ्त में प्रदान की जाती हैं। एसएमओ / एमओ के अनुपस्थिति में एम्बुलेंस के अनुरोध की अनुमति प्रोफेसर I / c (स्वास्थ्य केंद्र) द्वारा दी जाएगी।',
          `एम्बुलेंस टेल: +91-9467844800`,
        ],
        opd: `ओपीडी: ओपीडी में, रोगियों को नॉलेज दिया जाता है और आवश्यक मामलों में प्रयोगशाला परीक्षण की सलाह दी जाती है।`,
        dental: `डेंटल सुविधा: एक अनुभवी डेंटल सर्जन डेंटल निकालन, आरसीटी, स्केलिंग / सफाई, भरना आदि जैसी प्रक्रियाएँ प्रदान करता है।`,
        lab: `प्रयोगशाला सेवाएँ: संस्थान स्वास्थ्य केंद्र पर नियमित जांच कार्यक्रम किए जाते हैं। एक पैथोलॉजिकल लैब का पंजीकरण किया गया है जो विशेषज्ञ परीक्षणों को संचालित करने के लिए है। माइक्रोबायोलॉजी परीक्षण को बाहर संदर्भित किया जाता है।`,
        pharmacy: `फार्मेसी: शिक्षक, गैर-शिक्षक कर्मचारियों, उनके आश्रितों और छात्रों के लिए नियमित दवाएँ उपलब्ध हैं। दवाएँ एसएमओ / एमओ, स्वास्थ्य केंद्र की पर्ची पर डिस्पेंस की जाती हैं।`,
        radiology: `रेडियोलॉजी / एक्स-रे सुविधा: डिजिटल एक्स-रे एसएमओ / एमओ, स्वास्थ्य केंद्र की पर्ची पर या परीक्षण समय के दौरान किए जाते हैं। (9:00 बजे से 1:00 बजे तक) और (3:00 बजे से 5:30 बजे तक)।`,
        ecg: `ईसीजी सेवाएँ: कम्प्यूटरीकृत ईसीजी सेवाएं स्वास्थ्य केंद्र में आपके ओपीडी के समय में उपलब्ध हैं। (9:00 बजे से 1:00 बजे तक) और (3:00 बजे से 5:30 बजे तक)।`,
        casualty: [
          `कैजुअल्टी / ट्रियाज: 08 बिस्तरों (04 बिस्तर महिला वार्ड में और 04 बिस्तर पुरुष वार्ड में) के साथ एक सुसज्जित कैजुअल्टी आपातकालीन मामलों के लिए उपलब्ध है। टाइफाइड, एक्यूट गैस्ट्रोएंटेराइटिस, सीओपीडी, ब्रोंकियल अस्थमा मलेरिया, डिस्मेनोरिया, एक्यूट कोलिक आदि जैसी विभिन्न बीमारियों का इलाज दिया जाता है।`,
          `कैजुअल्टी / ट्रियाज: 08 बिस्तरों (04 बिस्तर महिला वार्ड में और 04 बिस्तर पुरुष वार्ड में) के साथ एक सुसज्जित कैजुअल्टी आपातकालीन मामलों के लिए उपलब्ध है। टाइफाइड, एक्यूट गैस्ट्रोएंटेराइटिस, सीओपीडी, ब्रोंकियल अस्थमा मलेरिया, डिस्मेनोरिया, एक्यूट कोलिक आदि जैसी विभिन्न बीमारियों का इलाज दिया जाता है।`,
        ],
      },
      staff: {
        sr: 'क्रम संख्या',
        name: 'नाम',
        designation: 'पदनाम',
        phone: 'फ़ोन',
        officers: 'चिकित्सा अधिकारी',
        other: 'चिकित्सा कर्मचारी',
      },
      timings: {
        day: 'दिन',
        from: 'से',
        to: 'तक',
        tod: 'दिन का समय',
      },
      hospitals: {
        sr: 'क्रमांक',
        name: 'अस्पताल का नाम',
        field: 'विशेषज्ञता का क्षेत्र',
        contact: 'संपर्क नंबर',
      },
      insurance: {
        text: 'वर्तमान में, जिन कर्मचारियों ने चिकित्सा बीमा का विकल्प चुना है, उन्हें गंभीर बीमारी के लिए प्रति वर्ष 5 लाख रुपये का कवर मिलता है। इसी प्रकार, छात्रों के पास अब तक प्रति वर्ष 1 लाख रुपये का चिकित्सा बीमा कवर है।',
        link: 'कैशलेस चिकित्सा बीमा योजना का उपयोग करने के लिए यहां क्लिक करें:',
        text2:
          '(उपयोगकर्ता नाम: NITK<कर्मचारी आईडी या छात्र रोल नंबर>, पासवर्ड: NITK<कर्मचारी आईडी या छात्र रोल नंबर>)',
      },
      immunization: {
        text1:
          'टीकाकरण विश्व स्वास्थ्य संगठन (WHO) के टीकाकरण अनुसूची के अनुसार जिला अस्पताल स्टाफ द्वारा हर महीने के पहले गुरुवार को NIT स्वास्थ्य केंद्र में प्रदान किया जाता है।',
        timings: 'समय: सुबह 10:00 बजे से दोपहर 02:00 बजे तक।',
        text2:
          'पल्स पोलियो कार्यक्रम: पल्स पोलियो कार्यक्रम समय-समय पर राज्य सरकार द्वारा संस्थान स्वास्थ्य केंद्र में आयोजित किया जाता है।',
        text3:
          '*नोट: NIT स्वास्थ्य केंद्र का बाहरी टीकाकरण स्टाफ या उनके कार्यक्रम पर सीधे कोई नियंत्रण नहीं है, जो जिला अस्पताल के CMO के निर्देशानुसार बदल सकता है।',
        schedule: 'बच्चों के लिए टीकाकरण अनुसूची',
      },
    },
    Security: {},
    Sports: {},
    Store: {},
  },
  Sections: {
    title: 'प्रशासनिक और अवसंरचना सेवाएँ',
  },
  Status: {
    NoResult: {
      title: '404',
      description: 'आपके दिए गए प्रश्न से कोई परिणाम मेल नहीं खाता।',
    },
    Unauthorised: {
      title: '403',
      description: 'अनुमति नहीं है।',
    },
    WorkInProgress: {
      title: '501',
      description: 'कार्य प्रगति पर है।',
    },
    NotAcceptable: {
      title: '406',
      description: 'अस्वीकार्य दुबारा प्रयास करें।',
    },
  },
  StudentActivities: {
    title: 'छात्र गतिविधियाँ',
    headings: {
      clubs: 'संघठनें',
      council: 'छात्र परिषद',
      events: 'आयोजनाएँ',
      thoughtLab: 'विचार प्रयोगशाला',
      nss: 'एनएसएस',
      ncc: 'एनसीसी',
    },
    sections: { clubs: { title: 'संघठनें', more: 'सभी संघठनो को तलाशें' } },
  },
  DirectorMessage: {
    title: 'निदेशक महोदय का संदेश',
    message: [
      `साधकों की भूमि भारत, 1100 वर्षो की अधीनता, युद्ध, अनुबंध और अपमान के बाद फिर से विश्व गुरु बनने के कगार पर है । हमारे नेताओं, स्वतंत्रता सेनानियों के बलिदान के कारण यह फिर से एक स्वतंत्र देश है और इसने पिछले 75 वर्षो से अपनी समृद्ध विविधता, संस्कृतियों , भाषाओं के साथ राष्ट्र के निर्माण की चुनौतियों के बीच लंबे समय से खड़े होने की कला सीखी है । हमारे राष्ट्र को हर क्षेत्र में मजबूत बनाते हुए विविधता में एकता हमारा मंत्र है ।`,
      `कुरुक्षेत्र की भूमि को धर्म क्षेत्र के रूप में भी जाना जाता है, जिसने हमें अपने आचरण में धर्मी होना, मूल्यों को बनाए रखना, स्वयं को या कमजोर विषयों पर किसी भी हमले को रोकने के लिए आत्म – मजबूत बनाना सिखाया है । भगवद्‌ गीता का दिव्य संदेश हमें समग्र व्यक्तित्व का 360 डिग्री विकास प्राप्त करना सिखाता है और हमारे सभी संदेहों, दुर्दशाओं को दूर करने का प्रयास करता है और हमें खोजने, स्वयं और भौतिक दुनिया को तलाशने के लिए मार्गदर्शन करता है ।`,
      `सदियों से बिना किसी संदेह के यह साबित हो गया है कि कोई भी राष्ट्र अपनी प्रजा को शिक्षित किए बिना कभी भी विश्व नेता या खुशहाल राष्ट्‌ के कद तक नहीं बढ़ा है। विश्वविद्यालयों और उत्कृष्टता केंद्रों की भूमिका कभी सवालों के घेरे में नहीं थी। रचनात्मकता, नवीनता और व्यावहारिक अनुभव को महत्व दिया गया और प्रकृति ब्रह्मांड के रहस्यों को जानने की प्रायोगिक प्रयोगशाला थी। नालंदा और तक्षशिला के रूप में विश्वविद्यालय अंतर्राष्ट्रीय स्तर के शिक्षा केंद्रों के कद तक बढ़ गए, जो कि 64 कला रूपों के रूप में जाने जाने वाले विभिन्‍न प्रकार की गतिविधियों में खुद को तलाशने और प्रकृति के रहस्यों को उजागर करने के लिए युवा दिमाग का पोषण करते रहे | उन्होंने सस्वर पाठ, अनुभव और अनुभवात्मक शिक्षा के माध्यम से कौशल का पता लगाया । प्रसिद्ध गुरु शिष्य परम्परा युगों और पीढ़ियों से चली आ रही थी ।`,
      `तक्षशिला विश्वविद्यालय कभी न खत्म होने वाले लिपियों के संग्रह के कारण ही प्रसिद्ध नहीं था बल्कि यह मौजूद ज्ञान के कारण प्रसिद्ध था कि इंसान कैसे सबसे अच्छा काम कर सकता है । हमारी जाति के पास बुद्धि का उपयोग करने का ज्ञान है।`,
      `भारत और एनआईटी क्रुक्षेत्र जैसे महान राष्ट्‌ के लिए राष्ट्रीय स्तर के परीक्षण के माध्यम से चयन की कठोर प्रक्रिया के माध्यम से देश भर से चयनित हुए युवा दिमाग की क्षमता का दोहन करने के लिए सही विधि क्‍या हो सकती है । ये युवा लड़के और लड़कियां सीखने के इन मचों तक पहुंचने के लिए वास्तव में कठिन परिश्रम करते हैं । यह हमारा प्रयास है कि हम शिक्षण, सीखने का सही वातावरण प्रदान करें और उन्हें न केवल आगे बढ़ने वाली प्रौद्योगिकियों को स्वयं और प्रगति का पता लगाने की अनुमति दें बल्कि कई सामाजिक समस्याओं को हल करने और सेट करने में मार्गदर्शक शक्ति बनने के लिए रचनात्मकता और नवीन लक्षणों के अपने जन्मजात कौशल को बढ़ावा दें । एक ऐसा उदाहरण प्रस्तुत कर दें कि विश्वविद्यालय और उत्कृष्टता केंद्र अकेले ज्ञान की स्थापना के लिए अलग स्थान न बन जाए बल्कि स्टार्ट-अप संस्कृति और उद्यमशीलता की मानसिकता को बढ़ावा देकर राष्ट्‌ के विकास में योगदान कर सकें। इस दिशा में , एनआईटी कुरुक्षेत्र इन युवा दिमागों को एनआईटी कुरुक्षेत्र – स्थानीय समुदाय लिंक के माध्यम से जोड़कर अनुभवात्मक सीखने को बढ़ावा देते हुए महत्वपूर्ण सोच, पूछताछ, बहस और चर्चा के लिए सेटिंग बदलने और रटने की गति को समाप्त करेगा। कोई भी शिक्षा पूर्ण नहीं है, यदि विद्वान ज्ञान की ओर ले जाने वाले तथा ज्ञान को प्राप्त करने के लिए सीखने के स्तर से आगे बढ़ने में असमर्थ है ।`,
      `पिछले दो वर्षों में, महामारी के समय में , पूरी दुनिया में कई लोगों की जान गंवाई, आजीविका खो दी, राष्ट्रों को विकास की कमी का सामना करना पड़ा और इस तरह के परीक्षण के समय की चुनौतियों ने कई लोगों को अवसाद, चिंता, आत्महत्या की प्रवृत्ति, प्रिय की हानि आदि का कारण बना दिया । हम अभी भी महामारी से निपटने के लिए जूझ रहे हैं और वर्चुअल प्लेटफॉर्म पर ऑर्डर की समानता लाने का बीड़ा उठाया है । कुछ कठिन सबक सीखे गए हैं और शिक्षा क्षेत्र सबसे अधिक प्रभावित क्षेत्रों में से एक है, जहां युवा दिमाग शारीरिक,मानसिक, भावनात्मक और आध्यात्मिक रूप से अस्थिर थे । मानवीय उत्कृष्टता प्राप्त करने में इन सहज गुणों का पता लगाने का समय आ गया है ।`,
      `पुराने १६९ में से एक के निदेशक का पदभार ग्रहण करने के बाद, अब 05 फरवरी, 2022 (बसंत पंचमी) को राष्ट्रीय महत्व के संस्थान की स्थिति के साथ एनआईटी के रूप में परिवर्तित हुआ, मैं अपने शिक्षण, गैर-शिक्षण संकाय और सहायक कर्मचारियों के साथ आपका स्वागत करता हूं और हम ऑनलाइन शिक्षण, सीखने आदि के माध्यम से दो साल के अलगाबव के बाद प्रिय छात्रों के परिसर में आने के लिए बेसब्री से इंतजार करते हुए, स्वागत करने के लिए पूरी तरह से तैयार है। नेता के रूप में मैं आपको विश्वास दिलाता हूं कि घर के अनुरूप माहौल बनाकर, अपने आप को तलाशने के लिए घर से अधिक जगह बनाकर, खुद को तलाशने के लिए सुविधाएं और भौतिक प्रगति प्रदान करके, आपको बड़े सपने देखने की अनुमति देकर लाड्-प्यार करूंगा । मैं व्यक्तिगत रूप से कामना करता हूं कि आप में से प्रत्येक जीवन के प्रति जुनूनी बनें और टेक्नोक्रेट, व्यवसायी , विश्व नेताओं आदि के रूप में बड़े पैमाने पर समाज की सेवा करें। मैं विश्वास दिलाता हूं कि राष्ट्रीय शिक्षा नीति 2020 (एनईपी 2020) का कार्यान्वयन सर्वोच्च प्राथमिकता होगी ।`,
      `एनआईटी क्रुक्षेत्र के लोगो में एक आदर्श वाक्य है जो इस प्रकार है`,
      `"श्रमोऽनवरत चेष्टा च"`,
      `जिसका अर्थ है कड़ी मेहनत और लगातार प्रयास उत्कृष्टता की ओर ले जाते हैं ।`,
      `मैं सभी छात्र उम्मीदवारों को एनआईटी क्रुक्षेत्र के प्रांगण में प्रवेश करने के लिए बधाई देता हूं और एनआईटी क््‌रुक्षेत्र के सभी परिवार के सदस्यों को उनके सभी प्रयासों में सफलता की कामना करता हूं । मैं लगभग दो साल के लॉकडाउन जैसी स्थिति के बाद आपका स्वागत करने का बेसब्री से इंतजार कर रहा हूं, जिसमें तीन सौ एकड़ के विशाल परिसर में एक साथ आनंद और मस्ती का आनंद लिया जा रहा है। मैं अपने प्यारे छात्रों के सभी माता-पिता को विश्वास दिलाता हूं कि आपके बच्चे सुरक्षित हाथों में हैं, उनके साथ यथासंभव प्यार और उनकी देखभाल की जाएगी ।`,
      `जय हिन्द…………`,
      `प्रो. बी. वी. रमना रेड्डी`,
    ],
  },
  TrainingAndPlacement: {
    title: 'प्रशिक्षण और स्थाननीयता',
    headings: {
      ourrecruiters: 'हमारे भर्तीकर्ता',
      stats: 'स्थाननीयता सांख्यिकी',
      guidelines: 'मार्गदर्शिका',
      about: 'हमारे बारे में',
      forrecruiters: 'भर्तीकर्ताओं के लिए',
      faq: 'सामान्य प्रश्न',
    },
    about: {
      content: [
        `NIT कुरुक्षेत्र देश में प्रमुख तकनीकी संस्थानों में से एक है। 1963 में क्षेत्रीय इंजीनियरिंग कॉलेज कुरुक्षेत्र के रूप में स्थापित हुआ, संस्थान को 26 जून 2002 को राष्ट्रीय प्रौद्योगिकी संस्थान कुरुक्षेत्र के नाम से पुनः नामांकित किया गया। संस्थान सात इंजीनियरिंग श्रेणियों में 4 वर्षीय बी. टेक डिग्री पाठ्यक्रम, 22 विज्ञान और प्रौद्योगिकी के क्षेत्रों में 2 वर्षीय एम. टेक डिग्री पाठ्यक्रम और एमबीए और एमसीए के डिग्री प्राप्ति के लिए स्नातकोत्तर पाठ्यक्रम प्रदान करता है। संरचना उच्च गुणवत्ता के तकनीकी कार्मिकों को उत्पन्न करने के लिए अनुकूलित है।`,
        `स्थाननीयता और प्लेसमेंट (टी एंड पी) सेल संस्थान के साथ फलदायी संबंध स्थापित करने के लिए आवश्यक संपर्क बिंदु है। सेल को प्रोफेसर इन-चार्ज के द्वारा नेतृत्व किया जाता है, और फैकल्टी इन-चार्ज, प्लेसमेंट कोआर्डिनेशन कमेटी ऑफ स्टूडेंट्स (पीसीसी) और सचिवालय का समर्थन किया गया है।`,
      ],
      tnpbrochure: `टी एंड पी ब्रोशर (2023-24)`,
      tnpteam: `टी एंड पी टीम (2023-24)`,
      facilities: {
        heading: `NIT कुरुक्षेत्र भर्ती कंपनियों को सर्वोत्तम समर्थन और सुविधाएं देता है।`,
        content: [
          'प्री-स्थाननीयता वार्ता (पीपीटी), कार्यशालाओं आदि के लिए नवीनतम मल्टीमीडिया और वाई-फाई से पूरी तरह से लैस सभागार और व्याख्यान हॉल।',

          'टेली कॉन्फ्रेंसिंग, वीडियो कॉन्फ्रेंसिंग और ऑनलाइन साक्षात्कार की सुविधा।',

          'समूह चर्चाओं और व्यक्तिगत साक्षात्कारों के लिए सेमिनार और कॉन्फ्रेंस रूम।',

          'भर्ती पैनल के लिए गेस्ट हाउस में मध्यम सुविधाओं के साथ कैंपस आवास।',

          'स्थाननीयता प्रक्रिया के हर स्तर पर छात्र समन्वयकों द्वारा पूरी सहायता।',
          'प्रक्रिया को समन्वित करने के लिए उत्साही और अनुभवी कर्मचारी।',

          'निकटतम हवाई अड्डे और कुरुक्षेत्र रेलवे स्टेशन से पिकअप सेवाएं। यह सेवाएँ दिल्ली से भी ली जा सकती हैं।',
        ],
      },
    },
    stats: {
      content: [
        `शैक्षिक सत्र 2022-23 `,
        `शैक्षिक सत्र 2021-22`,
        `शैक्षिक सत्र 2020-21 FN`,
        `शैक्षिक सत्र 2019-20 FN `,
        `शैक्षिक सत्र 2018-19 FN`,
        `शैक्षिक सत्र 2018_19`,
        `शैक्षिक सत्र 2017_18`,
        `शैक्षिक सत्र 2017-18 FN `,
        `शैक्षिक सत्र 2016_17`,
      ],
    },
    ourrecruiters: {
      about: `NIT कुरुक्षेत्र का प्रशिक्षण और स्थाननीयता सेल, संस्थान की सभी भर्ती संबंधित गतिविधियों का आयोजन करता है। सेल निरंतर उन्नत अवसरों को छात्रों के पास लाने और भ्रमण करने वाली कंपनियों और संस्थान के बीच सभी अंतराक्रियाएँ प्रबंधित करती है। NIT कुरुक्षेत्र भर्ती कंपनियों को सर्वोत्तम सुविधाएं और समर्थन सुनिश्चित करता है।`,
    },
    forrecruiters: {
      build: `संबंध बनाएं`,
      invitaion: `आमंत्रण`,
      reach: `हमसे संपर्क करें`,
    },
    guidelines: {
      protocol: `स्थाननीयता प्रोटोकॉल`,
      tnpguidelines: `टी एंड पी सेल मार्गदर्शिका`,
      internguidlines: `यूजी इंटर्नशिप मार्गदर्शिका`,
    },
    faq: {
      questions: [
        'कैंपस से छात्रों की भर्ती के तरीके क्या हैं?',
        'प्लेसमेंट कार्यक्रम कब होता है?',
        'छात्र PPTs और/या कंपनी ब्रोशर में किस प्रकार की जानकारी की अपेक्षा करते हैं?',
        'कैंपस प्रेजेंटेशन और प्लेसमेंट प्रक्रिया आयोजित करने के लिए कितनी अच्छी तरह सुसज्जित है?',
        'क्या ऑफ-कैंपस प्लेसमेंट प्रक्रिया आयोजित करना संभव है? क्या भर्ती प्रक्रिया कैंपस में आए बिना पूरी की जा सकती है?',
        'प्लेसमेंट प्रक्रिया में छात्रों को कौन से कदम उठाने की आवश्यकता है?',
        'कंपनी को स्लॉट किस आधार पर आवंटित किया जाता है?',
        'क्या किसी छात्र को एक बार चयनित होने के बाद एक से अधिक कंपनियों के लिए आवेदन करने की अनुमति है?',
        'क्या प्लेसमेंट ड्राइव में भाग लेने के लिए कोई शुल्क है?',
      ],
      answers: [
        [
          'संस्थान में भर्ती प्रक्रिया निम्नलिखित तरीकों से की जाती है:',
          '● 6th सेमेस्टर के UG छात्रों को इंटर्नशिप के लिए नियुक्त करना और फिर उनके प्रदर्शन के अनुसार PPO की पेशकश करना।',
          '● पूरे वर्ष चलने वाले कैंपस प्लेसमेंट ड्राइव में भाग लेना।',
        ],
        [
          'अधिकांश संगठनों का दौरा मई - जून से शुरू होता है, जिसमें प्री-फाइनल वर्ष के छात्रों (16 सप्ताह से 20 सप्ताह की इंटर्नशिप) और अंतिम वर्ष के छात्रों की भर्ती होती है।',
        ],
        [
          'किसी कंपनी द्वारा आयोजित प्री-प्लेसमेंट टॉक या ब्रोशर में निम्नलिखित जानकारी होनी चाहिए:',
          'i. कंपनी का प्रोफ़ाइल और प्रतिष्ठा।',
          'ii. पोस्टिंग की स्थानें।',
          'iii. विभिन्न प्रकार के प्रोफाइल में पेश की जाने वाली करियर भूमिकाएँ और जिम्मेदारियाँ।',
          'iv. मुआवजा पैकेज।',
        ],
        [
          'कैंपस में सीनेट हॉल, प्रेजेंटेशन सुविधाएं, कंप्यूटर लैब्स (LAN कनेक्टेड), साथ ही मल्टीमीडिया और प्रोजेक्शन सुविधाएं उपलब्ध हैं। आवश्यकता होने पर कॉन्फ्रेंस रूम, प्रेजेंटेशन रूम आदि भी उपलब्ध कराए जा सकते हैं।',
        ],
        [
          'हाँ। ऑफ-कैंपस ड्राइव के लिए, संबंधित प्लेसमेंट कोऑर्डिनेटर, जो आपकी रुचि दिखाने पर संगठन को आवंटित किया जाएगा, T&P सेल से अनुमति लेगा और उस ड्राइव के लिए इच्छुक छात्रों की सहमति भी लेगा। हालाँकि, हम अत्यधिक सराहना करेंगे यदि कंपनी हमारी कैंपस में भर्ती के लिए आए, क्योंकि हम आतिथ्य के लिए जाने जाते हैं और हम इसे प्रदर्शित करने के लिए उत्सुक हैं।',
        ],
        [
          'छात्रों को जो कदम उठाने की आवश्यकता है, वे हैं:',
          '● प्लेसमेंट प्रक्रिया में भाग लेने की अपनी रुचि T&P सेल को सूचित करें।',
          '● प्लेसमेंट ड्राइव के दौरान अनुशासन बनाए रखें।',
          '● PCC और T&P सेल के मार्गदर्शन के अनुसार पूरी प्लेसमेंट ड्राइव में भाग लें।',
          '● रिज्यूमे/आवेदन समय पर जमा करें।',
        ],
        [
          'स्लॉटिंग निम्नलिखित मानदंडों के अनुसार की जाती है:',
          '● कार्य प्रोफ़ाइल',
          '● मुआवजा पैकेज',
          '● करियर के अवसर',
          '● छात्र की संख्या',
          '● NIT कुरुक्षेत्र के साथ पिछला संबंध',
        ],
        [
          'नहीं। ट्रेनिंग और प्लेसमेंट सेल ने “एक छात्र, एक नौकरी” नीति लागू की है, जिसमें एक बार किसी छात्र का चयन हो जाने पर वह आगे की प्लेसमेंट सत्रों के लिए पात्र नहीं होगा। हालाँकि, यदि किसी विशिष्ट शाखा के 80% पात्र छात्रों का चयन हो जाता है, तो सभी छात्रों को आगे की कंपनियों के लिए पात्र होने की अनुमति दी जाएगी, जिसे हम “दूसरे दौर” के रूप में संदर्भित करते हैं। PSUs के लिए, दूसरे दौर के प्लेसमेंट सत्र के लिए पात्र छात्रों का प्रतिशत 60% हो जाता है।',
        ],
        ['नहीं। पंजीकरण या प्लेसमेंट प्रक्रिया के लिए कोई शुल्क नहीं है।'],
      ],
    },
  },
};

export default text;
